Repository: doc-br/translate
Catalog: articles/*/bsdl-gpl.po
Languages: de_de

source: Large companies, in which Open Source code is developed, should be aware that programmers appreciate Open Source because it leaves the software available to the employee when they change employers. Some companies encourage this behavior as an employment perk, especially when the software involved is not directly strategic. It is, in effect, a front-loaded retirement benefit with potential lost opportunity costs but no direct costs. Encouraging employees to work for peer acclaim outside the company is a cheap portable benefit a company can sometimes provide with near zero downside.
de_de: Große Unternehmen, in denen Open-Source-Code entwickelt wird, sollten sich darüber im Klaren sein, dass Programmierer Open Source bevorzugen, weil dadurch dem Arbeitnehmer die Software auch bei einem Arbeitgeberwechsel zur Verfügung steht. Einige Unternehmen fördern diese Sicht Ihrer Mitarbeiter sogar mit Prämien, insbesondere dann, wenn es sich um Software handelt, die nicht direkt von strategischer Bedeutung ist. Es handelt sich faktisch um eine vorgezogene Altersversorgungsleistung mit potenziellen Opportunitätskosten, aber ohne direkte Kosten. Für Unternehmen kann es kostengünstig sein, Mitarbeiter zu motivieren, nach Anerkennung durch Kollegen außerhalb des Unternehmens zu streben, wobei dem Unternehmen selbst praktisch keine Nachteile entstehen.

source: Small companies with software projects vulnerable to orphaning should attempt to use the BSD license when possible. Companies of all sizes should consider forming such Open Source projects when it is to their mutual advantage to maintain the minimal legal and organization overheads associated with a true BSD-style Open Source project.
de_de: Kleine Firmen sollten bei Software-Projekten, die durch Verwaisung gefährdet sind, wo immer möglich die BSD-Lizenz verwenden. Unternehmen jeder Größe sollten die Gründung entsprechender Open-Source-Projekte prüfen, wenn es zum gegenseitigen Vorteil ist, die mit einem echten Open-Source-Projekt im BSD-Stil verbundenen minimalen rechtlichen und organisatorischen Gemeinkosten gering zu halten.

source: Non-profits should participate in Open Source projects when possible. To minimize software engineering problems, such as mixing code under different licenses, BSD-style licenses should be encouraged. Being leery of the GPL should particularly be the case with non-profits that interact with the developing world. In some locales where application of law becomes a costly exercise, the simplicity of the new BSD license, as compared to the GPL, may be of considerable advantage.
de_de: Non-Profit-Organisationen sollten sich nach Möglichkeit an Open-Source-Projekten beteiligen. Typische Software-Engineering-Probleme, wie das Kombinieren von Code verschiedener Lizenzen, lassen sich durch BSD-ähnliche Lizenzen minimieren. Besonders Non-Profit-Organisationen, die sich mit Entwicklungsländern befassen, sollten der GPL misstrauisch gegenüberstehen. In manchen Regionen kann der Rechtsweg zu einem kostspieligen Unterfangen werden. Hier kann die Einfachheit der neuen BSD-Lizenz im Vergleich zur GPL von erheblichem Vorteil sein.

source: Conclusion
de_de: Fazit

source: In contrast to the GPL, which is designed to prevent the proprietary commercialization of Open Source code, the BSD license places minimal restrictions on future behavior. This allows BSD code to remain Open Source or become integrated into commercial solutions, as a project's or company's needs change. In other words, the BSD license does not become a legal time-bomb at any point in the development process.
de_de: Anders als die GPL, die die proprietäre Kommerzialisierung von Open-Source-Code verhindern soll, schränkt die BSD-Lizenz zukünftiges Verhalten nur minimal ein. Dadurch kann BSD-Code Open Source bleiben oder in kommerzielle Lösungen integriert werden, wenn sich die Bedürfnisse eines Projekts oder Unternehmens ändern. Mit anderen Worten: Die BSD-Lizenz wird zu keinem Zeitpunkt des Entwicklungsprozesses zu einer juristischen Zeitbombe.

source: In addition, since the BSD license does not come with the legal complexity of the GPL or LGPL licenses, it allows developers and companies to spend their time creating and promoting good code rather than worrying if that code violates licensing.
de_de: Da die BSD-Lizenz außerdem nicht die rechtliche Komplexität der GPL- oder LGPL-Lizenzen aufweist, erlaubt sie es Entwicklern und Unternehmen, ihre Zeit mit der Erstellung und Förderung von gutem Code zu verbringen, anstatt sich Sorgen zu machen, ob der Code gegen die Lizenzvereinbarung verstößt.

source: Bibliographical References
de_de: Literaturverzeichnis und Quellenangaben

source: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, ``Effects of the GNU GPL''. [4] In the "What License to Use?" section of http://www.oreilly.com/catalog/opensources/book/brian.html This whitepaper is a condensation of an original work available at http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
de_de: [1] http://www.gnu.org/licenses/gpl.html [2] http://archives.cnn.com/2000/TECH/computing/03/28/cyberpatrol.mirrors/ [3] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, ``Effects of the GNU GPL''. [4] In the "What License to Use?" section of http://www.oreilly.com/catalog/opensources/book/brian.html Dieses Whitepaper ist eine Zusammenfassung folgender Arbeit: http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
