Repository: doc-br/translate
Catalog: articles/*/bsdl-gpl.po
Languages: de_de

source: One of the serious problems associated with proprietary software is known as <quote>orphaning</quote>. This occurs when a single business failure or change in a product strategy causes a huge pyramid of dependent systems and companies to fail for reasons beyond their control. Decades of experience have shown that the momentary size or success of a software supplier is no guarantee that their software will remain available, as current market conditions and strategies can change rapidly.
de_de: Eines der größten Probleme bei proprietärer Software wird als <quote>Verwaisung</quote> bezeichnet. Es tritt auf, wenn ein einzelner geschäftlicher Misserfolg oder eine Änderung der Produktstrategie zu einer Art Schneeballeffekt führt: Abhängige Systeme und Unternehmen scheitern dann aus Gründen, auf die sie keinen Einfluss haben. Jahrzehntelange Erfahrung hat gezeigt, dass die momentane Größe oder der Erfolg eines Softwareanbieters keine Garantie dafür ist, dass seine Software weiterhin verfügbar bleibt, da sich die aktuellen Marktbedingungen und Strategien schnell ändern können.

source: The GPL attempts to prevent orphaning by severing the link to proprietary intellectual property.
de_de: Die GPL will die Verwaisung verhindern, indem sie die Bindung an geistiges Eigentum aufhebt.

source: A BSD license gives a small company the equivalent of software-in-escrow without any legal complications or costs. If a BSD-licensed program becomes orphaned, a company can simply take over, in a proprietary manner, the program on which they are dependent. An even better situation occurs when a BSD code-base is maintained by a small informal consortium, since the development process is not dependent on the survival of a single company or product line. The survivability of the development team when they are mentally in the zone is much more important than simple physical availability of the source code.
de_de: Eine BSD-Lizenz gibt einem kleinen Unternehmen das Äquivalent einer Software-in-Escrow-Lizenz ohne rechtliche Komplikationen oder Kosten. Wenn ein BSD-lizenziertes Programm verwaist, kann eine Firma das Programm, auf das sie angewiesen ist, einfach proprietär übernehmen. Eine noch bessere Situation entsteht, wenn eine BSD-Codebasis von einem kleinen informellen Konsortium unterhalten wird, da der Entwicklungsprozess nicht vom Überleben einer einzelnen Firma oder Produktlinie abhängt. Die Überlebensfähigkeit eines Entwicklerteams, das völlig in seiner Arbeit aufgeht, ist wesentlich wichtiger als die bloße Verfügbarkeit des Quellcodes.

source: What a license cannot do
de_de: Was eine Lizenz nicht leisten kann

source: No license can guarantee future software availability. Although a copyright holder can traditionally change the terms of a copyright at anytime, the presumption in the BSD community is that such an attempt simply causes the source to fork.
de_de: Keine Lizenz kann die künftige Verfügbarkeit einer Software garantieren. Obwohl ein Rechteinhaber gewöhnlich jederzeit die Verwertungsbedingungen ändern kann, wird in der BSD-Gemeinschaft davon ausgegangen, dass ein solcher Versuch lediglich zu einem Fork des Quellcodes führt.

source: The GPL explicitly disallows revoking the license. It has occurred, however, that a company (Mattel) purchased a GPL copyright (cphack), revoked the entire copyright, went to court, and prevailed [2]. That is, they legally revoked the entire distribution and all derivative works based on the copyright. Whether this could happen with a larger and more dispersed distribution is an open question; there is also some confusion regarding whether the software was really under the GPL.
de_de: Die GPL verbietet es ausdrücklich, die Lizenz zu widerrufen. Es ist jedoch vorgekommen, dass eine Firma (Mattel) ein GPL-Rechte (cphack) erwarb, die komplette Lizenz widerrief, vor Gericht ging und sich durchsetzte [2]. Das heißt, sie widerriefen rechtlich die gesamte Verbreitung und alle auf Basis der GPL abgeleiteten Werke. Offen ist die Frage, ob dies bei einer größeren und weiter verstreuten Verbreitung geschehen könnte. Es besteht auch eine gewisse Verwirrung darüber, ob die Software wirklich unter der GPL stand.

source: In another example, Red Hat purchased Cygnus, an engineering company that had taken over development of the FSF compiler tools. Cygnus was able to do so because they had developed a business model in which they sold support for GNU software. This enabled them to employ some 50 engineers and drive the direction of the programs by contributing the preponderance of modifications. As Donald Rosenberg states "projects using licenses like the GPL...live under constant threat of having someone take over the project by producing a better version of the code and doing it faster than the original owners." [3]
de_de: Weiteres Beispiel: Red Hat kaufte das Softwareunternehmen Cygnus, das die Entwicklung der FSF-Compiler-Tools übernommen hatte. Cygnus war dazu in der Lage, weil das Unternehmen ein Geschäftsmodell entwickelt hatte, bei dem es Support für GNU-Software anbot. Dadurch konnte das Unternehmen etwa 50 Entwickler beschäftigen. Da Cygnus den Großteil der Änderungen beisteuerte, konnte das Unternehmen die Ausrichtung der Programme beeinflussen. Laut Donald Rosenberg "leben Projekte, die Lizenzen wie die GPL verwenden […] unter der ständigen Bedrohung, dass jemand das Projekt übernimmt, indem er eine bessere Version des Codes produziert und dies schneller als die ursprünglichen Eigentümer tut". [3]

source: GPL Advantages and Disadvantages
de_de: Vorteile und Nachteile der GPL

source: A common reason to use the GPL is when modifying or extending the gcc compiler. This is particularly apt when working with one-off specialty CPUs in environments where all software costs are likely to be considered overhead, with minimal expectations that others will use the resulting compiler.
de_de: Häufig wird die GPL verwendet, wenn der gcc-Compiler modifiziert oder erweitert wird. Wenn man mit besonderen Spezial-CPUs in Umgebungen arbeitet, in denen sämtliche Software-Kosten wahrscheinlich als Overhead gelten, ist das eine besonders geeignete Lösung. In solchen Fällen wird kaum erwartet, dass andere den resultierenden Compiler verwenden.

source: The GPL is also attractive to small companies selling CDs in an environment where "buy-low, sell-high" may still give the end-user a very inexpensive product. It is also attractive to companies that expect to survive by providing various forms of technical support, including documentation, for the GPLed intellectual property world.
de_de: Die GPL ist außerdem für kleine Unternehmen attraktiv, die CDs in einem Umfeld verkaufen, in dem der Endnutzer trotz der "Buy low, Sell high"-Methode dennoch ein sehr preiswertes Produkt erhält. Die GPL ist auch für Unternehmen attraktiv, deren Geschäftsmodell auf Dienstleistungen wie technischen Support und dem Bereitstellen von Dokumentation basiert. Auf diese Weise wollen sie mit GPL-Software in einer Welt des geistigen Eigentums überleben.

source: A less publicized and unintended use of the GPL is that it is very favorable to large companies that want to undercut software companies. In other words, the GPL is well suited for use as a marketing weapon, potentially reducing overall economic benefit and contributing to monopolistic behavior.
de_de: Weniger bekannt ist ein ursprünglich nicht von der GPL vorgesehener Einsatzzweck: Großkonzerne können damit die Preise von Softwarefirmen drücken. Mit anderen Worten: Die GPL eignet sich gut als Marketinginstrument, verringert potenziell den gesamtwirtschaftlichen Nutzen und fördert monopolistisches Verhalten.

source: The GPL can present a real problem for those wishing to commercialize and profit from software. For example, the GPL adds to the difficulty a graduate student will have in directly forming a company to commercialize his research results, or the difficulty a student will have in joining a company on the assumption that a promising research project will be commercialized.
de_de: Die GPL kann für alle ein echtes Problem darstellen, die Software kommerziell vermarkten und Gewinne erwirtschaften wollen. So verkompliziert die GPL beispielsweise die Situation eines Doktoranden, der direkt ein Unternehmen gründen will, um seine Forschungsergebnisse zu verwerten. Ebenso ist es für einen Studenten schwierig, bei einem Unternehmen zu arbeiten, wenn ein vielversprechendes Forschungsprojekt vermarktet werden soll.

source: For those who must work with statically-linked implementations of multiple software standards, the GPL is often a poor license, because it precludes using proprietary implementations of the standards. The GPL thus minimizes the number of programs that can be built using a GPLed standard. The GPL was intended to not provide a mechanism to develop a standard on which one engineers proprietary products. (This does not apply to Linux applications because they do not statically link, rather they use a trap-based API.)
de_de: Die GPL ist für alle eine schlechte Lizenz, die mit statisch gelinkten Implementierungen mehrerer Softwarestandards arbeiten müssen, da sie proprietäre Implementierungen dieser Standards ausschließt. Sie minimiert somit die Anzahl der Programme, die mit einem GPL-lizenzierten Standard entwickelt werden können. Die GPL war ursprünglich nicht dazu gedacht, einen Mechanismus zu schaffen, auf dessen Grundlage proprietäre Produkte entwickelt werden. (Dies gilt nicht für Linux-Anwendungen, weil diese nicht statisch, sondern dynamisch linken.)

source: The GPL attempts to make programmers contribute to an evolving suite of programs, then to compete in the distribution and support of this suite. This situation is unrealistic for many required core system standards, which may be applied in widely varying environments which require commercial customization or integration with legacy standards under existing (non-GPL) licenses. Real-time systems are often statically linked, so the GPL and LGPL are definitely considered potential problems by many embedded systems companies.
de_de: Die GPL möchte Programmierer dazu bringen, an Programmen mitzuwirken, die sich stetig weiterentwickeln, um dann bei der Distribution und Unterstützung dieser Programme zu konkurrieren. Diese Vorgehensweise erscheint unrealistisch bei zahlreichen notwendigen Standards für Kernsysteme. Diese können in sehr unterschiedlichen Umgebungen eingesetzt werden, die eine kommerzielle Anpassung oder Integration mit Legacy-Standards unter bestehenden (nicht unter der GPL stehenden) Lizenzen erfordern. Echtzeitsysteme sind oft statisch gelinkt. Aus diesem Grund sehen viele Hersteller eingebetteter Systeme die GPL und LGPL zweifellos problematisch.

source: The GPL is an attempt to keep efforts, regardless of demand, at the research and development stages. This maximizes the benefits to researchers and developers, at an unknown cost to those who would benefit from wider distribution.
de_de: Die GPL kümmert sich nicht um den realen Bedarf, sondern richtet alle Anstrengungen auf das Forschungs- und Entwicklungsstadium. Das maximiert den Nutzen für Forscher und Entwickler, verursacht jedoch unbekannte Kosten für alle, die von einer größeren Verbreitung profitieren würden.

source: The GPL was designed to keep research results from transitioning to proprietary products. This step is often assumed to be the last step in the traditional technology transfer pipeline and it is usually difficult enough under the best of circumstances; the GPL was intended to make it impossible.
de_de: Die GPL wurde konzipiert, um zu verhindern, dass aus Forschungsergebnissen proprietäre Produkte entstehen. Dieser Schritt gilt meist als der letzte Schritt in der traditionellen Technologietransfer-Pipeline. Selbst bei besten Voraussetzungen ist er schwierig genug – die GPL wollte ihn unmöglich machen.

source: BSD Advantages
de_de: Vorteile von BSD

source: A BSD style license is a good choice for long duration research or other projects that need a development environment that:
de_de: Eine BSD-artige Lizenz ist eine gute Wahl für langfristige Forschungsprojekte oder Projekte, die eine solche Entwicklungsumgebung mit folgenden Eigenschaften benötigen:

source: has near zero cost
de_de: nahezu null Kosten

source: will evolve over a long period of time
de_de: langfristiger Entwicklungshorizont

source: permits anyone to retain the option of commercializing final results with minimal legal issues.
de_de: gewährt jedermann die Möglichkeit, die endgültigen Resultate mit minimalem rechtlichen Aufwand zu vermarkten.

source: This final consideration may often be the dominant one, as it was when the Apache project decided upon its license:
de_de: Oft mag folgende Überlegung ausschlaggebend sein, so wie damals, als das Apache-Projekt über seine Lizenz entschied:

source: <quote>This type of license is ideal for promoting the use of a reference body of code that implements a protocol for common service. This is another reason why we choose it for the Apache group - many of us wanted to see HTTP survive and become a true multiparty standard, and would not have minded in the slightest if Microsoft or Netscape choose to incorporate our HTTP engine or any other component of our code into their products, if it helped further the goal of keeping HTTP common... All this means that, strategically speaking, the project needs to maintain sufficient momentum, and that participants realize greater value by contributing their code to the project, even code that would have had value if kept proprietary.</quote>
de_de: <quote>Dieser Lizenztyp eignet sich optimal, um die Verwendung eines Referenz-Codes zu fördern, der ein Protokoll für einen verbreiteten Dienst implementiert. Auch aus diesem Grund haben wir diese Lizenz für die Apache Group ausgewählt – viele von uns wollten, dass HTTP bestehen bleibt und zu einem echten anbieterübergreifenden Standard wird. Es hätte uns nicht im Geringsten gestört, wenn Microsoft oder Netscape unsere HTTP-Engine oder irgendeine andere Komponente unseres Codes in ihre Produkte integriert hätten, wenn das dazu beitragen würde, zur weiteren Verbreitung von HTTP beizutragen … Aus strategischer Sicht bedeutet all dies, dass das Projekt eine ausreichende Dynamik aufweisen muss und dass alle Beteiligten einen größeren Wert erkennen, wenn sie ihren Code in das Projekt einbringen, selbst Code, der einen Wert gehabt hätte, wenn er proprietär geblieben wäre.</quote>

source: Developers tend to find the BSD license attractive as it keeps legal issues out of the way and lets them do whatever they want with the code. In contrast, those who expect primarily to use a system rather than program it, or expect others to evolve the code, or who do not expect to make a living from their work associated with the system (such as government employees), find the GPL attractive, because it forces code developed by others to be given to them and keeps their employer from retaining copyright and thus potentially "burying" or orphaning the software. If you want to force your competitors to help you, the GPL is attractive.
de_de: Entwickler finden die BSD-Lizenz häufig attraktiv, da sie rechtliche Probleme aus dem Weg räumt und ihnen erlaubt, mit dem Code zu machen, was sie wollen. Im Gegensatz dazu finden Personen die GPL attraktiv, die in erster Linie erwarten, ein System zu benutzen, anstatt es zu programmieren, oder die erwarten, dass andere den Code weiterentwickeln, oder die nicht erwarten, von ihrer Arbeit im Zusammenhang mit dem System leben zu können (wie z.B. Staatsbedienstete). Denn die GPL erzwingt, dass ihnen von anderen entwickelter Code zur Verfügung gestellt wird, und hält ihren Arbeitgeber davon ab, das Copyright zu behalten und damit die Software möglicherweise zu "begraben" oder verwaisen zu lassen. Wenn Sie Ihre Konkurrenten zwingen wollen, Ihnen zu helfen, ist die GPL attraktiv.

source: A BSD license is not simply a gift. The question <quote>why should we help our competitors or let them steal our work?</quote> comes up often in relation to a BSD license. Under a BSD license, if one company came to dominate a product niche that others considered strategic, the other companies can, with minimal effort, form a mini-consortium aimed at reestablishing parity by contributing to a competitive BSD variant that increases market competition and fairness. This permits each company to believe that it will be able to profit from some advantage it can provide, while also contributing to economic flexibility and efficiency. The more rapidly and easily the cooperating members can do this, the more successful they will be. A BSD license is essentially a minimally complicated license that enables such behavior.
de_de: Eine BSD-Lizenz ist nicht einfach ein Geschenk. Die Frage <quote>Warum sollten wir unseren Konkurrenten helfen oder sie unsere Arbeit stehlen lassen?</quote> taucht oft im Zusammenhang mit BSD-Lizenzen auf. Wenn ein Unternehmen eine Produktnische dominiert, die andere Unternehmen als strategisch wichtig einstufen, können sie unter einer BSD-Lizenz mit minimalem Aufwand ein Mini-Konsortium bilden. Durch eine wettbewerbsfähige BSD-Variante stellen Sie das Marktgleichgewicht wieder her und fördern außerdem Wettbewerb und Fairness. Auf diese Weise kann jedes Unternehmen davon ausgehen, dass es einen Nutzen daraus ziehen und gleichzeitig zur wirtschaftlichen Flexibilität und Effizienz beitragen kann. Und je schneller und leichter die Kooperationspartner dies erreichen können, desto erfolgreicher werden sie sein. Eine BSD-Lizenz ist im Wesentlichen eine minimal komplizierte Lizenz, die ein solches Verhalten begünstigt.

source: A key effect of the GPL, making a complete and competitive Open Source system widely available at cost of media, is a reasonable goal. A BSD style license, in conjunction with ad-hoc-consortiums of individuals, can achieve this goal without destroying the economic assumptions built around the deployment-end of the technology transfer pipeline.
de_de: Das Hauptanliegen der GPL, ein vollständiges und wettbewerbsfähiges Open-Source-System zum Selbstkostenpreis der Datenträger allgemein verfügbar zu machen, ist ein sinnvolles Ziel. Eine BSD-ähnliche Lizenz in Verbindung mit Ad-hoc-Zusammenschlüssen von Einzelpersonen kann dieses Ziel erreichen, ohne die wirtschaftlichen Erwägungen zunichte zu machen, die auf dem Einsatzzweck der Technologietransfer-Pipeline beruhen.

source: Specific Recommendations for using a BSD license
de_de: Konkrete Empfehlungen zum Gebrauch einer BSD-Lizenz

source: The BSD license is preferable for transferring research results in a way that will widely be deployed and most benefit an economy. As such, research funding agencies, such as the NSF, ONR and DARPA, should encourage in the earliest phases of funded research projects, the adoption of BSD style licenses for software, data, results, and open hardware. They should also encourage formation of standards based around implemented Open Source systems and ongoing Open Source projects.
de_de: Eine BSD-Lizenz ist vorzuziehen, wenn Forschungsergebnisse möglichst weit verbreitet werden und der Wirtschaft nutzen sollen. Forschungsfördernde Einrichtungen wie die NSF, ONR und die DARPA sollten daher bereits in den ersten Phasen der geförderten Forschungsprojekte die Nutzung von Lizenzen im BSD-Stil für Software, Daten, Ergebnisse und offene Hardware befürworten. Sie sollten auch die Ausarbeitung von Standards fördern, die auf implementierten Open-Source-Systemen und laufenden Open-Source-Projekten basieren.

source: Government policy should minimize the costs and difficulties in moving from research to deployment. When possible, grants should require results to be available under a commercialization friendly BSD style license.
de_de: Die Regierung sollte dafür sorgen, dass beim Übergang von der Forschung zur praktischen Nutzung möglichst wenig Kosten und Schwierigkeiten auftreten. Die Bewilligung von Forschungsgeldern sollten zur Auflage machen, dass Ergebnisse unter eine Lizenz im BSD-Stil gestellt werden, die eine kommerzielle Nutzung erleichtert.

source: In many cases, the long-term results of a BSD style license more accurately reflect the goals proclaimed in the research charter of universities than what occurs when results are copyrighted or patented and subject to proprietary university licensing. Anecdotal evidence exists that universities are financially better rewarded in the long run by releasing research results and then appealing to donations from commercially successful alumni.
de_de: Langfristig betrachtet spiegeln die Ergebnisse einer BSD-Lizenz in vielen Fällen die wissenschaftlichen Zielsetzungen von Universitäten besser wider als urheberrechtlich geschützte oder patentierte Ergebnisse, die einer proprietären Universitätslizenz unterliegen. Vieles deutet darauf hin, dass Universitäten auf lange Sicht finanziell besser dastehen, wenn sie Forschungsergebnisse veröffentlichen und dann auf Spenden von kommerziell erfolgreichen Alumni setzen.

source: Companies have long recognized that the creation of de facto standards is a key marketing technique. The BSD license serves this role well, if a company really has a unique advantage in evolving the system. The license is legally attractive to the widest audience while the company's expertise ensures their control. There are times when the GPL may be the appropriate vehicle for an attempt to create such a standard, especially when attempting to undermine or co-opt others. The GPL, however, penalizes the evolution of that standard, because it promotes a suite rather than a commercially applicable standard. Use of such a suite constantly raises commercialization and legal issues. It may not be possible to mix standards when some are under the GPL and others are not. A true technical standard should not mandate exclusion of other standards for non-technical reasons.
de_de: Häufig spiegeln die langfristigen Auswirkungen einer BSD-Lizenz in die wissenschaftlichen Zielsetzungen von Universitäten besser wider als urheberrechtlich geschützte oder patentierte Ergebnisse, die einer proprietären Universitätslizenz unterliegen. Vieles deutet darauf hin, dass Universitäten auf lange Sicht finanziell besser dastehen, wenn sie Forschungsergebnisse veröffentlichen und dann auf Spenden von kommerziell erfolgreichen Alumni setzen.

source: Companies interested in promoting an evolving standard, which can become the core of other companies' commercial products, should be wary of the GPL. Regardless of the license used, the resulting software will usually devolve to whoever actually makes the majority of the engineering changes and most understands the state of the system. The GPL simply adds more legal friction to the result.
de_de: Wenn Firmen einen sich entwickelnden Standard fördern wollen, der Kernbestandteil kommerzieller Produkte anderer Firmen werden kann, ist Vorsicht vor der GPL geboten. Unabhängig von der verwendeten Lizenz gehört die resultierende Software in der Regel demjenigen, der die Mehrzahl der technischen Änderungen vornimmt und den Zustand des Systems am besten versteht. Die GPL führt bei einem Projekt schlicht zu mehr juristischen Reibungsverlusten.
