Repository: doc-br/translate
Catalog: articles/*/bsdl-gpl.po
Languages: de_de

# _
source: translator-credits
de_de: Michael Kufner, MichaelKufner@t-online.de, 2020

source: Why you should use a BSD style license for your Open Source Project
de_de: Warum Sie eine BSD-artige Lizenz für Ihr Open-Source-Projekt verwenden sollten

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
de_de: FreeBSD ist ein eingetragenes Markenzeichen der FreeBSD Foundation.

source: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium, and Xeon are trademarks or registered trademarks of Intel Corporation or its subsidiaries in the United States and other countries.
de_de: Intel, Celeron, Centrino, Core, EtherExpress, i386, i486, Itanium, Pentium und Xeon sind Marken oder eingetragene Marken der Intel Corporation oder ihrer Tochtergesellschaften in den Vereinigten Staaten und anderen Ländern.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
de_de: Viele der von Herstellern und Verkäufern zur Unterscheidung ihrer Produkte verwendeten Bezeichnungen werden als Marken geltend gemacht. Dort, wo in diesem Dokument solche Bezeichnungen erscheinen und dem FreeBSD-Projekt der Markenanspruch bekannt war, wurden die Bezeichnungen mit dem Symbol <quote>™</quote> oder dem Symbol <quote>®</quote> versehen.

source: $FreeBSD: head/en_US.ISO8859-1/articles/bsdl-gpl/article.xml 53942 2020-03-01 12:23:40Z carlavilla $
de_de: $FreeBSD: head/en_US.ISO8859-1/articles/bsdl-gpl/article.xml 43184 2013-11-13 07:52:45Z hrs $

source: Introduction
de_de: Einleitung

source: This document makes a case for using a BSD style license for software and data; specifically it recommends using a BSD style license in place of the GPL. It can also be read as a BSD versus GPL Open Source License introduction and summary.
de_de: Dieses Dokument plädiert dafür, eine BSD-artige Lizenz für Software und Daten zu verwenden. BSD-artige Lizenzen sollten insbesondere an Stelle der GPL verwendet werden. Dieses Dokument versteht sich auch als Einführung und Zusammenfassung der Debatte über das Für und Wider zwischen den Open-Source-Lizenzen BSD und GPL.

source: Very Brief Open Source History
de_de: Kurzer Überblick über die Open-Source-Geschichte

source: Long before the term <quote>Open Source</quote> was used, software was developed by loose associations of programmers and freely exchanged. Starting in the early 1950's, organizations such as <link xlink:href="http://www.share.org">SHARE</link> and <link xlink:href="http://www.decus.org">DECUS</link> developed much of the software that computer hardware companies bundled with their hardware offerings. At that time computer companies were in the hardware business; anything that reduced software cost and made more programs available made the hardware companies more competitive.
de_de: Lange bevor der Begriff <quote>Open Source</quote> verwendet wurde, entwickelten Programmierer in lockeren Gemeinschaften Software und tauschten diese untereinander aus. Seit Anfang der 1950er Jahre entwickelten Organisationen wie <link xlink:href="http://www.share.org">SHARE</link> und <link xlink:href="http://www.decus.org">DECUS</link> einen Großteil der Software, die Computerhersteller mit ihrer Hardware anboten. In dieser Zeit konzentrierten sich Computerfirmen auf das Hardwaregeschäft. Alles, was die Kosten für Software reduzierte und gleichzeitig das Angebot an Programmen erhöhte, machte die Hardware-Firmen wettbewerbsfähiger.

source: This model changed in the 1960's. In 1965 ADR developed the first licensed software product independent of a hardware company. ADR was competing against a free IBM package originally developed by IBM customers. ADR patented their software in 1968. To stop sharing of their program, they provided it under an equipment lease in which payment was spread over the lifetime of the product. ADR thus retained ownership and could control resale and reuse.
de_de: Dieses Geschäftsmodell änderte sich in den 1960er Jahren. 1965 entwickelte ADR die erste Software, die unabhängig von einem Hardware-Anbieter lizenziert wurde. ADR konkurrierte mit einem kostenlosen IBM-Paket, das ursprünglich von IBM-Kunden entwickelt worden war. ADR ließ sich 1968 ihre Software patentieren. Um die unerlaubte Weitergabe ihres Programms zu unterbinden, boten sie es Im Rahmen eines Geräteleasings an. Die Zahlungen wurden dabei über die gesamte Lebensdauer des Produkts verteilt. Auf diese Weise schützte ADR ihr Eigentum und kontrollierte sowohl den Weiterverkauf als auch die Wiederverwendung der Software.

source: In 1969 the US Department of Justice charged IBM with destroying businesses by bundling free software with IBM hardware. As a result of this suit, IBM unbundled its software; that is, software became independent products separate from hardware.
de_de: 1969 beschuldigte das US-Justizministerium IBM der Zerstörung von Unternehmen durch Bündelung kostenloser Software mit IBM-Hardware. Daraufhin entbündelte IBM ihre Software: Software war nun ein von der Hardware unabhängiges Produkt.

source: In 1968 Informatics introduced the first commercial killer-app and rapidly established the concept of the software product, the software company, and very high rates of return. Informatics developed the perpetual license which is now standard throughout the computer industry, wherein ownership is never transferred to the customer.
de_de: Im Jahr 1968 verhalf das Unternehmen Informatics mit dem ersten kommerziell erfolgreichen Programm dem gewerblichen Vertrieb von Software zum Durchbruch und etablierte sich als Softwareunternehmen mit sehr hohen Renditen. Informatics führte das Konzept der unbefristeten Lizenz ein, das heute in der gesamten Computerindustrie Standard ist, wobei das Eigentum an der Software niemals auf den Kunden übertragen wird.

source: Unix from a BSD Licensing Perspective
de_de: Unix aus der Sicht der BSD-Lizenzen

source: AT&amp;T, who owned the original Unix implementation, was a publicly regulated monopoly tied up in anti-trust court; it was legally unable to sell a product into the software market. It was, however, able to provide it to academic institutions for the price of media.
de_de: Das ursprüngliche Unix gehörte AT&amp;T, einem staatlich regulierten Monopol, das schließlich vor dem Kartellgerichtshof landete. Es gab keinen legalen Zugang zum Softwaremarkt. Allerdings konnten man akademischen Einrichtungen Software zum Preis der Datenträger anbieten.

source: Universities rapidly adopted Unix after an OS conference publicized its availability. It was extremely helpful that Unix ran on the PDP-11, a very affordable 16-bit computer, and was coded in a high-level language that was demonstrably good for systems programming. The DEC PDP-11 had, in effect, an open hardware interface designed to make it easy for customers to write their own OS, which was common. As DEC founder Ken Olsen famously proclaimed, <quote>software comes from heaven when you have good hardware</quote>.
de_de: An den Universitäten verbreitete sich Unix schnell, nachdem es Thema einer OS-Konferenz war. Sehr hilfreich war, dass Unix auf der PDP-11 lief, einem sehr preiswerten 16-Bit-Rechner, und in einer Hochsprache programmiert war, die sich nachweislich gut zur Systemprogrammierung eignet. Die Hardware-Schnittstelle der DEC PDP-11 war offen dokumentiert. Das erleichterte es den Kunden, ihr eigenes Betriebssystem zu schreiben, was durchaus üblich war. In einem berühmten Satz erklärte DEC-Gründer Ken Olsen: <quote>Software kommt aus dem Himmel, wenn man gute Hardware hat</quote>.

source: Unix author Ken Thompson returned to his alma mater, University of California Berkeley (UCB), in 1975 and taught the kernel line-by-line. This ultimately resulted in an evolving system known as BSD (Berkeley Standard Distribution). UCB converted Unix to 32-bits, added virtual memory, and implemented the version of the TCP/IP stack upon which the Internet was essentially built. UCB made BSD available for the cost of media, under what became known as <quote>the BSD license</quote>. A customer purchased Unix from AT&amp;T and then ordered a BSD tape from UCB.
de_de: Der Unix-Schöpfer Ken Thompson kehrte 1975 an seine Alma Mater, die University of California Berkeley (UCB), zurück und unterrichtete dort den Kernel Zeile für Zeile. Dies führte schließlich zu einem sich entwickelnden System namens BSD (Berkeley Standard Distribution). Die UCB konvertierte Unix auf 32-Bits, fügte virtuellen Speicher hinzu und implementierte die Version des TCP/IP-Stacks, auf dem das Internet im Wesentlichen aufgebaut wurde. Die UCB stellte BSD zu den Kosten der Datenträger zur Verfügung. Dies erfolgte unter den Bedingungen, die als <quote>BSD-Lizenz</quote> bezeichnet wurden. Ein Kunde kaufte Unix von AT&amp;T und bestellte dann ein BSD-Tape bei der UCB.

source: In the mid-1980s a government anti-trust case against AT&amp;T ended with the break-up of AT&amp;T. AT&amp;T still owned Unix and was now able to sell it. AT&amp;T embarked on an aggressive licensing effort and most commercial Unixes of the day became AT&amp;T-derived.
de_de: Ein kartellrechtliches Verfahren der Regierung gegen ATT endete Mitte der 1980er Jahre mit der Zerschlagung von ATT. Unix war immer noch Eigentum von ATT und konnte nun kommerziell vertrieben werden. ATT vermarktete aggressiv Lizenzen und die meisten kommerziellen Unixe jener Zeit stammen von ATT ab.

source: In the early 1990's AT&amp;T sued UCB over license violations related to BSD. UCB discovered that AT&amp;T had incorporated, without acknowledgment or payment, many improvements due to BSD into AT&amp;T's products, and a lengthy court case, primarily between AT&amp;T and UCB, ensued. During this period some UCB programmers embarked on a project to rewrite any AT&amp;T code associated with BSD. This project resulted in a system called BSD 4.4-lite (lite because it was not a complete system; it lacked 6 key AT&amp;T files).
de_de: Anfang der 1990er Jahre verklagte AT&T die UCB wegen Lizenzverstößen im Zusammenhang mit BSD. Die UCB fand heraus, dass AT&T ohne jegliche Rücksprache oder Vergütung viele auf BSD beruhende Verbesserungen in die eigenen Produkte eingebaut hatte. Es folgte ein langwieriger Rechtsstreit zwischen AT&T und der UCB. In dieser Zeit begannen einige Programmierer der UCB damit, in BSD jeglichen auf AT&T basierenden Code neu zu schreiben. Aus diesem Projekt entstand ein System namens BSD 4.4-lite (lite, weil es kein komplettes System war; es fehlten 6 Schlüsselkomponenten von AT&T).

source: A lengthy series of articles published slightly later in Dr. Dobbs magazine described a BSD-derived 386 PC version of Unix, with BSD-licensed replacement files for the 6 missing 4.4 lite files. This system, named 386BSD, was due to ex-UCB programmer William Jolitz. It became the original basis of all the PC BSDs in use today.
de_de: Eine ausführliche Artikelreihe im Dr.-Dobbs-Magazin beschäftigte sich mit einer von BSD abgeleiteten Version von Unix für 386er PCs, die BSD-lizenzierten Ersatz für die sechs fehlenden 4.4 Lite-Dateien enthielt. Dieses 386BSD genannte System geht auf den früheren UCB-Programmierer William Jolitz zurück. Es wurde die ursprüngliche Basis aller heute verwendeten BSDs für PCs.

source: In the mid 1990s, Novell purchased AT&amp;T's Unix rights and a (then secret) agreement was reached to terminate the lawsuit. UCB soon terminated its support for BSD.
de_de: Mitte der 1990er Jahre kaufte Novell von AT&T die Rechte an Unix. Außerdem wurde eine (damals geheime) Vereinbarung zur Beilegung des Rechtsstreits getroffen. Kurz darauf hörte die UCB auf, BSD zu unterstützen.

source: The Current State of FreeBSD and BSD Licenses
de_de: Die aktuelle Lage bei den FreeBSD- und BSD-Lizenzen

source: The so-called <link xlink:href="http://www.opensource.org/licenses/bsd-license.php"> new BSD license</link> applied to FreeBSD within the last few years is effectively a statement that you can do anything with the program or its source, but you do not have any warranty and none of the authors has any liability (basically, you cannot sue anybody). This new BSD license is intended to encourage product commercialization. Any BSD code can be sold or included in proprietary products without any restrictions on the availability of your code or your future behavior.
de_de: Die so genannte <link xlink:href="http://www.opensource.org/licenses/bsd-license.php"> neue BSD-Lizenz</link>, die in den letzten Jahren bei FreeBSD verwendet wurde, trifft im Prinzip folgende Aussage: Sie können alles mit dem Programm oder seinem Quellcode machen, haben aber keine Garantie und keiner der Autoren hat irgendeine Haftung (im Grunde können Sie niemanden verklagen). Diese neue BSD-Lizenz soll die kommerzielle Verwertung der Produkte fördern. Jeder BSD-Code kann verkauft oder in proprietäre Produkte eingebunden werden, ohne dass die Verfügbarkeit Ihres Codes oder Ihr zukünftiges Handeln eingeschränkt wird.

source: Do not confuse the new BSD license with <quote>public domain</quote>. While an item in the public domain is also free for all to use, it has no owner.
de_de: Die neue BSD-Lizenz ist nicht mit <quote>Public Domain</quote> zu verwechseln. Obwohl eine Sache als Public Domain auch für jedermann kostenlos ist, hat sie keinen Eigentümer.

source: The origins of the GPL
de_de: Die Ursprünge der GPL

source: While the future of Unix had been so muddled in the late 1980s and early 1990s, the GPL, another development with important licensing considerations, reached fruition.
de_de: Während die Zukunft von Unix in den späten 1980er und frühen 1990er Jahren auf der Kippe stand, trug mit der GPL ein anderes Projekt mit bedeutenden lizenzrechtlichen Überlegungen erste Früchte.

source: Richard Stallman, the developer of Emacs, was a member of the staff at MIT when his lab switched from home-grown to proprietary systems. Stallman became upset when he found that he could not legally add minor improvements to the system. (Many of Stallman's co-workers had left to form two companies based on software developed at MIT and licensed by MIT; there appears to have been disagreement over access to the source code for this software). Stallman devised an alternative to the commercial software license and called it the GPL, or "GNU Public License". He also started a non-profit foundation, the <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), which intended to develop an entire operating system, including all associated software, that would not be subject to proprietary licensing. This system was called GNU, for "GNU is Not Unix".
de_de: Richard Stallman, der Entwickler von Emacs, arbeitete am MIT, als seine Abteilung von hauseigenen zu proprietären Systemen wechselte. Als Stallman feststellte, dass er selbst geringfügige Verbesserungen am System nicht mehr legal hinzufügen konnte, wurde er wütend. (Viele von Stallmans Mitarbeitern hatten das MIT zuvor bereits verlassen, um zwei Firmen zu gründen, die auf am MIT entwickelter und vom MIT lizenzierter Software basieren; es scheint Uneinigkeit über den Zugang zum Quellcode dieser Software gegeben zu haben). Stallman entwickelte eine Alternative zur kommerziellen Software-Lizenz und nannte sie die GPL oder "GNU Public License". Er gründete auch eine gemeinnützige Stiftung, die <link xlink:href="http://www.fsf.org">Free Software Foundation</link> (FSF), die vorhatte, ein vollständiges Betriebssystem, einschließlich aller dazugehörigen Software, zu entwickeln, das nicht der proprietären Lizenz unterliegt. Dieses System wurde GNU genannt, für "GNU is Not Unix".

source: The GPL was designed to be the antithesis of the standard proprietary license. To this end, any modifications that were made to a GPL program were required to be given back to the GPL community (by requiring that the source of the program be available to the user) and any program that used or linked to GPL code was required to be under the GPL. The GPL was intended to keep software from becoming proprietary. As the last paragraph of the GPL states:
de_de: Die GPL wurde als Gegenstück zu den herkömmlichen proprietären Lizenzen entwickelt. Hierzu müssen alle Änderungen, die an einem GPL-Programm vorgenommen werden, an die GPL-Gemeinschaft zurückgegeben werden. Dies geschieht durch die Anforderung, dass der Quellcode des Programms dem Benutzer zur Verfügung gestellt werden muss, und dass jedes Programm, das GPL-Code verwendet oder mit GPL-Code verlinkt wird, unter der GPL stehen muss. Die GPL soll verhindern, dass Software proprietär wird. So heißt es im letzten Absatz der GPL:

source: <quote>This General Public License does not permit incorporating your program into proprietary programs.</quote>[1]
de_de: <quote>Diese General Public License gestattet nicht die Einbindung Ihres Programms in proprietäre Programme.</quote>[1]

source: The <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> is a complex license so here are some rules of thumb when using the GPL:
de_de: Da die <link xlink:href="http://www.opensource.org/licenses/gpl-license.php">GPL</link> eine komplexe Lizenz ist, hier ein paar Faustregeln zur Anwendung der GPL:

source: you can charge as much as you want for distributing, supporting, or documenting the software, but you cannot sell the software itself.
de_de: Sie können für den Vertrieb, den Support oder die Dokumentation der Software so viel verlangen, wie Sie wollen, aber Sie können die Software an sich nicht verkaufen.

source: the rule-of-thumb states that if GPL source is required for a program to compile, the program must be under the GPL. Linking statically to a GPL library requires a program to be under the GPL.
de_de: Gemäß der Faustregel muss ein Programm unter der GPL stehen, wenn zum Kompilieren eines Programms Quellcode benötigt wird, der unter der GPL steht. Das statische Linken zu einer GPL-Bibliothek erfordert, dass ein Programm unter der GPL steht.

source: the GPL requires that any patents associated with GPLed software must be licensed for everyone's free use.
de_de: Die GPL verlangt, dass alle Patente, die auf Software unter der GPL beruhen, für die freie Nutzung durch jedermann lizenziert werden müssen.

source: simply aggregating software together, as when multiple programs are put on one disk, does not count as including GPLed programs in non-GPLed programs.
de_de: Das einfache Zusammenfügen von Software, wie z.B. das Speichern mehrerer Programme auf einer Festplatte, zählt nicht als Einbinden von GPL-lizenzierten Programmen in nicht GPL-lizenzierte Programme.

source: output of a program does not count as a derivative work. This enables the gcc compiler to be used in commercial environments without legal problems.
de_de: Die Ausgabe eines Programms zählt nicht als abgeleitetes Werk. Dadurch kann der gcc-Compiler in kommerziellen Umgebungen ohne rechtliche Probleme eingesetzt werden.

source: since the Linux kernel is under the GPL, any code statically linked with the Linux kernel must be GPLed. This requirement can be circumvented by dynamically linking loadable kernel modules. This permits companies to distribute binary drivers, but often has the disadvantage that they will only work for particular versions of the Linux kernel.
de_de: Da der Linux-Kernel unter der GPL steht, muss jeder Code, der statisch mit dem Linux-Kernel verlinkt ist, unter die GPL gestellt werden. Diese Anforderung kann durch dynamisches Verlinken von ladbaren Kernelmodulen umgangen werden. Das ermöglicht es Unternehmen, binäre Treiber zu verteilen, hat aber oft den Nachteil, dass diese nur für bestimmte Versionen des Linux-Kernels funktionieren.

source: Due in part to its complexity, in many parts of the world today the legalities of the GPL are being ignored in regard to Linux and related software. The long-term ramifications of this are unclear.
de_de: Zum Teil aufgrund ihrer Komplexität werden heute in vielen Teilen der Welt die rechtlichen Grundlagen der GPL im Hinblick auf Linux und damit zusammenhängende Software ignoriert. Die langfristigen Auswirkungen dieser Entwicklung sind unklar.

source: The origins of Linux and the LGPL
de_de: Die Ursprünge von Linux und der LGPL

source: While the commercial Unix wars raged, the Linux kernel was developed as a PC Unix clone. Linus Torvalds credits the existence of the GNU C compiler and the associated GNU tools for the existence of Linux. He put the Linux kernel under the GPL.
de_de: Während die kommerziellen Unix-Kriege tobten, wurde der Linux-Kernel als Unix-Klon für PCs entwickelt. Linus Torvalds begründet die Existenz von Linux mit der Existenz des GNU C-Compilers und der dazugehörigen GNU-Tools. Torvalds stellte den Linux-Kernel unter die GPL.

source: Remember that the GPL requires anything that statically links to any code under the GPL also be placed under the GPL. The source for this code must thus be made available to the user of the program. Dynamic linking, however, is not considered a violation of the GPL. Pressure to put proprietary applications on Linux became overwhelming. Such applications often must link with system libraries. This resulted in a modified version of the GPL called the <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", since renamed to "Lesser", GPL). The LGPL allows proprietary code to be linked to the GNU C library, glibc. You do not have to release the source code which has been dynamically linked to an LGPLed library.
de_de: Beachten Sie dabei Folgendes: Die GPL verlangt, dass jeder statisch verlinkte Code, der unter der GPL steht, auch unter die GPL gestellt wird. Der Quellcode für diesen Code muss daher dem Benutzer des Programms zur Verfügung gestellt werden. Dynamisches Linken gilt jedoch nicht als Verstoß gegen die GPL. Es entstand ein enormer Druck, proprietäre Anwendungen für Linux bereitzustellen. Solche Anwendungen verlinken häufig auf Systembibliotheken. Dies führte zu einer modifizierten Version der GPL mit dem Namen <link xlink:href="http://www.opensource.org/licenses/lgpl-license.php">LGPL</link> ("Library", inzwischen in "Lesser", GPL, umbenannt). Die LGPL erlaubt es, proprietären Code mit der GNU C-Bibliothek, glibc, zu verlinken. Sie müssen den Quellcode nicht für Code freigeben, der dynamisch auf eine LGPL-Bibliothek verlinkt.

source: If you statically link an application with glibc, such as is often required in embedded systems, you cannot keep your application proprietary, that is, the source must be released. Both the GPL and LGPL require any modifications to the code directly under the license to be released.
de_de: Wenn man eine Anwendung statisch mit der glibc linkt, was häufig in eingebetteten Systemen erforderlich ist, kann die Anwendung nicht proprietär sein, d.h. der Quelltext muss freigegeben werden. Sowohl die GPL als auch die LGPL verlangen, dass alle Änderungen am Code direkt unter der entsprechenden Lizenz veröffentlicht werden.

source: Open Source licenses and the Orphaning Problem
de_de: Open-Source-Lizenzen und das Problem der Verwaisung
