Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: As noted, breaking some of these rules can be grounds for suspension or, upon repeated offense, permanent removal of commit privileges. Individual members of core have the power to temporarily suspend commit privileges until core as a whole has the chance to review the issue. In case of an <quote>emergency</quote> (a committer doing damage to the repository), a temporary suspension may also be done by the repository meisters. Only a 2/3 majority of core has the authority to suspend commit privileges for longer than a week or to remove them permanently. This rule does not exist to set core up as a bunch of cruel dictators who can dispose of committers as casually as empty soda cans, but to give the project a kind of safety fuse. If someone is out of control, it is important to be able to deal with this immediately rather than be paralyzed by debate. In all cases, a committer whose privileges are suspended or revoked is entitled to a <quote>hearing</quote> by core, the total duration of the suspension being determined at that time. A committer whose privileges are suspended may also request a review of the decision after 30 days and every 30 days thereafter (unless the total suspension period is less than 30 days). A committer whose privileges have been revoked entirely may request a review after a period of 6 months has elapsed. This review policy is <emphasis>strictly informal</emphasis> and, in all cases, core reserves the right to either act on or disregard requests for review if they feel their original decision to be the right one.
es_es: Como se señaló, romper algunas de estas reglas puede ser motivo de suspensión o, en caso de reincidencia, eliminación permanente de los privilegios de cometer. Los miembros individuales del núcleo tienen el poder de suspender temporalmente los privilegios de confirmación hasta que el núcleo en su conjunto tenga la oportunidad de revisar el problema. En caso de <quote>emergencia</quote> (un confirmador que daña el repositorio), los meisters del repositorio también pueden realizar una suspensión temporal. Solo una mayoría de 2/3 del núcleo tiene la autoridad para suspender los privilegios de confirmación durante más de una semana o para eliminarlos permanentemente. Esta regla no existe para que el núcleo se convierta en un grupo de dictadores crueles que pueden deshacerse de los responsables de manera tan casual como las latas de refresco vacías, sino para darle al proyecto una especie de mecha de seguridad. Si alguien está fuera de control, es importante poder lidiar con esto de inmediato en lugar de quedar paralizado por el debate. En todos los casos, un cometer cuyos privilegios se suspenden o revocan tiene derecho a una <quote>audición</quote> por núcleo, determinándose en ese momento la duración total de la suspensión. Un remitente cuyos privilegios estén suspendidos también puede solicitar una revisión de la decisión después de 30 días y cada 30 días a partir de entonces (a menos que el período total de suspensión sea inferior a 30 días). Un remitente cuyos privilegios hayan sido revocados por completo puede solicitar una revisión después de que haya transcurrido un período de 6 meses. Esta política de revisión es <emphasis>estrictamente informal</emphasis> y, en todos los casos, core se reserva el derecho de actuar o ignorar las solicitudes de revisión si sienten que su decisión original es la correcta.

source: In all other aspects of project operation, core is a subset of committers and is bound by the <emphasis>same rules</emphasis>. Just because someone is in core this does not mean that they have special dispensation to step outside any of the lines painted here; core's <quote>special powers</quote> only kick in when it acts as a group, not on an individual basis. As individuals, the core team members are all committers first and core second.
es_es: En todos los demás aspectos de la operación del proyecto, el núcleo es un subconjunto de confirmadores y está vinculado por el<emphasis>mismas reglas</emphasis>. El hecho de que alguien esté en el núcleo no significa que tenga una dispensación especial para salir de cualquiera de las líneas pintadas aquí; núcleo<quote>poderes especiales</quote> solo se activa cuando actúa como grupo, no de forma individual. Como individuos, los miembros del equipo central son todos comprometidos primero y segundo central.

source: Details
es_es: Detalles

source: This means that you need to treat other committers as the peer-group developers that they are. Despite our occasional attempts to prove the contrary, one does not get to be a committer by being stupid and nothing rankles more than being treated that way by one of your peers. Whether we always feel respect for one another or not (and everyone has off days), we still have to <emphasis>treat</emphasis> other committers with respect at all times, on public forums and in private email.
es_es: Esto significa que debe tratar a los demás confirmadores como los desarrolladores de grupos de pares que son. A pesar de nuestros ocasionales intentos de demostrar lo contrario, uno no llega a cometer un delito siendo estúpido y nada irrita más que ser tratado de esa manera por uno de sus compañeros. Si siempre sentimos respeto por los demás o no (y todos tienen días libres), todavía tenemos que <emphasis>treat</emphasis> otros committers con respeto en todo momento, en foros públicos y en correos privados.

source: Being able to work together long term is this project's greatest asset, one far more important than any set of changes to the code, and turning arguments about code into issues that affect our long-term ability to work harmoniously together is just not worth the trade-off by any conceivable stretch of the imagination.
es_es: Poder trabajar juntos a largo plazo es el mayor activo de este proyecto, uno mucho más importante que cualquier conjunto de cambios en el código, y convertir los argumentos sobre el código en problemas que afectan nuestra capacidad a largo plazo para trabajar juntos en armonía simplemente no vale la pena. -abandonado por cualquier tramo concebible de la imaginación.

source: To comply with this rule, do not send email when you are angry or otherwise behave in a manner which is likely to strike others as needlessly confrontational. First calm down, then think about how to communicate in the most effective fashion for convincing the other persons that your side of the argument is correct, do not just blow off some steam so you can feel better in the short term at the cost of a long-term flame war. Not only is this very bad <quote>energy economics</quote>, but repeated displays of public aggression which impair our ability to work well together will be dealt with severely by the project leadership and may result in suspension or termination of your commit privileges. The project leadership will take into account both public and private communications brought before it. It will not seek the disclosure of private communications, but it will take it into account if it is volunteered by the committers involved in the complaint.
es_es: Para cumplir con esta regla, no envíe correos electrónicos cuando esté enojado o se comporte de una manera que pueda parecer a los demás como una confrontación innecesaria. Primero cálmate, luego piensa en cómo comunicarte de la manera más efectiva para convencer a las otras personas de que tu lado del argumento es correcto, no desahogues un poco para sentirte mejor en el corto plazo a costa de una guerra de llamas a largo plazo. No solo esto es muy malo <quote>economía energética</quote>, pero las demostraciones repetidas de agresión pública que perjudican nuestra capacidad para trabajar bien juntos serán tratadas severamente por el liderazgo del proyecto y pueden resultar en la suspensión o terminación de sus privilegios de compromiso. El liderazgo del proyecto tendrá en cuenta tanto las comunicaciones públicas como las privadas que se le presenten. No buscará la divulgación de comunicaciones privadas, pero la tendrá en cuenta si es voluntaria por parte de los autores de la denuncia.

source: All of this is never an option which the project's leadership enjoys in the slightest, but unity comes first. No amount of code or good advice is worth trading that away.
es_es: Todo esto nunca es una opción de la que disfrute en lo más mínimo el liderazgo del proyecto, pero la unidad es lo primero. Ninguna cantidad de código o buen consejo vale la pena cambiarlo.

source: You were not always a committer. At one time you were a contributor. Remember that at all times. Remember what it was like trying to get help and attention. Do not forget that your work as a contributor was very important to you. Remember what it was like. Do not discourage, belittle, or demean contributors. Treat them with respect. They are our committers in waiting. They are every bit as important to the project as committers. Their contributions are as valid and as important as your own. After all, you made many contributions before you became a committer. Always remember that.
es_es: No siempre fuiste un comprometido. Hubo un tiempo en que contribuiste. Recuerda eso en todo momento. Recuerde lo que fue tratar de obtener ayuda y atención. No olvides que tu trabajo como colaborador fue muy importante para ti. Recuerda cómo fue. No desanime, menosprecie o menosprecie a los contribuyentes. Trátelos con respeto. Son nuestros comprometidos en espera. Son tan importantes para el proyecto como los comprometidos. Sus contribuciones son tan válidas e importantes como las suyas. Después de todo, hizo muchas contribuciones antes de convertirse en un comprometido. Siempre recuerda eso.

source: Consider the points raised under <xref linkend="respect"/> and apply them also to contributors.
es_es: Considere los puntos planteados bajo <xref linkend="respect"/> Y aplicarlos también a los contribuyentes.

source: The repository is not where changes are initially submitted for correctness or argued over, that happens first in the mailing lists or by use of the Phabricator service. The commit will only happen once something resembling consensus has been reached. This does not mean that permission is required before correcting every obvious syntax error or manual page misspelling, just that it is good to develop a feel for when a proposed change is not quite such a no-brainer and requires some feedback first. People really do not mind sweeping changes if the result is something clearly better than what they had before, they just do not like being <emphasis>surprised</emphasis> by those changes. The very best way of making sure that things are on the right track is to have code reviewed by one or more other committers.
es_es: El repositorio no es donde los cambios se envían inicialmente para su corrección o se discuten, eso ocurre primero en las listas de correo o mediante el uso del servicio Phabricator. El compromiso solo ocurrirá una vez que se haya alcanzado algo parecido al consenso. Esto no significa que se requiera permiso antes de corregir todos los errores de sintaxis obvios o errores ortográficos de la página del manual, solo que es bueno desarrollar una idea de cuándo un cambio propuesto no es tan obvio y requiere algunos comentarios primero. A la gente realmente no le importan los cambios radicales si el resultado es claramente mejor que lo que tenían antes, simplemente no les gusta ser <emphasis>sorprendido</emphasis> por esos cambios. La mejor manera de asegurarse de que todo va por buen camino es hacer que el código sea revisado por uno o más confirmadores.

source: When in doubt, ask for review!
es_es: En caso de duda, ¡solicite una revisión!

source: Respect existing maintainers if listed.
es_es: Respete los mantenedores existentes si están incluidos.

source: Many parts of FreeBSD are not <quote>owned</quote> in the sense that any specific individual will jump up and yell if you commit a change to <quote>their</quote> area, but it still pays to check first. One convention we use is to put a maintainer line in the <filename>Makefile</filename> for any package or subtree which is being actively maintained by one or more people; see <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/policies.html">https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/developers-handbook/policies.html</link> for documentation on this. Where sections of code have several maintainers, commits to affected areas by one maintainer need to be reviewed by at least one other maintainer. In cases where the <quote>maintainer-ship</quote> of something is not clear, look at the repository logs for the files in question and see if someone has been working recently or predominantly in that area.
es_es: Muchas partes de FreeBSD no <quote>owned</quote> en el sentido de que cualquier individuo específico saltará y gritará si comete un cambio en <quote>su</quote> área, pero todavía vale la pena comprobar primero. Una convención que usamos es poner una línea de mantenedor en el <filename>Makefile</filename> para cualquier paquete o subárbol que esté siendo mantenido activamente por una o más personas; ver <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/developers-handbook/policies.html">https://www.FreeBSD.org/doc/en_US.ISO8859-1/books/developers-handbook/policies.html</link> para obtener documentación sobre esto. Cuando las secciones de código tienen varios mantenedores, los compromisos con las áreas afectadas por un mantenedor deben ser revisados por al menos otro mantenedor. En los casos en que <quote>maintainer-ship</quote> Si algo no está claro, mire los registros del repositorio de los archivos en cuestión y vea si alguien ha estado trabajando recientemente o predominantemente en esa área.

source: This may be hard to swallow in times of conflict (when each side is convinced that they are in the right, of course) but a version control system makes it unnecessary to have an ongoing dispute raging when it is far easier to simply reverse the disputed change, get everyone calmed down again and then try to figure out what is the best way to proceed. If the change turns out to be the best thing after all, it can be easily brought back. If it turns out not to be, then the users did not have to live with the bogus change in the tree while everyone was busily debating its merits. People <emphasis>very</emphasis> rarely call for back-outs in the repository since discussion generally exposes bad or controversial changes before the commit even happens, but on such rare occasions the back-out should be done without argument so that we can get immediately on to the topic of figuring out whether it was bogus or not.
es_es: Esto puede ser difícil de aceptar en tiempos de conflicto (cuando cada parte está convencida de que tienen razón, por supuesto), pero un sistema de control de versiones hace innecesario tener una disputa en curso cuando es mucho más fácil simplemente revertir la disputa cambie, calme a todos nuevamente y luego intente averiguar cuál es la mejor manera de proceder. Si el cambio resulta ser lo mejor después de todo, se puede recuperar fácilmente. Si resulta que no es así, entonces los usuarios no tenían que vivir con el falso cambio en el árbol mientras todos debatían afanosamente sus méritos. Personas <emphasis>muy</emphasis> Rara vez piden retrocesos en el repositorio, ya que la discusión generalmente expone cambios malos o controvertidos incluso antes de que ocurra la confirmación, pero en ocasiones tan raras, el retroceso debe hacerse sin argumentos para que podamos pasar inmediatamente al tema de resolver si era falso o no.

source: Changes go to FreeBSD-CURRENT before FreeBSD-STABLE unless specifically permitted by the release engineer or unless they are not applicable to FreeBSD-CURRENT. Any non-trivial or non-urgent change which is applicable should also be allowed to sit in FreeBSD-CURRENT for at least 3 days before merging so that it can be given sufficient testing. The release engineer has the same authority over the FreeBSD-STABLE branch as outlined in rule #5.
es_es: Los cambios van a FreeBSD-CURRENT antes de FreeBSD-STABLE a menos que el ingeniero de versiones lo permita específicamente o que no sean aplicables a FreeBSD-CURRENT. Cualquier cambio no trivial o no urgente que sea aplicable también debe permitirse que permanezca en FreeBSD-CURRENT durante al menos 3 días antes de fusionarse para que se puedan realizar las pruebas suficientes. El ingeniero de versiones tiene la misma autoridad sobre la rama FreeBSD-STABLE como se describe en la regla # 5.

source: This is another <quote>do not argue about it</quote> issue since it is the release engineer who is ultimately responsible (and gets beaten up) if a change turns out to be bad. Please respect this and give the release engineer your full cooperation when it comes to the FreeBSD-STABLE branch. The management of FreeBSD-STABLE may frequently seem to be overly conservative to the casual observer, but also bear in mind the fact that conservatism is supposed to be the hallmark of FreeBSD-STABLE and different rules apply there than in FreeBSD-CURRENT. There is also really no point in having FreeBSD-CURRENT be a testing ground if changes are merged over to FreeBSD-STABLE immediately. Changes need a chance to be tested by the FreeBSD-CURRENT developers, so allow some time to elapse before merging unless the FreeBSD-STABLE fix is critical, time sensitive or so obvious as to make further testing unnecessary (spelling fixes to manual pages, obvious bug/typo fixes, etc.) In other words, apply common sense.
es_es: Este es otro <quote>no discutas sobre eso</quote> problema, ya que es el ingeniero de versiones el responsable en última instancia (y recibe una paliza) si un cambio resulta ser malo. Respete esto y brinde al ingeniero de versiones su total cooperación cuando se trata de la rama FreeBSD-STABLE. El manejo de FreeBSD-STABLE puede parecer con frecuencia demasiado conservador para el observador casual, pero también tenga en cuenta el hecho de que se supone que el conservadurismo es el sello distintivo de FreeBSD-STABLE y que se aplican reglas diferentes a las de FreeBSD-CURRENT. Tampoco tiene sentido que FreeBSD-CURRENT sea un campo de pruebas si los cambios se fusionan con FreeBSD-STABLE inmediatamente. Los cambios necesitan la oportunidad de ser probados por los desarrolladores de FreeBSD-CURRENT, así que deje pasar un tiempo antes de fusionarse, a menos que la corrección de FreeBSD-STABLE sea crítica, urgente o tan obvia como para hacer innecesarias más pruebas corrección de errores / errores tipográficos, etc.) En otras palabras, aplique el sentido común.

source: Changes to the security branches (for example, <literal>releng/9.3</literal>) must be approved by a member of the Security Officer Team <email>security-officer@FreeBSD.org</email>, or in some cases, by a member of the Release Engineering Team <email>re@FreeBSD.org</email>.
es_es: Cambios en las ramas de seguridad (por ejemplo, <literal>releng/9.3</literal>) debe ser aprobado por un miembro del equipo de oficiales de seguridad <email>security-officer@FreeBSD.org</email>, o en algunos casos, por un miembro del equipo de ingeniería de versiones <email>re@FreeBSD.org</email>.

source: This project has a public image to uphold and that image is very important to all of us, especially if we are to continue to attract new members. There will be occasions when, despite everyone's very best attempts at self-control, tempers are lost and angry words are exchanged. The best thing that can be done in such cases is to minimize the effects of this until everyone has cooled back down. Do not air angry words in public and do not forward private correspondence or other private communications to public mailing lists, mail aliases, instant messaging channels or social media sites. What people say one-to-one is often much less sugar-coated than what they would say in public, and such communications therefore have no place there - they only serve to inflame an already bad situation. If the person sending a flame-o-gram at least had the grace to send it privately, then have the grace to keep it private yourself. If you feel you are being unfairly treated by another developer, and it is causing you anguish, bring the matter up with core rather than taking it public. Core will do its best to play peace makers and get things back to sanity. In cases where the dispute involves a change to the codebase and the participants do not appear to be reaching an amicable agreement, core may appoint a mutually-agreeable third party to resolve the dispute. All parties involved must then agree to be bound by the decision reached by this third party.
es_es: Este proyecto tiene una imagen pública que defender y esa imagen es muy importante para todos nosotros, especialmente si queremos seguir atrayendo nuevos miembros. Habrá ocasiones en las que, a pesar de los mejores intentos de autocontrol de todos, se pierden los ánimos y se intercambian palabras de enojo. Lo mejor que se puede hacer en tales casos es minimizar los efectos de esto hasta que todos se hayan enfriado nuevamente. No transmita palabras de enojo en público y no reenvíe correspondencia privada u otras comunicaciones privadas a listas de correo públicas, alias de correo, canales de mensajería instantánea o sitios de redes sociales. Lo que la gente dice cara a cara a menudo tiene mucho menos contenido de azúcar que lo que dirían en público y, por lo tanto, tales comunicaciones no tienen cabida allí; solo sirven para inflamar una situación que ya es mala. Si la persona que envía un flame-o-gramo al menos tuvo la gracia de enviarlo en privado, entonces tenga la gracia de mantenerlo en privado. Si siente que otro desarrollador lo está tratando injustamente y le está causando angustia, plantee el asunto con el núcleo en lugar de hacerlo público. Core hará todo lo posible para jugar a los pacificadores y hacer que las cosas vuelvan a la cordura. En los casos en que la disputa implique un cambio en la base de código y los participantes no parezcan estar llegando a un acuerdo amistoso, el núcleo puede designar a un tercero de mutuo acuerdo para resolver la disputa. Todas las partes involucradas deben aceptar quedar vinculadas por la decisión tomada por este tercero.

source: Respect all code freezes and read the <literal>committers</literal> and <literal>developers</literal> mailing list on a timely basis so you know when a code freeze is in effect.
es_es: Respete todos los códigos congelados y lea el <literal>comprometidos</literal> y <literal>desarrolladores</literal> lista de correo de manera oportuna para que sepa cuándo está en vigencia una congelación de código.

source: Committing unapproved changes during a code freeze is a really big mistake and committers are expected to keep up-to-date on what is going on before jumping in after a long absence and committing 10 megabytes worth of accumulated stuff. People who abuse this on a regular basis will have their commit privileges suspended until they get back from the FreeBSD Happy Reeducation Camp we run in Greenland.
es_es: Realizar cambios no aprobados durante una congelación de código es un gran error y se espera que los confirmadores se mantengan actualizados sobre lo que está sucediendo antes de saltar después de una larga ausencia y comprometer 10 megabytes de material acumulado. A las personas que abusen de esto de forma regular se les suspenderán sus privilegios de compromiso hasta que regresen del Happy Reeducation Camp de FreeBSD que llevamos a cabo en Groenlandia.
