Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: It can also show all changes for a specific changeset. This command shows what changes were made to the current directory and all subdirectories in changeset 179454:
es_es: También puede mostrar todos los cambios para un conjunto de cambios específico. Este comando muestra qué cambios se hicieron en el directorio actual y en todos los subdirectorios en el conjunto de cambios 179454:

source: Reverting
es_es: Revertir

source: Local changes (including additions and deletions) can be reverted using <command>svn revert</command>. It does not update out-of-date files, but just replaces them with pristine copies of the original version.
es_es: Los cambios locales (incluyendo adiciones y eliminaciones) pueden revertirse usando <command>svn revert</command>. No actualiza los archivos desactualizados, sino que los reemplaza con copias prístinas de la versión original.

source: Conflicts
es_es: Conflictos

source: If an <command>svn update</command> resulted in a merge conflict, Subversion will remember which files have conflicts and refuse to commit any changes to those files until explicitly told that the conflicts have been resolved. The simple, not yet deprecated procedure is:
es_es: Si un <command>svn update</command> provocó un conflicto de fusión, Subversion recordará qué ficheros tienen conflictos y se negará a hacer cualquier cambio en esos ficheros hasta que se le diga explícitamente que los conflictos se han resueltos. El procedimiento simple, que aún no está obsoleto, es:

source: However, the preferred procedure is:
es_es: Sin embargo, el procedimiento preferido es:

source: The two examples are equivalent. Possible values for <literal>--accept</literal> are:
es_es: Los dos ejemplos son equivalentes. Los valores posibles para <literal>--accept</literal> son:

source: <literal>working</literal>: use the version in your working directory (which one presumes has been edited to resolve the conflicts).
es_es: <literal>working</literal>: utilice la versión de su directorio de trabajo (que se supone ha sido editada para resolver los conflictos).

source: <literal>base</literal>: use a pristine copy of the version you had before <command>svn update</command>, discarding your own changes, the conflicting changes, and possibly other intervening changes as well.
es_es: <literal>base</literal>: utilice una copia virgen de la versión que tenía antes de <command>svn update</command>, descartando sus propios cambios, los cambios conflictivos, y posiblemente otros cambios intermedios también.

source: <literal>mine-full</literal>: use what you had before <command>svn update</command>, including your own changes, but discarding the conflicting changes, and possibly other intervening changes as well.
es_es: <literal>mine-full</literal>: use lo que tenía antes de <command>svn update</command>, incluyendo sus propios cambios, pero descartando los cambios conflictivos, y posiblemente otros cambios interpuestos también.

source: <literal>theirs-full</literal>: use the version that was retrieved when you did <command>svn update</command>, discarding your own changes.
es_es: <literal>theirs-full</literal>: usa la versión que fue recuperada cuando hizo <command>svn update</command>, descartando sus propios cambios.ll.

source: Advanced Use
es_es: Uso Avanzado.

source: Sparse Checkouts
es_es: Comprobaciones Escasas

source: <acronym>SVN</acronym> allows <emphasis>sparse</emphasis>, or partial checkouts of a directory by adding <option>--depth</option> to a <command>svn checkout</command>.
es_es: <acronym>SVN</acronym> permite comprobaciones <emphasis>escasas</emphasis>, o parciales de un directorio añadiendo <option>--depth</option> a un <command>svn checkout</command>.

source: Valid arguments to <option>--depth</option> are:
es_es: Los argumentos válidos para <option>--depth</option> son:

source: <literal>empty</literal>: the directory itself without any of its contents.
es_es: <literal>empty</literal>: el propio directorio sin ninguno de sus contenidos.

source: <literal>files</literal>: the directory and any files it contains.
es_es: <literal>files</literal>: el directorio y cualquier archivo que contenga.

source: <literal>immediates</literal>: the directory and any files and directories it contains, but none of the subdirectories' contents.
es_es: <literal>immediates</literal>: el directorio y todos los archivos y directorios que contenga, pero ninguno de los contenidos de los subdirectorios.

source: <literal>infinity</literal>: anything.
es_es: <literal>infinity</literal>: cualquier cosa.

source: The <literal>--depth</literal> option applies to many other commands, including <command>svn commit</command>, <command>svn revert</command>, and <command>svn diff</command>.
es_es: La opción <literal>--depth</literal> se aplica a muchos otros comandos, incluyendo <command>svn commit</command>, <command>svn revert</command>, y <command>svn diff</command>.

source: Since <literal>--depth</literal> is sticky, there is a <literal>--set-depth</literal> option for <command>svn update</command> that will change the selected depth. Thus, given the working copy produced by the previous example:
es_es: Como <literal>--depth</literal> es pegadizo, hay una opción <literal>--set-depth</literal> para <command>svn update</command> que cambiará la profundidad seleccionada. Así, dada la copia de trabajo producida por el ejemplo anterior:

source: The above command will populate the working copy in <replaceable>~/freebsd</replaceable> with <filename>ROADMAP.txt</filename> and empty subdirectories, and nothing will happen when <command>svn update</command> is executed on the subdirectories. However, this command will set the depth for <replaceable>head</replaceable> (in this case) to infinity, and fully populate it:
es_es: El comando anterior rellenará la copia de trabajo en <replaceable>~/freebsd</replaceable> con <filename>ROADMAP.txt</filename> y subdirectorios vacíos, y no pasará nada cuando se ejecute <command>svn update</command> en los subdirectorios. Sin embargo, este comando establecerá la profundidad de <replaceable>head</replaceable> (en este caso) al infinito, y lo rellenará completamente:

source: Direct Operation
es_es: Operación directa

source: Certain operations can be performed directly on the repository without touching the working copy. Specifically, this applies to any operation that does not require editing a file, including:
es_es: Algunas operaciones pueden realizarse directamente en el repositorio sin tocar la copia de trabajo. Específicamente, esto se aplica a cualquier operación que no requiera la edición de un archivo, incluyendo:

source: <literal>remove</literal>, <literal>copy</literal>, <literal>rename</literal>
es_es: <literal>eliminar</literal>, <literal>copiar</literal>, <literal>renombrar</literal>

source: <literal>merge</literal>
es_es: <literal>fusionar</literal>

source: Branching is very fast. This command would be used to branch <literal>RELENG_8</literal>:
es_es: Crear ramas es muy rápido. Este comando se usaría para crear ramas en <literal>RELENG_8</literal>:

source: This is equivalent to these commands which take minutes and hours as opposed to seconds, depending on your network connection:
es_es: Esto es equivalente a estos comandos que requieren minutos y horas en lugar de segundos, dependiendo de su conexión de red:

source: Merging with <acronym>SVN</acronym>
es_es: Fusión con <acronym>SVN</acronym>

source: This section deals with merging code from one branch to another (typically, from head to a stable branch).
es_es: Esta sección trata sobre la fusión de código de una rama a otra (típicamente, de desde head a una rama estable

source: In all examples below, <literal>$FSVN</literal> refers to the location of the FreeBSD Subversion repository, <literal>svn+ssh://repo.freebsd.org/base/</literal>.
es_es: En todos los ejemplos siguientes, <literal>$FSVN</literal> se refiere a la ubicación del repositorio Subversion de FreeBSD, <literal>svn+ssh://repo.freebsd.org/base/</literal>.

source: About Merge Tracking
es_es: Acerca del Seguimiento de Fusiones

source: From the user's perspective, merge tracking information (or mergeinfo) is stored in a property called <literal>svn:mergeinfo</literal>, which is a comma-separated list of revisions and ranges of revisions that have been merged. When set on a file, it applies only to that file. When set on a directory, it applies to that directory and its descendants (files and directories) except for those that have their own <literal>svn:mergeinfo</literal>.
es_es: Desde la perspectiva del usuario, la información de seguimiento de fusiones (o mergeinfo) se almacena en una propiedad llamada <literal>svn:mergeinfo</literal>, que es una lista separada por comas de las revisiones y los rangos de revisiones que se han fusionado. Cuando se establece en un archivo, se aplica sólo a ese archivo. Cuando se establece en un directorio, se aplica a ese directorio y a sus descendientes (archivos y directorios) excepto a aquellos que tienen su propio <literal>svn:mergeinfo</literal>.

source: It is <emphasis>not</emphasis> inherited. For instance, <filename>stable/6/contrib/openpam/</filename> does not implicitly inherit mergeinfo from <filename>stable/6/</filename>, or <filename>stable/6/contrib/</filename>. Doing so would make partial checkouts very hard to manage. Instead, mergeinfo is explicitly propagated down the tree. For merging something into <filename>branch/foo/bar/</filename>, these rules apply:
es_es: <emphasis>No </emphasis>se hereda. Por ejemplo, <filename>estable/6/contrib/openpam/</filename> no hereda implícitamente la información de fusión de <filename>estable/6/</filename>, o <filename>estable/6/contrib/</filename>. Si lo hiciera, las comprobaciones parciales serían muy difíciles de gestionar. En su lugar, mergeinfo se propaga explícitamente por el árbol. Para fusionar algo en <filename>rama/foo/bar/</filename>, se aplican estas reglas:

source: If <filename>branch/foo/bar/</filename> does not already have a mergeinfo record, but a direct ancestor (for instance, <filename>branch/foo/</filename>) does, then that record will be propagated down to <filename>branch/foo/bar/</filename> before information about the current merge is recorded.
es_es: Si <filename>branch/foo/bar/</filename> no tiene ya un registro mergeinfo, pero sí un ancestro directo (por ejemplo, <filename>branch/foo/</filename>), entonces ese registro se propagará hasta <filename>branch/foo/bar/</filename> antes de que se registre la información sobre la fusión actual.

source: Information about the current merge will <emphasis>not</emphasis> be propagated back up that ancestor.
es_es: La información sobre la fusión actual <emphasis>no </emphasis> se propagará de vuelta a ese ancestro.

source: If a direct descendant of <filename>branch/foo/bar/</filename> (for instance, <filename>branch/foo/bar/baz/</filename>) already has a mergeinfo record, information about the current merge will be propagated down to it.
es_es: Si un descendiente directo de <filename>branch/foo/bar/</filename> (por ejemplo, <filename>branch/foo/bar/baz/</filename>) ya tiene un registro de información de fusión, la información sobre la fusión actual se propagará hasta él.

source: If you consider the case where a revision changes several separate parts of the tree (for example, <filename>branch/foo/bar/</filename> and <filename>branch/foo/quux/</filename>), but you only want to merge some of it (for example, <filename>branch/foo/bar/</filename>), you will see that these rules make sense. If mergeinfo was propagated up, it would seem like that revision had also been merged to <filename>branch/foo/quux/</filename>, when in fact it had not been.
es_es: Si considera el caso en el que una revisión cambia varias partes separadas del árbol (por ejemplo, <filename>rama/foo/bar/</filename> y <filename>rama/foo/quux/</filename>), pero sólo desea fusionar algunas de ellas (por ejemplo, <filename>rama/rama/foo/bar/</filename>), verá que estas reglas son razonables. Si se propagó mergeinfo, parecería que esa revisión también se había fusionado a <filename>branch/foo/quux/</filename>, cuando en realidad no lo había sido.

source: Selecting the Source and Target Branch When Merging
es_es: Selección de la rama de origen y de destino al fusionar

source: Merging to <literal>stable/</literal> branches should originate from <literal>head/</literal>. For example:
es_es: La fusión con ramas <literal>estables/</literal> debería originarse desde <literal> head/</literal>. Por ejemplo:

source: Merges to <literal>releng/</literal> branches should always originate from the corresponding <literal>stable/</literal> branch. For example:
es_es: Las fusiones con ramas <literal>releng/</literal> siempre deben originarse en la rama <literal>estable/</literal> correspondiente. Por ejemplo:

source: Committers are only permitted to commit to the <literal>releng/</literal> branches during a release cycle after receiving approval from the Release Engineering Team, after which only the Security Officer may commit to a <literal>releng/</literal> branch for a Security Advisory or Errata Notice.
es_es: Los committers sólo pueden comprometerse con las ramas <literal>releng/</literal> durante un ciclo de liberación después de recibir la aprobación del Equipo de Ingenieros de Liberación, después de lo cual sólo el responsable de seguridad puede comprometerse con una rama <literal>releng/</literal> para un Aviso de Seguridad o Una Notificación de Errata.

source: All merges are merged to and committed from the root of the branch. All merges look like:
es_es: Todas las fusiones se fusionan y confirman desde la raíz de la rama. Todas las fusiones se parecen a:

source: Note that <replaceable>checkout</replaceable> must be a complete checkout of the branch to which the merge occurs.
es_es: Tenga en cuenta que la <replaceable>comprobación</replaceable> debe ser una comprobación completa de la rama con la que se produce la fusión.

source: Preparing the Merge Target
es_es: Preparación del Destino de la Fusión

source: The target directory must also be up-to-date and must not contain any uncommitted changes or stray files.
es_es: El directorio de destino también debe estar actualizado y no debe contener ningún cambio no enviado ni archivos perdidos.

source: Identifying Revisions
es_es: Identificación de revisiones

source: Identifying revisions to be merged is a must. If the target already has complete mergeinfo, ask <acronym>SVN</acronym> for a list:
es_es: Es necesario identificar las revisiones que se van a fusionar. Si el objetivo ya ha completado mergeinfo, pida una lista a <acronym>SVN</acronym>:

source: If the target does not have complete mergeinfo, check the log for the merge source.
es_es: Si el objetivo no ha completado mergeinfo, compruebe el registro de la fuente de la fusión.

source: Merging
es_es: Fusión

source: Now, let us start merging!
es_es: Ahora, ¡vamos a empezar a fusionar!

source: The Principles
es_es: Los Principios

source: For example, To merge:
es_es: Por ejemplo, Fusionar:

source: revision <literal>$R</literal>
es_es: revisión <literal>$R</literal>

source: in directory $target in stable branch $B
es_es: en el directorio $target en la rama estable $B

source: from directory $source in head
es_es: desde el directorio $source en head

source: $FSVN is <literal>svn+ssh://repo.freebsd.org/base</literal>
es_es: $FSVN es <literal>svn+ssh://repo.freebsd.org/base</literal>

source: Assuming that revisions $P and $Q have already been merged, and that the current directory is an up-to-date working copy of stable/$B, the existing mergeinfo looks like this:
es_es: Asumiendo que las revisiones $P y $Q ya han sido fusionadas, y que el directorio actual es una copia de trabajo actualizada de stable/$B, el mergeinfo existente se ve así:

source: Merging is done like so:
es_es: La fusión se hace así:

source: Checking the results of this is possible with <command>svn diff</command>.
es_es: Es posible comprobar los resultados de esto con <command>svn diff</command>.

source: The svn:mergeinfo now looks like:
es_es: El svn:mergeinfo ahora se parece a:

source: If the results are not exactly as shown, assistance may be required before committing as mistakes may have been made, or there may be something wrong with the existing mergeinfo, or there may be a bug in Subversion.
es_es: Si los resultados no son exactamente los que se muestran, puede ser necesaria la ayuda antes de hacer los envíos, o puede haber algo mal con el mergeinfo existente, o puede haber un error en Subversion.

source: Practical Example
es_es: Ejemplo práctico

source: As a practical example, consider this scenario. The changes to <filename>netmap.4</filename> in r238987 are to be merged from CURRENT to 9-STABLE. The file resides in <filename>head/share/man/man4</filename>. According to <xref linkend="svn-advanced-use-merging"/>, this is also where to do the merge. Note that in this example all paths are relative to the top of the svn repository. For more information on the directory layout, see <xref linkend="svn-getting-started-base-layout"/>.
es_es: Como ejemplo práctico, considere este escenario. Los cambios a <filename>netmap.4</filename> en r238987 deben fusionarse desde CURRENT a 9-STABLE. El archivo reside en <filename>head/share/man/man4</filename>. De acuerdo con <xref linkend="svn-advanced-use-merging"/>, aquí es donde hacer también la fusión. Tenga en cuenta que en este ejemplo todas las rutas son relativas al nivel superior del repositorio svn. Para más información sobre la disposición del directorio, véase <xref linkend="svn-getting-started-base-layout"/>.

source: The first step is to inspect the existing mergeinfo.
es_es: El primer paso es inspeccionar el mergeinfo existente.

source: Check that the revision number of the merged revision has been added. Once this is verified, the only thing left is the actual commit.
es_es: Compruebe que se ha añadido el número de revisión de la revisión fusionada. Una vez verificado esto, lo único que queda es el envío real.

source: Precautions Before Committing
es_es: Precauciones antes de los Envíos

source: As always, build world (or appropriate parts of it).
es_es: Como siempre, construye el mundo (o partes apropiadas del mismo).

source: Check the changes with <command>svn diff</command> and <command>svn stat</command>. Make sure all the files that should have been added or deleted were in fact added or deleted.
es_es: Compruebe los cambios con <command>svn diff</command> y <command>svn stat</command>. Asegúrese de que todos los archivos que deberían haber sido añadidos o borrados hayan sido realmente añadidos o borrados.

source: Take a closer look at any property change (marked by a <literal>M</literal> in the second column of <command>svn stat</command>). Normally, no svn:mergeinfo properties should be anywhere except the target directory (or directories).
es_es: Eche un vistazo con más atención a cualquier cambio de propiedad (marcado con un <literal>M</literal> en la segunda columna de <command>svn stat</command>). Normalmente, ninguna propiedad de svn:mergeinfo debería estar en otro lugar excepto en el directorio (o directorios) de destino.

source: If something looks fishy, ask for help.
es_es: Si algo parece sospechoso, pida ayuda.

source: Committing
es_es: Enviando

source: Make sure to commit a top level directory to have the mergeinfo included as well. Do not specify individual files on the command line. For more information about committing files in general, see the relevant section of this primer.
es_es: Asegúrese de enviar a un directorio de nivel superior para incluir también el mergeinfo. No especifique archivos individuales en la línea de comandos. Para obtener más información sobre el envío de archivos en general, consulte la sección pertinente de este manual.

source: Vendor Imports with <acronym>SVN</acronym>
es_es: Importaciones de vendor con <acronym>SVN</acronym>

source: Please read this entire section before starting a vendor import.
es_es: Por favor, lea toda esta sección antes de iniciar la importación de vendor.

source: Patches to vendor code fall into two categories:
es_es: Los parches al código de vendor se dividen en dos categorías:

source: Vendor patches: these are patches that have been issued by the vendor, or that have been extracted from the vendor's version control system, which address issues which cannot wait until the next vendor release.
es_es: Parches de vendor: son parches que han sido publicados por vendor, o que han sido extraídos del sistema de control de versiones de vendor, que resuelven problemas que no pueden esperar hasta la próxima versión de vendor.

source: FreeBSD patches: these are patches that modify the vendor code to address FreeBSD-specific issues.
es_es: Parches de FreeBSD: son parches que modifican el código de vendor para resolver problemas específicos de FreeBSD.

source: The nature of a patch dictates where it should be committed:
es_es: La naturaleza de un parche dicta dónde debe ser enviado:

source: Vendor patches must be committed to the vendor branch, and merged from there to head. If the patch addresses an issue in a new release that is currently being imported, it <emphasis>must not</emphasis> be committed along with the new release: the release must be imported and tagged first, then the patch can be applied and committed. There is no need to re-tag the vendor sources after committing the patch.
es_es: Los parches de vendor deben enviarse a la rama de vendor y fusionarse de allí a head. Si el parche resuelve un problema en una nueva versión que se está importando actualmente, <emphasis>no debe</emphasis> ser eviado junto con la nueva versión: la versión se debe importar y etiquetar primero, entonces el parche se puede aplicar y enviar. No hay necesidad de volver a etiquetar las fuentes de vendor después de confirmar el parche.

source: FreeBSD patches are committed directly to head.
es_es: Los parches de FreeBSD se envían directamente a head.

source: Preparing the Tree
es_es: Preparación del Árbol

source: If importing for the first time after the switch to Subversion, flattening and cleaning up the vendor tree is necessary, as well as bootstrapping the merge history in the main tree.
es_es: Si importa por primera vez después del cambio a Subversion, es necesario aplanar y limpiar el árbol de vendor, así como realizar un inicio del historial de fusiones en el árbol principal.

source: Flattening
es_es: Aplanar

source: During the conversion from <acronym>CVS</acronym> to Subversion, vendor branches were imported with the same layout as the main tree. This means that the <literal>pf</literal> vendor sources ended up in <filename>vendor/pf/dist/contrib/pf</filename>. The vendor source is best directly in <filename>vendor/pf/dist</filename>.
es_es: Durante la conversión de <acronym>CVS</acronym> a Subversion, las ramas de vendor se importaron con el mismo esquema que el árbol principal. Esto significa que las fuentes de vendor <literal>pf</literal> terminaron en <filename>vendor/pf/dist/contrib/pf</filename>. La fuente de vendor es mejor si está directamente en <filename>vendor/pf/dist</filename>.

source: To flatten the <literal>pf</literal> tree:
es_es: Para aplanar el árbol <literal>pf</literal>:
