Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: The FreeBSD Project differentiates platform targets into four tiers. Each tier includes a list of guarantees consumers may rely on as well as obligations by the Project and developers to fulfill those guarantees. These lists define the minimum guarantees for each tier. The Project and developers may provide additional levels of support beyond the minimum guarantees for a given tier, but such additional support is not guaranteed. Each platform target is assigned to a specific tier for each stable branch. As a result, a platform target might be assigned to different tiers on concurrent stable branches.
es_es: El Proyecto FreeBSD diferencia los objetivos de la plataforma en cuatro niveles. Cada nivel incluye una lista de garantías en las que los consumidores pueden confiar, así como las obligaciones del Proyecto y los desarrolladores para cumplir con esas garantías. Estas listas definen las garantías mínimas para cada nivel. El Proyecto y los desarrolladores pueden proporcionar niveles adicionales de soporte más allá de las garantías mínimas para un nivel determinado, pero dicho soporte adicional no está garantizado. Cada objetivo de plataforma se asigna a un nivel específico para cada rama estable. Como resultado, un destino de plataforma podría asignarse a diferentes niveles en ramas estables concurrentes.

source: Platform Targets
es_es: Objetivos de plataforma

source: Support for a hardware platform consists of two components: kernel support and userland Application Binary Interfaces (ABIs). Kernel platform support includes things needed to run a FreeBSD kernel on a hardware platform such as machine-dependent virtual memory management and device drivers. A userland ABI specifies an interface for user processes to interact with a FreeBSD kernel and base system libraries. A userland ABI includes system call interfaces, the layout and semantics of public data structures, and the layout and semantics of arguments passed to subroutines. Some components of an ABI may be defined by specifications such as the layout of C++ exception objects or calling conventions for C functions.
es_es: El soporte para una plataforma de hardware consta de dos componentes: el soporte del kernel y las interfaces binarias de aplicaciones (ABI) del área de usuario. El soporte de la plataforma del kernel incluye las cosas necesarias para ejecutar un kernel FreeBSD en una plataforma de hardware, como la administración de memoria virtual dependiente de la máquina y los controladores de dispositivo. Una ABI de área de usuario especifica una interfaz para que los procesos de usuario interactúen con un núcleo de FreeBSD y bibliotecas del sistema base. Una ABI de área de usuario incluye interfaces de llamada al sistema, el diseño y la semántica de las estructuras de datos públicas y el diseño y la semántica de los argumentos que se pasan a las subrutinas. Algunos componentes de una ABI pueden definirse mediante especificaciones como el diseño de objetos de excepción de C ++ o convenciones de llamada para funciones de C.

source: A FreeBSD kernel also uses an ABI (sometimes referred to as the Kernel Binary Interface (KBI)) which includes the semantics and layouts of public data structures and the layout and semantics of arguments to public functions within the kernel itself.
es_es: Un kernel de FreeBSD también usa una ABI (a veces denominada interfaz binaria del kernel (KBI)) que incluye la semántica y los diseños de las estructuras de datos públicas y el diseño y la semántica de los argumentos de las funciones públicas dentro del propio kernel.

source: A FreeBSD kernel may support multiple userland ABIs. For example, FreeBSD's amd64 kernel supports FreeBSD amd64 and i386 userland ABIs as well as Linux x86_64 and i386 userland ABIs. A FreeBSD kernel should support a <quote>native</quote> ABI as the default ABI. The native <quote>ABI</quote> generally shares certain properties with the kernel ABI such as the C calling convention, sizes of basic types, etc.
es_es: Un kernel de FreeBSD puede admitir múltiples ABI de usuario. Por ejemplo, el kernel amd64 de FreeBSD es compatible con las ABI de área de usuario amd64 e i386 de FreeBSD, así como con las ABI de área de usuario de Linux x86_64 e i386. Un kernel de FreeBSD debería admitir un <quote>nativo</quote> ABI como ABI predeterminado. El nativo <quote>ABI</quote> generalmente comparte ciertas propiedades con la ABI del kernel, como la convención de llamadas de C, tamaños de tipos básicos, etc.

source: Tiers are defined for both kernels and userland ABIs. In the common case, a platform's kernel and FreeBSD ABIs are assigned to the same tier.
es_es: Los niveles se definen tanto para los núcleos como para las ABI del área de usuario. En el caso común, el kernel de una plataforma y las ABI de FreeBSD se asignan al mismo nivel.

source: Tier 1: Fully-Supported Architectures
es_es: Nivel 1: Arquitecturas totalmente compatibles

source: Tier 1 platforms are the most mature FreeBSD platforms. They are supported by the security officer, release engineering, and port management teams. Tier 1 architectures are expected to be Production Quality with respect to all aspects of the FreeBSD operating system, including installation and development environments.
es_es: Las plataformas de nivel 1 son las plataformas FreeBSD más maduras. Están respaldados por el oficial de seguridad, la ingeniería de liberación y los equipos de administración del puerto. Se espera que las arquitecturas de nivel 1 sean de calidad de producción con respecto a todos los aspectos del sistema operativo FreeBSD, incluidos los entornos de instalación y desarrollo.

source: The FreeBSD Project provides the following guarantees to consumers of Tier 1 platforms:
es_es: El Proyecto FreeBSD ofrece las siguientes garantías a los consumidores de plataformas Tier 1:

source: Official FreeBSD release images will be provided by the release engineering team.
es_es: Las imágenes oficiales de lanzamiento de FreeBSD serán proporcionadas por el equipo de ingenieros de lanzamiento.

source: Binary updates and source patches for Security Advisories and Errata Notices will be provided for supported releases.
es_es: Se proporcionarán actualizaciones binarias y parches de origen para avisos de seguridad y avisos de erratas para las versiones compatibles.

source: Source patches for Security Advisories will be provided for supported branches.
es_es: Se proporcionarán parches de origen para avisos de seguridad para las sucursales admitidas.

source: Binary updates and source patches for cross-platform Security Advisories will typically be provided at the time of the announcement.
es_es: Las actualizaciones binarias y los parches de origen para los avisos de seguridad multiplataforma se proporcionarán normalmente en el momento del anuncio.

source: Changes to userland ABIs will generally include compatibility shims to ensure correct operation of binaries compiled against any stable branch where the platform is Tier 1. These shims might not be enabled in the default install. If compatibility shims are not provided for an ABI change, the lack of shims will be clearly documented in the release notes.
es_es: Los cambios en las ABI del área de usuario generalmente incluirán ajustes de compatibilidad para garantizar el funcionamiento correcto de los binarios compilados en cualquier rama estable donde la plataforma sea de nivel 1. Es posible que estos ajustes no estén habilitados en la instalación predeterminada. Si no se proporcionan calzas de compatibilidad para un cambio de ABI, la falta de calzas se documentará claramente en las notas de la versión.

source: Changes to certain portions of the kernel ABI will include compatibility shims to ensure correct operation of kernel modules compiled against the oldest supported release on the branch. Note that not all parts of the kernel ABI are protected.
es_es: Los cambios en ciertas partes de la ABI del kernel incluirán ajustes de compatibilidad para garantizar el funcionamiento correcto de los módulos del kernel compilados con la versión compatible más antigua de la rama. Tenga en cuenta que no todas las partes de la ABI del kernel están protegidas.

source: Official binary packages for third party software will be provided by the ports team. For embedded architectures, these packages may be cross-built from a different architecture.
es_es: El equipo de ports proporcionará paquetes binarios oficiales para software de terceros. Para las arquitecturas integradas, estos paquetes pueden construirse de forma cruzada a partir de una arquitectura diferente.

source: Most relevant ports should either build or have the appropriate filters to prevent inappropriate ones from building.
es_es: Los puertos más relevantes deberían construir o tener los filtros apropiados para evitar que se construyan otros inapropiados.

source: New features which are not inherently platform-specific will be fully functional on all Tier 1 architectures.
es_es: Las nuevas características que no son inherentemente específicas de la plataforma serán completamente funcionales en todas las arquitecturas de Nivel 1.

source: Features and compatibility shims used by binaries compiled against older stable branches may be removed in newer major versions. Such removals will be clearly documented in the release notes.
es_es: Las características y las correcciones de compatibilidad utilizadas por los binarios compilados contra ramas estables más antiguas pueden eliminarse en versiones principales más recientes. Dichas eliminaciones se documentarán claramente en las notas de la versión.

source: Tier 1 platforms should be fully documented. Basic operations will be documented in the FreeBSD Handbook.
es_es: Las plataformas de nivel 1 deben estar completamente documentadas. Las operaciones básicas se documentarán en el manual de FreeBSD.

source: Tier 1 platforms will be included in the source tree.
es_es: Las plataformas de nivel 1 se incluirán en el árbol de fuentes.

source: Tier 1 platforms should be self-hosting either via the in-tree toolchain or an external toolchain. If an external toolchain is required, official binary packages for an external toolchain will be provided.
es_es: Las plataformas de nivel 1 deben ser autohospedables, ya sea a través de la cadena de herramientas en árbol o una cadena de herramientas externa. Si se requiere una cadena de herramientas externa, se proporcionarán paquetes binarios oficiales para una cadena de herramientas externa.

source: To maintain maturity of Tier 1 platforms, the FreeBSD Project will maintain the following resources to support development:
es_es: Para mantener la madurez de las plataformas de Nivel 1, el Proyecto FreeBSD mantendrá los siguientes recursos para apoyar el desarrollo:

source: Build and test automation support either in the FreeBSD.org cluster or some other location easily available for all developers. Embedded platforms may substitute an emulator available in the FreeBSD.org cluster for actual hardware.
es_es: Cree y pruebe el soporte de automatización, ya sea en el clúster de FreeBSD.org o en alguna otra ubicación fácilmente disponible para todos los desarrolladores. Las plataformas integradas pueden sustituir un emulador disponible en el clúster de FreeBSD.org por hardware real.

source: Inclusion in the <userinput>make universe</userinput> and <userinput>make tinderbox</userinput> targets.
es_es: Inclusión en el <userinput>make universe</userinput> y <userinput>make tinderbox</userinput>objetivos.

source: Dedicated hardware in one of the FreeBSD clusters for package building (either natively or via qemu-user).
es_es: Hardware dedicado en uno de los clústeres de FreeBSD para la construcción de paquetes (ya sea de forma nativa o mediante qemu-user).

source: Collectively, developers are required to provide the following to maintain the Tier 1 status of a platform:
es_es: En conjunto, los desarrolladores deben proporcionar lo siguiente para mantener el estado de Nivel 1 de una plataforma:

source: Changes to the source tree should not knowingly break the build of a Tier 1 platform.
es_es: Los cambios en el árbol de fuentes no deben romper conscientemente la construcción de una plataforma de Nivel 1.

source: Tier 1 architectures must have a mature, healthy ecosystem of users and active developers.
es_es: Las arquitecturas de nivel 1 deben tener un ecosistema maduro y saludable de usuarios y desarrolladores activos.

source: Developers should be able to build packages on commonly available, non-embedded Tier 1 systems. This can mean either native builds if non-embedded systems are commonly available for the platform in question, or it can mean cross-builds hosted on some other Tier 1 architecture.
es_es: Los desarrolladores deberían poder crear paquetes en sistemas de Nivel 1 no integrados y comúnmente disponibles. Esto puede significar compilaciones nativas si los sistemas no integrados están comúnmente disponibles para la plataforma en cuestión, o puede significar compilaciones cruzadas alojadas en alguna otra arquitectura de Nivel 1.

source: Changes cannot break the userland ABI. If an ABI change is required, ABI compatibility for existing binaries should be provided via use of symbol versioning or shared library version bumps.
es_es: Los cambios no pueden romper la ABI del área de usuario. Si se requiere un cambio de ABI, la compatibilidad de ABI para binarios existentes debe proporcionarse mediante el uso de versiones de símbolos o cambios de versión de biblioteca compartida.

source: Changes merged to stable branches cannot break the protected portions of the kernel ABI. If a kernel ABI change is required, the change should be modified to preserve functionality of existing kernel modules.
es_es: Los cambios combinados en ramas estables no pueden romper las partes protegidas de la ABI del kernel. Si se requiere un cambio de ABI del kernel, el cambio debe modificarse para preservar la funcionalidad de los módulos del kernel existentes.

source: Tier 2: Developmental and Niche Architectures
es_es: Nivel 2: Arquitecturas de desarrollo y de nicho

source: Tier 2 platforms are functional, but less mature FreeBSD platforms. They are not supported by the security officer, release engineering, and port management teams.
es_es: Las plataformas de nivel 2 son plataformas FreeBSD funcionales, pero menos maduras. No cuentan con el apoyo del oficial de seguridad, la ingeniería de liberación y los equipos de administración del puerto.

source: Tier 2 platforms may be Tier 1 platform candidates that are still under active development. Architectures reaching end of life may also be moved from Tier 1 status to Tier 2 status as the availability of resources to continue to maintain the system in a Production Quality state diminishes. Well-supported niche architectures may also be Tier 2.
es_es: Las plataformas de nivel 2 pueden ser candidatas a plataformas de nivel 1 que aún se encuentran en desarrollo activo. Las arquitecturas que llegan al final de su vida útil también pueden pasar del estado de Nivel 1 al estado de Nivel 2 a medida que disminuye la disponibilidad de recursos para continuar manteniendo el sistema en un estado de Calidad de producción. Las arquitecturas de nicho bien soportadas también pueden ser de Nivel 2.

source: The FreeBSD Project provides the following guarantees to consumers of Tier 2 platforms:
es_es: El Proyecto FreeBSD proporciona las siguientes garantías a los consumidores de plataformas Tier 2:

source: The ports infrastructure should include basic support for Tier 2 architectures sufficient to support building ports and packages. This includes support for basic packages such as ports-mgmt/pkg, but there is no guarantee that arbitrary ports will be buildable or functional.
es_es: La infraestructura de puertos debe incluir soporte básico para arquitecturas de Nivel 2 suficiente para soportar la construcción de puertos y paquetes. Esto incluye soporte para paquetes básicos como ports-mgmt / pkg, pero no hay garantía de que los puertos arbitrarios sean compilables o funcionales.

source: New features which are not inherently platform-specific should be feasible on all Tier 2 architectures if not implemented.
es_es: Las nuevas características que no son inherentemente específicas de la plataforma deberían ser factibles en todas las arquitecturas de Nivel 2 si no se implementan.

source: Tier 2 platforms will be included in the source tree.
es_es: Las plataformas de nivel 2 se incluirán en el árbol de fuentes.

source: Tier 2 platforms should be self-hosting either via the in-tree toolchain or an external toolchain. If an external toolchain is required, official binary packages for an external toolchain will be provided.
es_es: Las plataformas de nivel 2 deben autohospedarse a través de la cadena de herramientas en árbol o una cadena de herramientas externa. Si se requiere una cadena de herramientas externa, se proporcionarán paquetes binarios oficiales para una cadena de herramientas externa.

source: Tier 2 platforms should provide functional kernels and userlands even if an official release distribution is not provided.
es_es: Las plataformas de nivel 2 deben proporcionar kernels funcionales y áreas de usuario incluso si no se proporciona una distribución de lanzamiento oficial.

source: To maintain maturity of Tier 2 platforms, the FreeBSD Project will maintain the following resources to support development:
es_es: Para mantener la madurez de las plataformas Tier 2, el Proyecto FreeBSD mantendrá los siguientes recursos para apoyar el desarrollo:

source: Collectively, developers are required to provide the following to maintain the Tier 2 status of a platform:
es_es: En conjunto, los desarrolladores deben proporcionar lo siguiente para mantener el estado de Nivel 2 de una plataforma:

source: Changes to the source tree should not knowingly break the build of a Tier 2 platform.
es_es: Los cambios en el árbol de fuentes no deberían romper a sabiendas la construcción de una plataforma de Nivel 2.

source: Tier 2 architectures must have an active ecosystem of users and developers.
es_es: Las arquitecturas de nivel 2 deben tener un ecosistema activo de usuarios y desarrolladores.

source: While changes are permitted to break the userland ABI, the ABI should not be broken gratuitously. Significant userland ABI changes should be restricted to major versions.
es_es: Si bien se permite que los cambios rompan la ABI del área de usuario, la ABI no debe romperse gratuitamente. Los cambios significativos en la ABI del área de usuario deben restringirse a las versiones principales.

source: New features that are not yet implemented on Tier 2 architectures should provide a means of disabling them on those architectures.
es_es: Las nuevas funciones que aún no se han implementado en las arquitecturas de nivel 2 deberían proporcionar un medio para desactivarlas en esas arquitecturas.

source: Tier 3: Experimental Architectures
es_es: Nivel 3: Arquitecturas experimentales

source: Tier 3 platforms have at least partial FreeBSD support. They are <emphasis>not</emphasis> supported by the security officer, release engineering, and port management teams.
es_es: Las plataformas de nivel 3 tienen al menos soporte parcial de FreeBSD. Son<emphasis>no</emphasis> apoyado por el oficial de seguridad, la ingeniería de liberación y los equipos de gestión del puerto.

source: Tier 3 platforms are architectures in the early stages of development, for non-mainstream hardware platforms, or which are considered legacy systems unlikely to see broad future use. Initial support for Tier 3 platforms may exist in a separate repository rather than the main source repository.
es_es: Las plataformas de nivel 3 son arquitecturas en las primeras etapas de desarrollo, para plataformas de hardware no convencionales, o que se consideran sistemas heredados con pocas probabilidades de tener un uso amplio en el futuro. El soporte inicial para las plataformas de Nivel 3 puede existir en un repositorio separado en lugar del repositorio de origen principal.

source: The FreeBSD Project provides no guarantees to consumers of Tier 3 platforms and is not committed to maintaining resources to support development. Tier 3 platforms may not always be buildable, nor are any kernel or userland ABIs considered stable.
es_es: El Proyecto FreeBSD no ofrece garantías a los consumidores de plataformas Tier 3 y no se compromete a mantener los recursos para apoyar el desarrollo. Es posible que las plataformas de nivel 3 no siempre sean compilables, ni ningún núcleo o ABI de área de usuario se considera estable.

source: Tier 4: Unsupported Architectures
es_es: Nivel 4: arquitecturas no admitidas

source: Tier 4 platforms are not supported in any form by the project.
es_es: Las plataformas de nivel 4 no son compatibles de ninguna forma con el proyecto.

source: All systems not otherwise classified are Tier 4 systems. When a platform transitions to Tier 4, all support for the platform is removed from the source and ports trees. Note that ports support should remain as long as the platform is supported in a branch supported by ports.
es_es: Todos los sistemas no clasificados de otra manera son sistemas de Nivel 4. Cuando una plataforma pasa al Nivel 4, todo el soporte para la plataforma se elimina de los árboles de origen y puertos. Tenga en cuenta que la compatibilidad con puertos debe permanecer siempre que la plataforma sea compatible con una rama admitida por puertos.

source: Policy on Changing the Tier of an Architecture
es_es: Política sobre el cambio de nivel de una arquitectura

source: Systems may only be moved from one tier to another by approval of the FreeBSD Core Team, which shall make that decision in collaboration with the Security Officer, Release Engineering, and ports management teams. For a platform to be promoted to a higher tier, any missing support guarantees must be satisfied before the promotion is completed.
es_es: Los sistemas solo se pueden mover de un nivel a otro con la aprobación del equipo central de FreeBSD, que tomará esa decisión en colaboración con el oficial de seguridad, la ingeniería de versiones y los equipos de administración de puertos. Para que una plataforma sea promovida a un nivel superior, las garantías de soporte que falten deben cumplirse antes de que se complete la promoción.

source: Ports Specific FAQ
es_es: Preguntas frecuentes sobre puertos específicos

source: Adding a New Port
es_es: Agregar un puerto nuevo

source: How do I add a new port?
es_es: ¿Cómo agrego un nuevo puerto?

source: First, please read the section about repository copies.
es_es: Primero, lea la sección sobre copias del repositorio.
