Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: Consider the situation where a user has submitted a PR containing code from the NetBSD project. Looking at the PR, the developer sees it is not an area of the tree they normally work in, so they have the change reviewed by the <literal>arch</literal> mailing list. Since the change is complex, the developer opts to <acronym>MFC</acronym> after one month to allow adequate testing.
es_es: Considere la situación en la que un usuario ha enviado un PR que contiene código del proyecto NetBSD. Al mirar el PR, el desarrollador ve que no es un área del árbol en el que normalmente trabajan, por lo que el cambio lo revisa el <literal>arch</literal> lista de correo. Dado que el cambio es complejo, el desarrollador opta por <acronym>MFC</acronym> después de un mes para permitir las pruebas adecuadas.

source: The extra information to include in the commit would look something like
es_es: La información adicional para incluir en la confirmación sería algo así como

source: Example Combined Commit Log
es_es: Ejemplo de registro de confirmación combinado

source: Preferred License for New Files
es_es: Licencia preferida para los nuevos archivos

source: The FreeBSD Project's full license policy can be found at <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">https://www.FreeBSD.org/internal/software-license.html</link>. The rest of this section is intended to help you get started. As a rule, when in doubt, ask. It is much easier to give advice than to fix the source tree.
es_es: La política de licencia completa del Proyecto FreeBSD puede encontrarse en <link xlink:href="@@URL_RELPREFIX@@/internal/software-license.html">https://www.FreeBSD.org/internal/software-license.html</link>. El resto de esta sección está pensada para ayudarte a empezar. Como regla, cuando tenga dudas, pregunte. Es mucho más fácil dar consejos que arreglar el árbol fuente.

source: The FreeBSD Project suggests and uses this text as the preferred license scheme:
es_es: El Proyecto FreeBSD sugiere y usa este texto como el esquema de licencia preferido:

source: The FreeBSD project strongly discourages the so-called "advertising clause" in new code. Due to the large number of contributors to the FreeBSD project, complying with this clause for many commercial vendors has become difficult. If you have code in the tree with the advertising clause, please consider removing it. In fact, please consider using the above license for your code.
es_es: El proyecto FreeBSD desaconseja rotundamente la denominada "cláusula publicitaria" en el nuevo código. Debido a la gran cantidad de contribuyentes al proyecto FreeBSD, cumplir con esta cláusula para muchos proveedores comerciales se ha vuelto difícil. Si tiene código en el árbol con la cláusula publicitaria, considere eliminarlo. De hecho, considere usar la licencia anterior para su código.

source: The FreeBSD project discourages completely new licenses and variations on the standard licenses. New licenses require the approval of the Core Team <email>core@FreeBSD.org</email> to reside in the main repository. The more different licenses that are used in the tree, the more problems that this causes to those wishing to utilize this code, typically from unintended consequences from a poorly worded license.
es_es: El proyecto FreeBSD desaconseja licencias completamente nuevas y variaciones de las licencias estándar. Las nuevas licencias requieren la aprobación del Core Team <email>core@FreeBSD.org</email> residir en el repositorio principal. Cuantas más licencias diferentes se utilicen en el árbol, más problemas ocasionará a quienes deseen utilizar este código, por lo general debido a las consecuencias no deseadas de una licencia mal redactada.

source: Project policy dictates that code under some non-BSD licenses must be placed only in specific sections of the repository, and in some cases, compilation must be conditional or even disabled by default. For example, the GENERIC kernel must be compiled under only licenses identical to or substantially similar to the BSD license. GPL, APSL, CDDL, etc, licensed software must not be compiled into GENERIC.
es_es: La política del proyecto dicta que el código de algunas licencias que no sean BSD debe colocarse solo en secciones específicas del repositorio y, en algunos casos, la compilación debe ser condicional o incluso deshabilitada de forma predeterminada. Por ejemplo, el núcleo GENÉRICO debe compilarse únicamente bajo licencias idénticas o sustancialmente similares a la licencia BSD. GPL, APSL, CDDL, etc., el software con licencia no debe compilarse en GENERIC.

source: Developers are reminded that in open source, getting "open" right is just as important as getting "source" right, as improper handling of intellectual property has serious consequences. Any questions or concerns should immediately be brought to the attention of the core team.
es_es: Se recuerda a los desarrolladores que en el código abierto, conseguir "abrir" correctamente es tan importante como conseguir "fuente" correcta, ya que el manejo inadecuado de la propiedad intelectual tiene graves consecuencias. Cualquier pregunta o inquietud debe comunicarse inmediatamente con el equipo central.

source: Keeping Track of Licenses Granted to the FreeBSD Project
es_es: Seguimiento de las licencias concedidas al proyecto FreeBSD

source: Various software or data exist in the repositories where the FreeBSD project has been granted a special licence to be able to use them. A case in point are the Terminus fonts for use with <citerefentry><refentrytitle>vt</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Here the author Dimitar Zhekov has allowed us to use the "Terminus BSD Console" font under a 2-clause BSD license rather than the regular Open Font License he normally uses.
es_es: Existen varios software o datos en los repositorios donde el proyecto FreeBSD ha recibido una licencia especial para poder usarlos. Un ejemplo son las fuentes Terminus para su uso con <citerefentry><refentrytitle>vt</refentrytitle><manvolnum>4</manvolnum></citerefentry>. Aquí, el autor Dimitar Zhekov nos ha permitido usar la fuente "Terminus BSD Console" bajo una licencia BSD de 2 cláusulas en lugar de la licencia de fuente abierta regular que usa normalmente.

source: It is clearly sensible to keep a record of any such license grants. To that end, the Core Team <email>core@FreeBSD.org</email> has decided to keep an archive of them. Whenever the FreeBSD project is granted a special license we require the Core Team <email>core@FreeBSD.org</email> to be notified. Any developers involved in arranging such a license grant, please send details to the Core Team <email>core@FreeBSD.org</email> including:
es_es: Es evidente que es sensato mantener un registro de dichas concesiones de licencias. Con ese fin, el Core Team <email>core@FreeBSD.org</email> ha decidido mantener un archivo de ellos. Siempre que se conceda una licencia especial al proyecto FreeBSD, requerimos el equipo central <email>core@FreeBSD.org</email> ser notificado. Cualquier desarrollador involucrado en la organización de dicha concesión de licencia, envíe los detalles al equipo central. <email>core@FreeBSD.org</email>incluyendo:

source: Contact details for people or organizations granting the special license.
es_es: Datos de contacto de personas u organizaciones que otorgan la licencia especial.

source: What files, directories etc. in the repositories are covered by the license grant including the revision numbers where any specially licensed material was committed.
es_es: Qué archivos, directorios, etc. de los repositorios están cubiertos por la concesión de licencia, incluidos los números de revisión donde se comprometió cualquier material con licencia especial.

source: The date the license comes into effect from. Unless otherwise agreed, this will be the date the license was issued by the authors of the software in question.
es_es: La fecha en que la licencia entra en vigor. A menos que se acuerde lo contrario, esta será la fecha en que la licencia fue emitida por los autores del software en cuestión.

source: The license text.
es_es: El texto de la licencia.

source: A note of any restrictions, limitations or exceptions that apply specifically to FreeBSD's usage of the licensed material.
es_es: Una nota de cualquier restricción, limitación o excepción que se aplique específicamente al uso de FreeBSD del material licenciado.

source: Any other relevant information.
es_es: Cualquier otra información relevante.

source: Once the Core Team <email>core@FreeBSD.org</email> is satisfied that all the necessary details have been gathered and are correct, the secretary will send a PGP-signed acknowledgement of receipt including the license details. This receipt will be persistently archived and serve as our permanent record of the license grant.
es_es: Una vez que el Equipo del Núcleo <email>core@FreeBSD.org</email> esté satisfecho de que todos los detalles necesarios se han reunido y son correctos, la secretaria enviará un acuse de recibo firmado por PGP incluyendo los detalles de la licencia. Este recibo será archivado de forma persistente y servirá como nuestro registro permanente de la adjudicación de la licencia.

source: The license archive should contain only details of license grants; this is not the place for any discussions around licensing or other subjects. Access to data within the license archive will be available on request to the Core Team <email>core@FreeBSD.org</email>.
es_es: El archivo de licencias debe contener sólo detalles de las licencias concedidas; no es el lugar para ninguna discusión sobre licencias u otros temas. El acceso a los datos del archivo de licencias estará disponible a petición del Equipo del Núcleo <email>core@FreeBSD.org</email>.

source: Developer Relations
es_es: Relaciones con los desarrolladores

source: When working directly on your own code or on code which is already well established as your responsibility, then there is probably little need to check with other committers before jumping in with a commit. Working on a bug in an area of the system which is clearly orphaned (and there are a few such areas, to our shame), the same applies. When modifying parts of the system which are maintained, formally, or informally, consider asking for review just as a developer would have before becoming a committer. For ports, contact the listed <varname>MAINTAINER</varname> in the <filename>Makefile</filename>.
es_es: Cuando trabaje directamente en su propio código o en un código que ya está bien establecido como su responsabilidad, entonces probablemente haya poca necesidad de verificar con otros confirmadores antes de saltar con un compromiso. Trabajando en un error en un área del sistema que está claramente huérfana (y hay algunas áreas de este tipo, para nuestra vergüenza), se aplica lo mismo. Cuando modifique partes del sistema que se mantienen, formal o informalmente, considere solicitar una revisión tal como lo haría un desarrollador antes de convertirse en un committer. Para puertos, comuníquese con el <varname>MAINTAINER</varname> en el<filename>Makefile</filename>.

source: To determine if an area of the tree is maintained, check the MAINTAINERS file at the root of the tree. If nobody is listed, scan the revision history to see who has committed changes in the past. An example script that lists each person who has committed to a given file along with the number of commits each person has made can be found at on <systemitem>freefall</systemitem> at <filename>~eadler/bin/whodid</filename>. If queries go unanswered or the committer otherwise indicates a lack of interest in the area affected, go ahead and commit it.
es_es: Para determinar si se mantiene un área del árbol, consulte el archivo MAINTAINERS en la raíz del árbol. Si no aparece nadie, escanee el historial de revisiones para ver quién ha realizado cambios en el pasado. Puede encontrar un script de ejemplo que enumera a cada persona que se ha comprometido con un archivo determinado junto con el número de confirmaciones que ha realizado cada persona en el <systemitem>freefall</systemitem> a <filename>~eadler/bin/whodid</filename>. Si las consultas quedan sin respuesta o el autor de la confirmación indica de otro modo una falta de interés en el área afectada, continúe y confíe.

source: Avoid sending private emails to maintainers. Other people might be interested in the conversation, not just the final output.
es_es: Evita enviar correos electrónicos privados a los mantenedores. Otras personas podrían estar interesadas en la conversación, no sólo en el resultado final.

source: If there is any doubt about a commit for any reason at all, have it reviewed before committing. Better to have it flamed then and there rather than when it is part of the repository. If a commit does results in controversy erupting, it may be advisable to consider backing the change out again until the matter is settled. Remember, with a version control system we can always change it back.
es_es: Si hay alguna duda sobre un compromiso por cualquier motivo, hágalo revisar antes de realizar el compromiso. Es mejor tenerlo flameado en ese mismo momento que cuando es parte del repositorio. Si un compromiso da lugar a que surja una controversia, puede ser aconsejable considerar volver a respaldar el cambio hasta que se resuelva el asunto. Recuerde, con un sistema de control de versiones siempre podemos volver a cambiarlo.

source: Do not impugn the intentions of others. If they see a different solution to a problem, or even a different problem, it is probably not because they are stupid, because they have questionable parentage, or because they are trying to destroy hard work, personal image, or FreeBSD, but basically because they have a different outlook on the world. Different is good.
es_es: No impugne las intenciones de los demás. Si ven una solución diferente a un problema, o incluso un problema diferente, probablemente no sea porque sean estúpidos, porque tienen una paternidad cuestionable o porque están tratando de destruir el trabajo duro, la imagen personal o FreeBSD, sino básicamente porque tienen una perspectiva diferente del mundo. Diferente es bueno.

source: Disagree honestly. Argue your position from its merits, be honest about any shortcomings it may have, and be open to seeing their solution, or even their vision of the problem, with an open mind.
es_es: Honestamente en desacuerdo. Argumente su posición desde sus méritos, sea honesto acerca de cualquier deficiencia que pueda tener y esté abierto a ver su solución, o incluso su visión del problema, con una mente abierta.

source: Accept correction. We are all fallible. When you have made a mistake, apologize and get on with life. Do not beat up yourself, and certainly do not beat up others for your mistake. Do not waste time on embarrassment or recrimination, just fix the problem and move on.
es_es: Acepta la corrección. Todos somos falibles. Cuando haya cometido un error, discúlpese y siga con su vida. No se castigue a sí mismo, y ciertamente no golpee a otros por su error. No pierda el tiempo en vergüenza o recriminación, simplemente solucione el problema y siga adelante.

source: Ask for help. Seek out (and give) peer reviews. One of the ways open source software is supposed to excel is in the number of eyeballs applied to it; this does not apply if nobody will review code.
es_es: Pedir ayuda. Busque (y proporcione) revisiones de pares. Una de las formas en que se supone que el software de código abierto sobresale es en la cantidad de ojos que se le aplican; esto no se aplica si nadie revisa el código.

source: If in Doubt...
es_es: Si tienes dudas ...

source: When unsure about something, whether it be a technical issue or a project convention be sure to ask. If you stay silent you will never make progress.
es_es: Cuando no esté seguro de algo, ya sea un problema técnico o una convención del proyecto, asegúrese de preguntar. Si te quedas en silencio, nunca progresarás.

source: If it relates to a technical issue ask on the public mailing lists. Avoid the temptation to email the individual person that knows the answer. This way everyone will be able to learn from the question and the answer.
es_es: Si se relaciona con un problema técnico, pregunte en las listas de correo públicas. Evite la tentación de enviar un correo electrónico a la persona que conoce la respuesta. De esta manera, todos podrán aprender de la pregunta y la respuesta.

source: For project specific or administrative questions ask, in order:
es_es: Para preguntas administrativas o específicas del proyecto, pregunte, en orden:

source: Your mentor or former mentor.
es_es: Tu mentor o ex mentor.

source: An experienced committer on IRC, email, etc.
es_es: Un cometer experimentado en IRC, correo electrónico, etc.

source: Any team with a "hat", as they can give you a definitive answer.
es_es: Cualquier equipo con "sombrero", ya que pueden darte una respuesta definitiva.

source: If still not sure, ask on FreeBSD developers mailing list.
es_es: Si aún no está seguro, pregunte en la lista de correo de desarrolladores de FreeBSD.

source: Once your question is answered, if no one pointed you to documentation that spelled out the answer to your question, document it, as others will have the same question.
es_es: Una vez que se responda su pregunta, si nadie le indicó la documentación que detalla la respuesta a su pregunta, documente, ya que otros tendrán la misma pregunta.

source: The FreeBSD Project utilizes <application>Bugzilla</application> for tracking bugs and change requests. Be sure that if you commit a fix or suggestion found in the PR database to close it. It is also considered nice if you take time to close any PRs associated with your commits, if appropriate.
es_es: El proyecto FreeBSD utiliza <application>Bugzilla</application> para rastrear errores y solicitudes de cambio. Asegúrese de cerrarlo si confirma una solución o sugerencia que se encuentra en la base de datos de relaciones públicas. También se considera bueno si se toma el tiempo para cerrar cualquier RP asociado con sus confirmaciones, si corresponde.

source: Committers with non-<systemitem class="domainname">FreeBSD.org</systemitem> Bugzilla accounts can have the old account merged with the <systemitem class="domainname">FreeBSD.org</systemitem> account by following these steps:
es_es: Comprometidos con no <systemitem class="domainname">FreeBSD.org</systemitem> Las cuentas de Bugzilla pueden tener la cuenta anterior fusionada con la <systemitem class="domainname">FreeBSD.org</systemitem> cuenta siguiendo estos pasos:

source: Log in using your old account.
es_es: Inicie sesión con su cuenta anterior.

source: Open new bug. Choose <literal>Services</literal> as the Product, and <literal>Bug Tracker</literal> as the Component. In bug description list accounts you wish to be merged.
es_es: Abra un nuevo error. Escoger <literal>Services</literal> como el Producto, y<literal>Bug Tracker</literal> como Componente. En la lista de descripción de errores, las cuentas que desea fusionar.

source: Log in using <systemitem class="domainname">FreeBSD.org</systemitem> account and post comment to newly opened bug to confirm ownership. See <xref linkend="kerberos-ldap"/> for more details on how to generate or set a password for your <systemitem class="domainname">FreeBSD.org</systemitem> account.
es_es: Iniciar sesión usando <systemitem class="domainname">FreeBSD.org</systemitem> cuenta y publique un comentario en el error recién abierto para confirmar la propiedad. Ver <xref linkend="kerberos-ldap"/> para obtener más detalles sobre cómo generar o establecer una contraseña para su <systemitem class="domainname">FreeBSD.org</systemitem>cuenta.

source: If there are more than two accounts to merge, post comments from each of them.
es_es: Si hay más de dos cuentas para fusionar, publique comentarios de cada una de ellas.

source: You can find out more about <application>Bugzilla</application> at:
es_es: Puede obtener más información sobre <application>Bugzilla</application> en:

source: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/index.html">FreeBSD Problem Report Handling Guidelines</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/pr-guidelines/index.html">Pautas de manejo de informes de problemas de FreeBSD</link>

source: Phabricator
es_es: Fabricador

source: The FreeBSD Project utilizes <link xlink:href="https://reviews.freebsd.org">Phabricator</link> for code review requests. See the <link xlink:href="https://wiki.freebsd.org/CodeReview">CodeReview</link> wiki page for details.
es_es: El proyecto FreeBSD utiliza <link xlink:href="https://reviews.freebsd.org">Phabricator</link> para solicitudes de revisión de código. Ver el<link xlink:href="https://wiki.freebsd.org/CodeReview">CodeReview</link> wiki page for details.

source: Committers with non-<systemitem class="domainname">FreeBSD.org</systemitem> Phabricator accounts can have the old account renamed to the <systemitem class="domainname">FreeBSD.org</systemitem> account by following these steps:
es_es: Comprometidos con no <systemitem class="domainname">FreeBSD.org</systemitem> Las cuentas de Phabricator pueden cambiar el nombre de la cuenta anterior a la <systemitem class="domainname">FreeBSD.org</systemitem> cuenta siguiendo estos pasos:

source: Change your <application>Phabricator</application> account email to your <systemitem class="domainname">FreeBSD.org</systemitem> email.
es_es: Cambiar tu <application>Fabricador</application>cuenta de correo electrónico a su<systemitem class="domainname">FreeBSD.org</systemitem> correo.

source: Open new bug on our bug tracker using your <systemitem class="domainname">FreeBSD.org</systemitem> account, see <xref linkend="bugzilla"/> for more information. Choose <literal>Services</literal> as the Product, and <literal>Code Review</literal> as the Component. In bug description request that your <application>Phabricator</application> account be renamed, and provide a link to your <application>Phabricator</application> user. For example, <literal>https://reviews.freebsd.org/p/<replaceable>bob_example.com</replaceable>/</literal>
es_es: Abra un nuevo error en nuestro rastreador de errores con su <systemitem class="domainname">FreeBSD.org</systemitem> cuenta, mire <xref linkend="bugzilla"/> para más información. Escoger<literal>Services</literal> como el Producto, y <literal>revisión de código</literal> como Componente. En la descripción del error, solicite que su<application>Phabricator</application> cambiar el nombre de la cuenta y proporcionar un enlace a su<application>Phabricator</application> usuario. Por ejemplo, <literal>https://reviews.freebsd.org/p/<replaceable>bob_example.com</replaceable></literal>

source: <application>Phabricator</application> accounts cannot be merged, please do not open a new account.
es_es: <application>Phabricator</application> las cuentas no se pueden fusionar, no abra una nueva cuenta.

source: Who's Who
es_es: Quien es Quien

source: Besides the repository meisters, there are other FreeBSD project members and teams whom you will probably get to know in your role as a committer. Briefly, and by no means all-inclusively, these are:
es_es: Además de los meisters del repositorio, hay otros miembros y equipos del proyecto FreeBSD a los que probablemente conocerá en su rol de committer. Brevemente, y de ninguna manera todo incluido, estos son:

source: Documentation Engineering Team <email>doceng@FreeBSD.org</email>
es_es: Equipo de ingeniería de documentación<email>doceng@FreeBSD.org</email>
