Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: doceng is the group responsible for the documentation build infrastructure, approving new documentation committers, and ensuring that the FreeBSD website and documentation on the FTP site is up to date with respect to the <application>subversion</application> tree. It is not a conflict resolution body. The vast majority of documentation related discussion takes place on the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">FreeBSD documentation project mailing list</link>. More details regarding the doceng team can be found in its <link xlink:href="https://www.FreeBSD.org/internal/doceng.html">charter</link>. Committers interested in contributing to the documentation should familiarize themselves with the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">Documentation Project Primer</link>.
es_es: doceng es el grupo responsable de la infraestructura de construcción de documentación, la aprobación de nuevos confirmadores de documentación y la garantía de que el sitio web de FreeBSD y la documentación en el sitio FTP estén actualizados con respecto a la <application>subversion</application> árbol. No es un organismo de resolución de conflictos. La gran mayoría de la discusión relacionada con la documentación tiene lugar en el <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-doc">Lista de correo del proyecto de documentación de FreeBSD</link>. Más detalles sobre el equipo doceng se pueden encontrar en su<link xlink:href="https://www.FreeBSD.org/internal/doceng.html">charter</link>. Los confirmadores interesados en contribuir a la documentación deben familiarizarse con el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/fdp-primer/index.html">Documentation Project Primer</link>.

source: These are the members of the Release Engineering Team <email>re@FreeBSD.org</email>. This team is responsible for setting release deadlines and controlling the release process. During code freezes, the release engineers have final authority on all changes to the system for whichever branch is pending release status. If there is something you want merged from FreeBSD-CURRENT to FreeBSD-STABLE (whatever values those may have at any given time), these are the people to talk to about it.
es_es: Estos son los miembros del equipo de ingeniería de versiones <email>re@FreeBSD.org</email>. este equipo es responsable de establecer los plazos de publicación y controlar el proceso de publicación. Durante la congelación del código, los ingenieros de versiones tienen la autoridad final sobre todos los cambios en el sistema para cualquier rama que tenga el estado de versión pendiente. Si hay algo que desee fusionar de FreeBSD-CURRENT a FreeBSD-STABLE (independientemente de los valores que puedan tener en un momento dado), estas son las personas con las que hablar al respecto.

source: Gordon Tetlow is the <link xlink:href="@@URL_RELPREFIX@@/security/">FreeBSD Security Officer</link> and oversees the Security Officer Team <email>security-officer@FreeBSD.org</email>.
es_es: Gordon Tetlow es el <link xlink:href="@@URL_RELPREFIX@@/security/">Oficial de seguridad de FreeBSD</link> y supervisa el equipo de oficiales de seguridad <email>security-officer@FreeBSD.org</email>.

source: If you need advice on obscure network internals or are not sure of some potential change to the networking subsystem you have in mind, Garrett is someone to talk to. Garrett is also very knowledgeable on the various standards applicable to FreeBSD.
es_es: Si necesita asesoramiento sobre aspectos internos oscuros de la red o no está seguro de algún cambio potencial en el subsistema de red que tiene en mente, Garrett es alguien con quien hablar. Garrett también está muy bien informado sobre los diversos estándares aplicables a FreeBSD.

source: FreeBSD committer's mailing list
es_es: Lista de correo de confirmadores de FreeBSD

source: <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> and <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> are the mailing lists that the version control system uses to send commit messages to. <emphasis>Never</emphasis> send email directly to these lists. Only send replies to this list when they are short and are directly related to a commit.
es_es: <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> and <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> son las listas de correo que utiliza el sistema de control de versiones para enviar mensajes de confirmación. <emphasis>Never</emphasis> enviar correo electrónico directamente a estas listas. Solo envíe respuestas a esta lista cuando sean breves y estén directamente relacionadas con una confirmación.

source: FreeBSD developers mailing list
es_es: Lista de correo de desarrolladores de FreeBSD

source: All committers are subscribed to -developers. This list was created to be a forum for the committers <quote>community</quote> issues. Examples are Core voting, announcements, etc.
es_es: Todos los confirmadores están suscritos a -developers. Esta lista fue creada para ser un foro para los confirmadores.<quote>comunidad</quote> cuestiones. Algunos ejemplos son votaciones centrales, anuncios, etc.

source: The FreeBSD developers mailing list is for the exclusive use of FreeBSD committers. To develop FreeBSD, committers must have the ability to openly discuss matters that will be resolved before they are publicly announced. Frank discussions of work in progress are not suitable for open publication and may harm FreeBSD.
es_es: La lista de correo de desarrolladores de FreeBSD es para uso exclusivo de los confirmadores de FreeBSD. Para desarrollar FreeBSD, los confirmadores deben tener la capacidad de discutir abiertamente los asuntos que se resolverán antes de que se anuncien públicamente. Las discusiones francas sobre el trabajo en progreso no son adecuadas para la publicación abierta y pueden dañar FreeBSD.

source: All FreeBSD committers are expected not to not publish or forward messages from the FreeBSD developers mailing list outside the list membership without permission of all of the authors. Violators will be removed from the FreeBSD developers mailing list, resulting in a suspension of commit privileges. Repeated or flagrant violations may result in permanent revocation of commit privileges.
es_es: Se espera que todos los confirmadores de FreeBSD no publiquen ni reenvíen mensajes de la lista de correo de desarrolladores de FreeBSD fuera de la membresía de la lista sin el permiso de todos los autores. Los infractores serán eliminados de la lista de correo de desarrolladores de FreeBSD, lo que resultará en la suspensión de los privilegios de confirmación. Las violaciones repetidas o flagrantes pueden resultar en la revocación permanente de los privilegios de compromiso.

source: This list is <emphasis>not</emphasis> intended as a place for code reviews or for any technical discussion. In fact using it as such hurts the FreeBSD Project as it gives a sense of a closed list where general decisions affecting all of the FreeBSD using community are made without being <quote>open</quote>. Last, but not least <emphasis>never, never ever, email the FreeBSD developers mailing list and CC:/BCC: another FreeBSD list</emphasis>. Never, ever email another FreeBSD email list and CC:/BCC: the FreeBSD developers mailing list. Doing so can greatly diminish the benefits of this list.
es_es: Esta lista es <emphasis>no</emphasis> destinado a ser un lugar para revisiones de código o para cualquier discusión técnica. De hecho, usarlo como tal perjudica al Proyecto FreeBSD ya que da la sensación de una lista cerrada donde las decisiones generales que afectan a toda la comunidad que usa FreeBSD se toman sin ser <quote>abrir</quote>. Último, pero no menos importante <emphasis>nunca, nunca, envíe un correo electrónico a la lista de correo de desarrolladores de FreeBSD y CC: / BCC: otra lista de FreeBSD</emphasis>. Nunca, nunca envíe por correo electrónico otra lista de correo electrónico de FreeBSD y CC: / BCC: la lista de correo de desarrolladores de FreeBSD. Hacerlo puede disminuir en gran medida los beneficios de esta lista.

source: SSH Quick-Start Guide
es_es: Guía de inicio rápido de SSH

source: If you do not wish to type your password in every time you use <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and you use keys to authenticate, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> is there for your convenience. If you want to use <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, make sure that you run it before running other applications. X users, for example, usually do this from their <filename>.xsession</filename> or <filename>.xinitrc</filename>. See <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> for details.
es_es: Si no desea ingresar su contraseña cada vez que use<citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, y usas claves para autenticarte, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> está ahí para su conveniencia. Si quieres usar <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, asegúrese de ejecutarlo antes de ejecutar otras aplicaciones. Los usuarios de X, por ejemplo, suelen hacer esto desde su <filename>.xsession</filename> or <filename>.xinitrc</filename>. See <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry> para detalles.

source: Generate a key pair using <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>. The key pair will wind up in your <filename>$HOME/.ssh/</filename> directory.
es_es: Genere un par de claves usando <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>. El par de claves terminará en tu <filename>$HOME/.ssh/</filename> directory.

source: Only <acronym>ECDSA</acronym>, <acronym>Ed25519</acronym> or <acronym>RSA</acronym> keys are supported.
es_es: Solo <acronym>ECDSA</acronym>, <acronym>Ed25519</acronym> o <acronym>RSA</acronym> las claves son compatibles.

source: Send your public key (<filename>$HOME/.ssh/id_ecdsa.pub</filename>, <filename>$HOME/.ssh/id_ed25519.pub</filename>, or <filename>$HOME/.ssh/id_rsa.pub</filename>) to the person setting you up as a committer so it can be put into <filename><replaceable>yourlogin</replaceable></filename> in <filename>/etc/ssh-keys/</filename> on <systemitem>freefall</systemitem>.
es_es: Envíe su clave pública (<filename>$HOME/.ssh/id_ecdsa.pub</filename>, <filename>$HOME/.ssh/id_ed25519.pub</filename>, or <filename>$HOME/.ssh/id_rsa.pub</filename>)a la persona que lo establece como un consignatario para que pueda ser puesto en <filename><replaceable>yourlogin</replaceable></filename> in <filename>/etc/ssh-keys/</filename> on <systemitem>freefall</systemitem>.

source: Now <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry> can be used for authentication once per session. It prompts for the private key's pass phrase, and then stores it in the authentication agent (<citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Use <command>ssh-add -d</command> to remove keys stored in the agent.
es_es: Ahora <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry> se puede utilizar para la autenticación una vez por sesión. Solicita la contraseña de la clave privada y luego la almacena en el agente de autenticación. (<citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>). Use <command>ssh-add -d</command> Para eliminar claves almacenadas en el agente.

source: Test with a simple remote command: <command>ssh freefall.FreeBSD.org ls /usr</command>.
es_es: Prueba con un simple comando remoto:<command>ssh freefall.FreeBSD.org ls /usr</command>.

source: For more information, see <package>security/openssh-portable</package>, <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <citerefentry><refentrytitle>scp</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: For more informacion, mire <package>security/openssh-portable</package>, <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-add</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-agent</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry>, and <citerefentry><refentrytitle>scp</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: For information on adding, changing, or removing <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> keys, see <uri xlink:href="https://wiki.freebsd.org/clusteradm/ssh-keys">this article</uri>.
es_es: Para obtener información sobre cómo agregar, cambiar o eliminar <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> keys, see <uri xlink:href="https://wiki.freebsd.org/clusteradm/ssh-keys">Este artículo</uri>.

source: <trademark class="registered">Coverity</trademark> Availability for FreeBSD Committers
es_es: <trademark class="registered">Coverity</trademark> Disponibilidad para Committers FreeBSD

source: All FreeBSD developers can obtain access to <application>Coverity</application> analysis results of all FreeBSD Project software. All who are interested in obtaining access to the analysis results of the automated <application>Coverity</application> runs, can sign up at <uri xlink:href="http://scan.coverity.com/">Coverity Scan</uri>.
es_es: Todos los desarrolladores de FreeBSD pueden obtener acceso a <application>Coverity</application> resultados del análisis de todo el software FreeBSD Project. Todos los que estén interesados en obtener acceso a los resultados del análisis del automatizado <application>Coverity</application> corre, puede registrarse en <uri xlink:href="http://scan.coverity.com/">Coverity Scan</uri>.

source: The FreeBSD wiki includes a mini-guide for developers who are interested in working with the <trademark class="registered">Coverity</trademark> analysis reports: <uri xlink:href="https://wiki.freebsd.org/CoverityPrevent">https://wiki.freebsd.org/CoverityPrevent</uri>. Please note that this mini-guide is only readable by FreeBSD developers, so if you cannot access this page, you will have to ask someone to add you to the appropriate Wiki access list.
es_es: La wiki de FreeBSD incluye una mini-guía para desarrolladores que estén interesados en trabajar con <trademark class="registered">Coverity</trademark> analysis reports: <uri xlink:href="https://wiki.freebsd.org/CoverityPrevent">https://wiki.freebsd.org/CoverityPrevent</uri>. Tenga en cuenta que esta mini-guía solo es legible por los desarrolladores de FreeBSD, por lo que si no puede acceder a esta página, tendrá que pedirle a alguien que lo agregue a la lista de acceso Wiki correspondiente.

source: Finally, all FreeBSD developers who are going to use <trademark class="registered">Coverity</trademark> are always encouraged to ask for more details and usage information, by posting any questions to the mailing list of the FreeBSD developers.
es_es: Finalmente, todos los desarrolladores de FreeBSD que van a usar <trademark class="registered">Coverity</trademark> Siempre se les anima a solicitar más detalles e información de uso, publicando cualquier pregunta en la lista de correo de los desarrolladores de FreeBSD.

source: The FreeBSD Committers' Big List of Rules
es_es: La gran lista de reglas de los Committers de FreeBSD

source: Everyone involved with the FreeBSD project is expected to abide by the <emphasis>Code of Conduct</emphasis> available from <link xlink:href="@@URL_RELPREFIX@@/internal/code-of-conduct.html">https://www.FreeBSD.org/internal/code-of-conduct.html</link>. As committers, you form the public face of the project, and how you behave has a vital impact on the public perception of it. This guide expands on the parts of the <emphasis>Code of Conduct</emphasis> specific to committers.
es_es: Se espera que todos los involucrados en el proyecto FreeBSD cumplan con las <emphasis>Código de Conducta</emphasis> disponible en <link xlink:href="@@URL_RELPREFIX@@/internal/code-of-conduct.html">https://www.FreeBSD.org/internal/code-of-conduct.html</link>. Como comprometidos, ustedes forman la cara pública del proyecto, y su comportamiento tiene un impacto vital en la percepción pública del mismo. Esta guía amplía las partes del <emphasis>Código de Conducta</emphasis> específico para los committers.

source: Respect other committers.
es_es: Respeta a los demás comprometidos.

source: Respect other contributors.
es_es: Respetar a otros contribuyentes.

source: Discuss any significant change <emphasis>before</emphasis> committing.
es_es: Discutir cualquier cambio significativo<emphasis>antes</emphasis> de cometer.

source: Respect existing maintainers (if listed in the <varname>MAINTAINER</varname> field in <filename>Makefile</filename> or in <filename>MAINTAINER</filename> in the top-level directory).
es_es: Respete los mantenedores existentes (si se enumeran en el <varname>MAINTAINER</varname>campo en<filename>Makefile</filename>o en <filename>MAINTAINER</filename> en el directorio de nivel superior).

source: Any disputed change must be backed out pending resolution of the dispute if requested by a maintainer. Security related changes may override a maintainer's wishes at the Security Officer's discretion.
es_es: Cualquier cambio en disputa debe ser anulado en espera de la resolución de la disputa si lo solicita un mantenedor. Los cambios relacionados con la seguridad pueden anular los deseos del mantenedor a discreción del oficial de seguridad.

source: Changes go to FreeBSD-CURRENT before FreeBSD-STABLE unless specifically permitted by the release engineer or unless they are not applicable to FreeBSD-CURRENT. Any non-trivial or non-urgent change which is applicable should also be allowed to sit in FreeBSD-CURRENT for at least 3 days before merging so that it can be given sufficient testing. The release engineer has the same authority over the FreeBSD-STABLE branch as outlined for the maintainer in rule #5.
es_es: Los cambios van a FreeBSD-CURRENT antes de FreeBSD-STABLE a menos que el ingeniero de versiones lo permita específicamente o que no sean aplicables a FreeBSD-CURRENT. Cualquier cambio no trivial o no urgente que sea aplicable también debe permitirse que permanezca en FreeBSD-CURRENT durante al menos 3 días antes de fusionarse para que se puedan realizar las pruebas suficientes. El ingeniero de versiones tiene la misma autoridad sobre la rama FreeBSD-STABLE que se describe para el mantenedor en la regla # 5.

source: Do not fight in public with other committers; it looks bad.
es_es: No luche en público con otros cometer; se ve mal.

source: Respect all code freezes and read the <literal>committers</literal> and <literal>developers</literal> mailing lists in a timely manner so you know when a code freeze is in effect.
es_es: Respete todos los códigos congelados y lea el <literal>committers</literal> y <literal>desarrolladores</literal> listas de correo de manera oportuna para que sepa cuándo está en vigencia una congelación de código.

source: When in doubt on any procedure, ask first!
es_es: En caso de duda sobre cualquier procedimiento, ¡pregunte primero!

source: Test your changes before committing them.
es_es: Pruebe sus cambios antes de realizarlos.

source: Do not commit to contributed software without <emphasis>explicit</emphasis> approval from the respective maintainers.
es_es: No se comprometa con el software contribuido sin <emphasis>explícito</emphasis> aprobación de los respectivos mantenedores.
