Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: Using <application>Postfix</application>
es_es: Usando <application>Postfix</application>

source: To tell a local Postfix instance that anything from <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal> should be forwarded to the FreeBSD.org servers, add this to your <filename>main.cf</filename>:
es_es: Para decirle a una instancia de Postfix local que cualquier cosa desde <literal><replaceable>usuario</replaceable>@FreeBSD.org</literal> debe ser reenviado a los servidores de FreeBSD.org, agregue esto a su <filename>main.cf</filename>:

source: Create <filename>/usr/local/etc/postfix/relayhost_maps</filename> with the following content:
es_es: Crear <filename>/usr/local/etc/postfix/relayhost_maps</filename> con el siguiente contenido:

source: Create <filename>/usr/local/etc/postfix/sasl_passwd</filename> with the following content:
es_es: Crear <filename>/usr/local/etc/postfix/sasl_passwd</filename> con el siguiente contenido:

source: If the email server is used by other people, you may want to prevent them from sending e-mails from your address. To achieve this, add this to your <filename>main.cf</filename>:
es_es: Si otras personas utilizan el servidor de correo electrónico, es posible que desee evitar que envíen correos electrónicos desde su dirección. Para lograr esto, agregue esto a su <filename>main.cf</filename>:

source: Create <filename>/usr/local/etc/postfix/sender_login_maps</filename> with the following content:
es_es: Crear <filename>/usr/local/etc/postfix/sender_login_maps</filename> con el siguiente contenido:

source: Where <replaceable>yourlocalusername</replaceable> is the <acronym>SASL</acronym> username used to connect to the local instance of <application>Postfix</application>.
es_es: Donde <replaceable>yourlocalusername</replaceable> es el <acronym>SASL</acronym> nombre de usuario utilizado para conectarse a la instancia local de <application>Postfix</application>.

source: Mentors
es_es: Mentores

source: All new developers have a mentor assigned to them for the first few months. A mentor is responsible for teaching the mentee the rules and conventions of the project and guiding their first steps in the developer community. The mentor is also personally responsible for the mentee's actions during this initial period.
es_es: Todos los nuevos desarrolladores tienen un mentor asignado durante los primeros meses. Un mentor es responsable de enseñar a los alumnos las reglas y convenciones del proyecto y de guiar sus primeros pasos en la comunidad de desarrolladores. El mentor también es personalmente responsable de las acciones de los aprendices durante este período inicial.

source: For committers: do not commit anything without first getting mentor approval. Document that approval with an <literal>Approved by:</literal> line in the commit message.
es_es: Para los committers: no envíen nada sin obtener primero la aprobación del mentor. Documente esa aprobación con una línea <literal>Aprobado por:</literal> en el mensaje de confirmación.

source: When the mentor decides that a mentee has learned the ropes and is ready to commit on their own, the mentor announces it with a commit to <filename>conf/mentors</filename>. This file is in the <filename>svnadmin</filename> branch of each repository:
es_es: Cuando el mentor decide que un aprendiz ha aprendido las reglas y está listo para hacer envíos por su cuenta, el mentor lo anuncia con un envío de <filename>conf/mentors</filename>. Este archivo está en la rama <filename>svnadmin</filename> de cada repositorio:.

source: New committers should aim to complete enough commits that their mentor is comfortable releasing them from mentorship within the first year. If they are still under mentorship, the appropriate management body (core, doceng, or portmgr) should attempt to ensure that there are no barriers preventing completion. If the committer is unable to satisfy their mentor of readiness by a year and a half their commit bit may be converted to project membership.
es_es: Los nuevos comprometidos deben tener como objetivo completar suficientes compromisos para que su mentor se sienta cómodo librándolos de la tutoría durante el primer año. Si todavía están bajo tutoría, el organismo de gestión apropiado (core, doceng o portmgr) debe intentar asegurarse de que no haya barreras que impidan la finalización. Si el confirmador no puede satisfacer a su mentor de preparación por un año y medio, su bit de compromiso puede convertirse en membresía del proyecto.

source: Pre-Commit Review
es_es: Revisión previa al compromiso

source: Code review is one way to increase the quality of software. The following guidelines apply to commits to the <literal>head</literal> (-CURRENT) branch of the <literal>src</literal> repository. Other branches and the <literal>ports</literal> and <literal>docs</literal> trees have their own review policies, but these guidelines generally apply to commits requiring review:
es_es: La revisión de código es una forma de aumentar la calidad del software. Las siguientes pautas se aplican a los compromisos con <literal>head</literal> (-CURRENT) rama de la <literal>src</literal> repositorio. Otras ramas y el<literal>ports</literal> y <literal>docs</literal> Los árboles tienen sus propias políticas de revisión, pero estas pautas generalmente se aplican a los compromisos que requieren revisión:

source: All non-trivial changes should be reviewed before they are committed to the repository.
es_es: Todos los cambios no triviales deben ser revisados antes de que se envíen al repositorio.

source: Reviews may be conducted by email, in <application>Bugzilla</application>, in <application>Phabricator</application>, or by another mechanism. Where possible, reviews should be public.
es_es: Las revisiones pueden realizarse por correo electrónico, en <application>Bugzilla</application>, en<application>Phabricator</application>, o por otro mecanismo. Siempre que sea posible, las revisiones deben ser públicas.

source: The developer responsible for a code change is also responsible for making all necessary review-related changes.
es_es: El desarrollador responsable de un cambio de código también es responsable de hacer todos los cambios necesarios relacionados con la revisión.

source: Code review can be an iterative process, which continues until the patch is ready to be committed. Specifically, once a patch is sent out for review, it should receive an explicit <quote>looks good</quote> before it is committed. So long as it is explicit, this can take whatever form makes sense for the review method.
es_es: La revisión del código puede ser un proceso iterativo, que continúa hasta que el parche está listo para ser comprometido. Específicamente, una vez que se envía un parche para su revisión, debe recibir una <quote>looks good</quote> antes de que se comprometa. Siempre que sea explícito, esto puede tomar cualquier forma que tenga sentido para el método de revisión.

source: Timeouts are not a substitute for review.
es_es: Los tiempos muertos no sustituyen a la revisión.

source: Sometimes code reviews will take longer than you would hope for, especially for larger features. Accepted ways to speed up review times for your patches are:
es_es: A veces las revisiones de los códigos tardan más de lo que se espera, especialmente para las funciones más grandes. Las formas aceptadas de acelerar los tiempos de revisión de tus parches son:

source: Review other people's patches. If you help out, everybody will be more willing to do the same for you; goodwill is our currency.
es_es: Revisa los parches de otras personas. Si ayudas, todo el mundo estará más dispuesto a hacer lo mismo por ti; la buena voluntad es nuestra moneda.

source: Ping the patch. If it is urgent, provide reasons why it is important to you to get this patch landed and ping it every couple of days. If it is not urgent, the common courtesy ping rate is one week. Remember that you are asking for valuable time from other professional developers.
es_es: Haga ping al parche. Si es urgente, proporcione las razones por las que es importante para usted obtener este parche y hacer ping cada dos días. Si no es urgente, la tasa de ping de cortesía común es de una semana. Recuerde que está pidiendo un tiempo valioso a otros desarrolladores profesionales.

source: Ask for help on mailing lists, IRC, etc. Others may be able to either help you directly, or suggest a reviewer.
es_es: Pida ayuda en las listas de correo, IRC, etc. Otros pueden ayudarle directamente o sugerirle un revisor.

source: Split your patch into multiple smaller patches that build on each other. The smaller your patch, the higher the probability that somebody will take a quick look at it.
es_es: Divide tu parche en múltiples parches más pequeños que se construyen uno sobre otro. Cuanto más pequeño sea tu parche, mayor es la probabilidad de que alguien le eche un vistazo rápido.

source: When making large changes, it is helpful to keep this in mind from the beginning of the effort as breaking large changes into smaller ones is often difficult after the fact.
es_es: Cuando se hacen grandes cambios, es útil tenerlo en cuenta desde el principio del proyecto, ya que dividir los grandes cambios en otros más pequeños suele ser difícil después del hecho.

source: Developers should participate in code reviews as both reviewers and reviewees. If someone is kind enough to review your code, you should return the favor for someone else. Note that while anyone is welcome to review and give feedback on a patch, only an appropriate subject-matter expert can approve a change. This will usually be a committer who works with the code in question on a regular basis.
es_es: Los desarrolladores deben participar en las revisiones de código como revisores y revisados. Si alguien tiene la amabilidad de revisar tu código, deberías devolverle el favor a otra persona. Ten en cuenta que aunque cualquiera es bienvenido a revisar y dar su opinión sobre un parche, sólo un experto en la materia puede aprobar un cambio. Normalmente será un especialista que trabaje con el código en cuestión de forma regular.

source: In some cases, no subject-matter expert may be available. In those cases, a review by an experienced developer is sufficient when coupled with appropriate testing.
es_es: En algunos casos, es posible que no se disponga de un experto en la materia. En esos casos, basta con un examen por parte de un desarrollador experimentado cuando se combina con las pruebas apropiadas.

source: Commit Log Messages
es_es: Mensajes de Registro de Envíos

source: This section contains some suggestions and traditions for how commit logs are formatted.
es_es: Esta sección contiene algunas sugerencias y tradiciones sobre cómo se formatean los registros de envíos.

source: As well as including an informative message with each commit, some additional information may be needed.
es_es: Además de incluir un mensaje informativo con cada envío, es posible que se necesite información adicional.

source: This information consists of one or more lines containing the key word or phrase, a colon, tabs for formatting, and then the additional information.
es_es: Esta información consta de una o más líneas que contienen la palabra o frase clave, dos puntos, pestañas para formatear y, a continuación, la información adicional.

source: The key words or phrases are:
es_es: Las palabras o frases clave son:

source: The problem report (if any) which is affected (typically, by being closed) by this commit. Multiple PRs may be specified on one line, separated by commas or spaces.
es_es: El informe del problema (si lo hay) que se ve afectado (normalmente, por estar cerrado) por este envío. Se pueden especificar varias PRs en una línea, separadas por comas o espacios.

source: <literal>Submitted by:</literal>
es_es: <literal>Enviado por:</literal>

source: The name and e-mail address of the person that submitted the fix; for developers, just the username on the FreeBSD cluster.
es_es: El nombre y la dirección de correo electrónico de la persona que envió el parche; para los desarrolladores, sólo el nombre de usuario en el clúster de FreeBSD.

source: If the submitter is the maintainer of the port being committed, include "(maintainer)" after the email address.
es_es: Si el remitente es el encargado de mantener el puerto al que se están haciendo los envíos, incluya "(mantainer)" después de la dirección de correo electrónico.

source: Avoid obfuscating the email address of the submitter as this adds additional work when searching logs.
es_es: Evite confundir la dirección de correo electrónico del remitente, ya que esto añade trabajo adicional al buscar en los registros.

source: <literal>Reviewed by:</literal>
es_es: <literal>Revisado por:</literal>

source: The name and e-mail address of the person or people that reviewed the change; for developers, just the username on the FreeBSD cluster. If a patch was submitted to a mailing list for review, and the review was favorable, then just include the list name.
es_es: El nombre y la dirección de correo electrónico de la persona o personas que revisaron el cambio; para los desarrolladores, sólo el nombre de usuario en el clúster de FreeBSD. Si se envió un parche a una lista de correo para su revisión, y la revisión fue favorable, entonces sólo incluya el nombre de la lista.

source: <literal>Approved by:</literal>
es_es: <literal>Aprobado por:</literal>

source: The name and e-mail address of the person or people that approved the change; for developers, just the username on the FreeBSD cluster. It is customary to get prior approval for a commit if it is to an area of the tree to which you do not usually commit. In addition, during the run up to a new release all commits <emphasis>must</emphasis> be approved by the release engineering team.
es_es: El nombre y la dirección de correo electrónico de la persona o personas que aprobaron el cambio; para los desarrolladores, solo el nombre de usuario en el clúster de FreeBSD. Es habitual obtener una aprobación previa para una confirmación si se trata de un área del árbol en la que normalmente no se compromete. Además, durante el período previo a una nueva versión, todas las confirmaciones <emphasis>debe</emphasis> ser aprobado por el equipo de ingeniería de versiones.

source: While under mentorship, get mentor approval before the commit. Enter the mentor's username in this field, and note that they are a mentor:
es_es: Mientras esté bajo la supervisión de un mentor, consiga la aprobación de éste antes de comprometerse. Ingrese el nombre de usuario del mentor en este campo, y note que es un mentor:

source: Approved by: <userinput><replaceable>username-of-mentor</replaceable> <literal>(mentor)</literal></userinput>
es_es: Aprobado por: <userinput><replaceable>nombre de usuario del mentor</replaceable>.<literal>(mentor)</literal></userinput>

source: If a team approved these commits then include the team name followed by the username of the approver in parentheses. For example:
es_es: Si un equipo aprobó estos compromisos, entonces incluye el nombre del equipo seguido del nombre de usuario del que lo aprobó entre paréntesis. Por ejemplo:

source: Approved by: <userinput><literal>re</literal> (<replaceable>username</replaceable>)</userinput>
es_es: Aprobado por: <userinput><literal>re</literal> (<replaceable>username</replaceable>)</userinput>

source: <literal>Obtained from:</literal>
es_es: <literal>Obtenido de:</literal>

source: The name of the project (if any) from which the code was obtained. Do not use this line for the name of an individual person.
es_es: El nombre del proyecto (si lo hay) del que se obtuvo el código. No utilice esta línea para el nombre de una persona individual.

source: <literal>Sponsored by:</literal>
es_es: <literal>Patrocinado por:</literal>

source: Sponsoring organizations for this change, if any. Separate multiple organizations with commas. If only a portion of the work was sponsored, or different amounts of sponsorship were provided to different authors, please give appropriate credit in parentheses after each sponsor name. For example, <literal>Example.com (alice, code refactoring), Wormulon (bob), Momcorp (cindy)</literal> shows that Alice was sponsored by Example.com to do code refactoring, while Wormulon sponsored Bob's work and Momcorp sponsored Cindy's work. Other authors were either not sponsored or chose not to list sponsorship.
es_es: Organizaciones patrocinadoras de este cambio, si las hubiera. Separe varias organizaciones con comas. Si solo se patrocinó una parte del trabajo, o se proporcionaron diferentes cantidades de patrocinio a diferentes autores, dé el crédito correspondiente entre paréntesis después del nombre de cada patrocinador. Por ejemplo, <literal>Example.com (alice, refactorización de código), Wormulon (bob), Momcorp (cindy)</literal> muestra que Alice fue patrocinada por Example.com para hacer la refactorización de código, mientras que Wormulon patrocinó el trabajo de Bob y Momcorp patrocinó el trabajo de Cindy. Otros autores no recibieron patrocinio o optaron por no incluir el patrocinio.

source: <literal>MFC after:</literal>
es_es: <literal>MFC después:</literal>

source: To receive an e-mail reminder to <acronym>MFC</acronym> at a later date, specify the number of days, weeks, or months after which an <acronym>MFC</acronym> is planned.
es_es: Para recibir un recordatorio por correo electrónico <acronym>MFC</acronym> en una fecha posterior, especifique el número de días, semanas o meses después del cual <acronym>MFC</acronym> es planeado.

source: If the commit should be merged to a subset of stable branches, specify the branch names.
es_es: Si la confirmación debe fusionarse con un subconjunto de ramas estables, especifique los nombres de las ramas.

source: <literal>MFC with:</literal>
es_es: <literal>MFC con:</literal>

source: If the commit should be merged together with a previous one in a single <acronym>MFC</acronym> commit (for example, where this commit corrects a bug in the previous change), specify the corresponding revision number.
es_es: Si el compromiso debe fusionarse con uno anterior en un solo <acronym>MFC</acronym> commit (por ejemplo, donde este commit corrige un error en el cambio anterior), especifique el número de revisión correspondiente.

source: If the change is a candidate for inclusion in the release notes for the next release from the branch, set to <literal>yes</literal>.
es_es: Si el cambio es un candidato para su inclusión en las notas de la versión para la próxima versión de la rama, establézcalo en <literal>si</literal>.

source: <literal>Security:</literal>
es_es: <literal>Seguridad:</literal>

source: If the change is related to a security vulnerability or security exposure, include one or more references or a description of the issue. If possible, include a VuXML URL or a CVE ID.
es_es: Si el cambio está relacionado con una vulnerabilidad de seguridad o una exposición a la seguridad, incluya una o más referencias o una descripción de la cuestión. Si es posible, incluya una URL de VuXML o un ID de CVE.

source: The description for the event where this commit was made. If this is a recurring event, add the year or even the month to it. For example, this could be <literal>FooBSDcon 2019</literal>. The idea behind this line is to put recognition to conferences, gatherings, and other types of meetups and to show that these are useful to have. Please do not use the <literal>Sponsored by:</literal> line for this as that is meant for organizations sponsoring certain features or developers working on them.
es_es: La descripción del evento en el que se realizó esta confirmación. Si se trata de un evento recurrente, agregue el año o incluso el mes. Por ejemplo, esto podría ser <literal>FooBSDcon 2019</literal>. la idea detrás de esta línea es dar reconocimiento a conferencias, tertulias y otros tipos de encuentros y demostrar que es útil tenerlos. No utilice el<literal>Patrocinado por:</literal> para esto, ya que está destinado a organizaciones que patrocinan ciertas funciones o desarrolladores que trabajan en ellas.

source: The full URL of the Phabricator review. This line <emphasis>must be the last line</emphasis>. For example: <literal>https://reviews.freebsd.org/D1708</literal>.
es_es: La URL completa de la revisión de Phabricator. Esta línea <emphasis>debe ser la última línea</emphasis>. Por ejemplo:<literal>https://reviews.freebsd.org/D1708</literal>.

source: Commit Log for a Commit Based on a PR
es_es: Registro de compromiso para un compromiso basado en un PR

source: The commit is based on a patch from a PR submitted by John Smith. The commit message <quote>PR</quote> and <quote>Submitted by</quote> fields are filled..
es_es: La confirmación se basa en un parche de un PR enviado por John Smith. El mensaje de confirmación <quote>PR</quote> y <quote>Presentado por</quote> los campos están llenos ..

source: Commit Log for a Commit Needing Review
es_es: Confirmar registro para una confirmación que necesita revisión

source: The virtual memory system is being changed. After posting patches to the appropriate mailing list (in this case, <literal>freebsd-arch</literal>) and the changes have been approved.
es_es: Se está cambiando el sistema de memoria virtual. Después de publicar los parches en la lista de correo correspondiente (en este caso, <literal>freebsd-arch</literal>) y los cambios han sido aprobados.

source: Commit Log for a Commit Needing Approval
es_es: Registro de compromiso para un compromiso que necesita aprobación

source: Commit a port, after working with the listed MAINTAINER, who said to go ahead and commit.
es_es: Confirmar un puerto, después de trabajar con el MAINTAINER enumerado, quien dijo seguir adelante y comprometerse.

source: Where <replaceable>abc</replaceable> is the account name of the person who approved.
es_es: Donde <replaceable>abc</replaceable> es el nombre de la cuenta de la persona que aprobó.

source: Commit Log for a Commit Bringing in Code from OpenBSD
es_es: Commit Log para una confirmación que trae código desde OpenBSD

source: Committing some code based on work done in the OpenBSD project.
es_es: Confirmar código basado en el trabajo realizado en el proyecto OpenBSD.

source: Commit Log for a Change to FreeBSD-CURRENT with a Planned Commit to FreeBSD-STABLE to Follow at a Later Date.
es_es: Commit Log para un cambio en FreeBSD-CURRENT con un compromiso planificado en FreeBSD-STABLE para seguir en una fecha posterior.

source: Committing some code which will be merged from FreeBSD-CURRENT into the FreeBSD-STABLE branch after two weeks.
es_es: Confirmando un código que se fusionará de FreeBSD-CURRENT en la rama FreeBSD-STABLE después de dos semanas.

source: Where <replaceable>2</replaceable> is the number of days, weeks, or months after which an <acronym>MFC</acronym> is planned. The <replaceable>weeks</replaceable> option may be <literal>day</literal>, <literal>days</literal>, <literal>week</literal>, <literal>weeks</literal>, <literal>month</literal>, <literal>months</literal>.
es_es: Donde <replaceable>2</replaceable> es el número de días, semanas o meses después de los cuales <acronym>MFC</acronym> esta planeado. los<replaceable>semanas</replaceable> la opción puede ser<literal>dia</literal>,<literal>dias</literal>,<literal>semana</literal>,<literal>semanas</literal>,<literal>mes</literal>,<literal>meses</literal>.

source: It is often necessary to combine these.
es_es: A menudo es necesario combinarlos.
