Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: The <literal>propdel</literal> bit is necessary because starting with 1.5, Subversion will automatically add <literal>svn:mergeinfo</literal> to any directory that is copied or moved. In this case, as nothing is being merged from the deleted tree, they just get in the way.
es_es: El bit <literal>propdel</literal> es necesario porque comenzando con 1.5, Subversion se añade automáticamente <literal>svn:mergeinfo</literal> a cualquier directorio que se copie o mueva. En este caso, como no se está fusionando nada del árbol eliminado, simplemente es un estorbo.

source: Tags may be flattened as well (3, 4, 3.5 etc.); the procedure is exactly the same, only changing <literal>dist</literal> to <literal>3.5</literal> or similar, and putting the <command>svn commit</command> off until the end of the process.
es_es: Las etiquetas también pueden ser aplanadas (3, 4, 3.5 etc.); el procedimiento es exactamente el mismo, sólo cambiando <literal>dist</literal> a <literal>3.5</literal> o similar, y posponiendo el <command>svn commit</command> hasta el final del proceso.

source: Cleaning Up
es_es: Limpieza

source: The <literal>dist</literal> tree can be cleaned up as necessary. Disabling keyword expansion is recommended, as it makes no sense on unmodified vendor code and in some cases it can even be harmful. <application>OpenSSH</application>, for example, includes two files that originated with FreeBSD and still contain the original version tags. To do this:
es_es: El árbol <literal>dist</literal> puede ser limpiado según sea necesario. Se recomienda desactivar la expansión de palabras clave, ya que no tiene sentido en el código de vendor que no se ha modificado y en algunos casos puede incluso ser perjudicial. <application>OpenSSH</application>, por ejemplo, incluye dos ficheros que se originaron en FreeBSD y que aún contienen las etiquetas de la versión original. Para hacer esto:

source: Bootstrapping Merge History
es_es: Iniciando el Historial de Fusiones

source: If importing for the first time after the switch to Subversion, bootstrap <literal>svn:mergeinfo</literal> on the target directory in the main tree to the revision that corresponds to the last related change to the vendor tree, prior to importing new sources:
es_es: Si se importa por primera vez después del cambio a Subversion, inicie <literal>svn:mergeinfo</literal> en el directorio de destino en el árbol principal la revisión que corresponde al último cambio relacionado con el árbol de vendor, antes de importar nuevas fuentes:

source: Importing New Sources
es_es: Importar nuevas fuentes

source: With two commits—one for the import itself and one for the tag—this step can optionally be repeated for every upstream release between the last import and the current import.
es_es: Con dos envíos, uno para la importación en sí y otro para la etiqueta, este paso puede repetirse opcionalmente para cada versión anterior entre la última importación y la importación actual.

source: Preparing the Vendor Sources
es_es: Preparar las Fuentes de Vendor

source: Subversion is able to store a full distribution in the vendor tree. So, import everything, but merge only what is required.
es_es: Subversion es capaz de almacenar una distribución completa en el árbol de vendor. Por lo tanto, importe todo, pero fusione sólo lo que sea necesario.

source: A <command>svn add</command> is required to add any files that were added since the last vendor import, and <command>svn rm</command> is required to remove any that were removed since. Preparing sorted lists of the contents of the vendor tree and of the sources that are about to be imported is recommended, to facilitate the process.
es_es: Se requiere un <command>svn add</command> para añadir cualquier archivo que se haya añadido desde la última importación de vendor, y un <command>svn rm</command> para eliminar cualquier archivo que se haya eliminado desde entonces. Se recomienda preparar listas clasificadas del contenido del árbol de vendor y de las fuentes que se van a importar para facilitar el proceso.

source: With these two files, <command>comm -23 ../old ../new</command> will list removed files (files only in <filename>old</filename>), while <command>comm -13 ../old ../new</command> will list added files only in <filename>new</filename>.
es_es: Con estos dos archivos, <command>comm -23 ../old ../new</command> listará los archivos eliminados (archivos sólo en <filename>old</filename>), mientras que <command>comm -13 ../old ../new</command> listará los archivos añadidos sólo en <filename>new</filename>.

source: Importing into the Vendor Tree
es_es: Importación al Árbol Vendor

source: Now, the sources must be copied into <filename><replaceable>dist</replaceable></filename> and the <command>svn add</command> and <command>svn rm</command> commands are used as needed:
es_es: Ahora, las fuentes deben copiarse en <filename><replaceable>dist</replaceable></filename> y los comandos <command>svn add</command> y <command>svn rm</command> se utilizan según sea necesario:

source: If any directories were removed, they will have to be <command>svn rm</command>ed manually. Nothing will break if they are not, but they will remain in the tree.
es_es: Si se ha eliminado algún directorio, <command>svn rm</command> tendrá que ser editado manualmente. Nada se romperá si no se hace, pero permanecerán en el árbol.

source: Check properties on any new files. All text files should have <literal>svn:eol-style</literal> set to <literal>native</literal>. All binary files should have <literal>svn:mime-type</literal> set to <literal>application/octet-stream</literal> unless there is a more appropriate media type. Executable files should have <literal>svn:executable</literal> set to <literal>*</literal>. No other properties should exist on any file in the tree.
es_es: Compruebe las propiedades de cualquier archivo nuevo. Todos los archivos de texto deben tener <literal>svn:eol-style</literal> establecido en <literal>native</literal>. Todos los archivos binarios deben tener <literal>svn:mime-type</literal> ajustado a <literal>application/octet-stream</literal> a menos que exista un tipo de medio más apropiado. Los archivos ejecutables deben tener <literal>svn:ejecutable</literal> establecido en <literal>*</literal>. No debe existir ninguna otra propiedad en ningún archivo del árbol.

source: Committing is now possible. However, it is good practice to make sure that everything is okay by using the <command>svn stat</command> and <command>svn diff</command> commands.
es_es: Ahora es posible el envio. Sin embargo, es una buena práctica asegurarse de que todo está bien usando los comandos <command>svn stat</command> y <command>svn diff</command>.

source: Tagging
es_es: Etiquetado

source: Once committed, vendor releases are tagged for future reference. The best and quickest way to do this is directly in the repository:
es_es: Una vez hecho el envío, las versiones de vendor se etiquetan para referencia futura. La mejor y más rápida manera de hacerlo es directamente en el repositorio:

source: Once that is complete, <command>svn up</command> the working copy of <filename><replaceable>vendor/pf</replaceable></filename> to get the new tag, although this is rarely needed.
es_es: Una vez completado esto, haga <command>svn up</command> a la copia de trabajo de <filename><replaceable>vendor/pf</replaceable></filename> para obtener la nueva etiqueta, aunque esto rara vez es necesario.

source: If creating the tag in the working copy of the tree, <command>svn:mergeinfo</command> results must be removed:
es_es: Si crea la etiqueta en la copia de trabajo del árbol, debe eliminar los resultados de <command>svn:mergeinfo</command>:

source: Merging to Head
es_es: Fusión con Head

source: The <literal>--accept=postpone</literal> tells Subversion not to complain about merge conflicts as they will be handled manually.
es_es: El <literal>--accept=postpone</literal> le dice a Subversion que no se queje de los conflictos de fusión ya que serán manejados manualmente.

source: The <command>cvs2svn</command> changeover occurred on June 3, 2008. When performing vendor merges for packages which were already present and converted by the <command>cvs2svn</command> process, the command used to merge <filename>/vendor/<replaceable>package_name</replaceable>/dist</filename> to <filename>/head/<replaceable>package_location</replaceable></filename> (for example, <filename>head/contrib/sendmail</filename>) must use <option>-c <replaceable>REV</replaceable></option> to indicate the revision to merge from the <filename>/vendor</filename> tree. For example:
es_es: El cambio <command>cvs2svn</command> tuvo lugar el 3 de junio de 2008. Al realizar fusiones de vender para paquetes que ya estaban presentes y convertidos por el proceso <command>cvs2svn</command>, el comando usado para fusionar <filename>/vendedor/<replaceable>nombre_de_paquete</replaceable>/dist</filename> a <filename>/head/<replaceable>localización_de_paquete</replaceable></filename> (por ejemplo, <filename>head/contrib/sendmail</filename>) debe usar <option>-c <replaceable>REV</replaceable></option> para indicar la revisión para fusionar desde el árbol <filename>/vendor</filename>. Por ejemplo:

source: <literal>^</literal> is an alias for the repository path.
es_es: <literal>^</literal> es un alias para la ruta del repositorio.

source: If using the <application>Zsh</application> shell, the <literal>^</literal> must be escaped with <literal>\</literal> or quoted.
es_es: Si se utiliza el shell <application>Zsh</application>, el <literal>^</literal> debe ser evitado con <literal>\</literal> o ser entrecomillado.

source: It is necessary to resolve any merge conflicts.
es_es: Es necesario resolver cualquier conflicto de fusión.

source: Make sure that any files that were added or removed in the vendor tree have been properly added or removed in the main tree. To check diffs against the vendor branch:
es_es: Asegúrese de que todos los archivos que se hayan añadido o eliminado en el árbol de vendor se hayan añadido o eliminado correctamente en el árbol principal. Para verificar las diferencias con la rama de vendor:

source: The <literal>--no-diff-deleted</literal> tells Subversion not to complain about files that are in the vendor tree but not in the main tree. Things that would have previously been removed before the vendor import, like the vendor's makefiles and configure scripts.
es_es: El <literal>--no-diff-deleted</literal> le dice a Subversion que no se queje de ficheros que están en el árbol de vendor pero no en el árbol principal. Cosas que previamente se habrían eliminado antes de la importación de vendor, como los makefiles de vendor y los scripts de configuración.

source: Using <acronym>CVS</acronym>, once a file was off the vendor branch, it was not able to be put back. With Subversion, there is no concept of on or off the vendor branch. If a file that previously had local modifications, to make it not show up in diffs in the vendor tree, all that has to be done is remove any left-over cruft like FreeBSD version tags, which is much easier.
es_es: Usando <acronym>CVS</acronym>, una vez que un archivo estaba fuera de la rama de vendor, no se podía volver a reestablecer. Con Subversion, no hay ningún concepto de dentro o fuera de la rama de vendor. Si un fichero que antes tenía modificaciones locales, para que no aparezca en diffs en el árbol de vendor, todo lo que hay que hacer es eliminar cualquier cruft sobrante como las etiquetas de la versión de FreeBSD, lo que es mucho más fácil.

source: If any changes are required for the world to build with the new sources, make them now, and keep testing until everything builds and runs perfectly.
es_es: Si se requiere algún cambio para que el mundo construya con las nuevas fuentes, hágalo ahora y siga probando hasta que todo se construya y funcione perfectamente.

source: Committing the Vendor Import
es_es: Enviando la importación de vendor

source: Committing is now possible! Everything must be committed in one go. If done properly, the tree will move from a consistent state with old code, to a consistent state with new code.
es_es: Ahora es posible hacer el envío! Todo debe ser enviado de una sola vez. Si se hace correctamente, el árbol pasará de un estado consistente con el código antiguo a un estado consistente con el nuevo código.

source: From Scratch
es_es: Desde el principio

source: This section is an example of importing and tagging <application>byacc</application> into <filename>head</filename>.
es_es: Esta sección es un ejemplo de importación y etiquetado de <application>byacc</application> en <filename>head</filename>.

source: First, prepare the directory in <filename>vendor</filename>:
es_es: Primero, prepare el directorio en <filename>vendor</filename>:

source: Now, import the sources into the <filename>dist</filename> directory. Once the files are in place, <command>svn add</command> the new ones, then <command>svn commit</command> and tag the imported version. To save time and bandwidth, direct remote committing and tagging is possible:
es_es: Ahora, importe las fuentes en el directorio <filename>dist</filename>. Una vez que los archivos están en su lugar, <command>svn add</command> los nuevos, luego <command>svn commit</command> y etiquete la versión importada. Para ahorrar tiempo y ancho de banda, es posible el envío y etiquetado remoto directo.

source: Merging to <literal>head</literal>
es_es: Fusión con <literal>head</literal>

source: Due to this being a new file, copy it for the merge:
es_es: Debido a que se trata de un nuevo archivo, cópielo para la fusión:

source: Working normally on newly imported sources is still possible.
es_es: Todavía es posible trabajar normalmente con fuentes recientemente importadas.

source: Reverting a Commit
es_es: Anulación de un envío

source: Reverting a commit to a previous version is fairly easy:
es_es: Revertir un envío a una versión anterior es bastante fácil:

source: Change number syntax, with negative meaning a reverse change, can also be used:
es_es: También se puede utilizar la sintaxis del cambio de número, significando un número negativo una reversión:

source: This can also be done directly in the repository:
es_es: Esto también se puede hacer directamente en el repositorio:

source: It is important to ensure that the mergeinfo is correct when reverting a file to permit <command>svn mergeinfo --eligible</command> to work as expected.
es_es: Es importante asegurarse de que el mergeinfo es correcto al revertir un archivo para permitir que <command>svn mergeinfo --elegible</command> funcione como se espera.

source: Reverting the deletion of a file is slightly different. Copying the version of the file that predates the deletion is required. For example, to restore a file that was deleted in revision N, restore version N-1:
es_es: Revertir la eliminación de un archivo es ligeramente diferente. Es necesario copiar la versión del fichero anterior al borrado. Por ejemplo, para restaurar un fichero borrado en la revisión N, restaurar la versión N-1:

source: or, equally:
es_es: o, igualmente:

source: Fixing Mistakes
es_es: Corrección de errores

source: While we can do surgery in an emergency, do not plan on having mistakes fixed behind the scenes. Plan on mistakes remaining in the logs forever. Be sure to check the output of <command>svn status</command> and <command>svn diff</command> before committing.
es_es: Aunque podemos hacer cirugía en una emergencia, no planee arreglar errores entre bastidores. Planee que los errores permanezcan en los registros para siempre. Asegúrese de comprobar la salida de <command>svn status</command> y <command>svn diff</command> antes de enviar.

source: Mistakes will happen but, they can generally be fixed without disruption.
es_es: Los errores ocurrirán pero, por lo general, pueden ser corregidos sin perturbaciones.

source: Take a case of adding a file in the wrong location. The right thing to do is to <command>svn move</command> the file to the correct location and commit. This causes just a couple of lines of metadata in the repository journal, and the logs are all linked up correctly.
es_es: Tome por caso añadir un archivo en la ubicación equivocada. Lo correcto es <command>svn move</command> el archivo a la ubicación correcta y confirmarlo. Esto causa sólo un par de líneas de metadatos en el diario del repositorio, y los registros están todos conectados correctamente.

source: The wrong thing to do is to delete the file and then <command>svn add</command> an independent copy in the correct location. Instead of a couple of lines of text, the repository journal grows an entire new copy of the file. This is a waste.
es_es: Lo incorrecto es borrar el archivo y luego <command>svn add</command> una copia independiente en la ubicación correcta. En lugar de un par de líneas de texto, el diario del repositorio hace crecer una nueva copia completa del archivo. Esto es un desperdicio.

source: Using a Subversion Mirror
es_es: Usando un Espejo de Subversion

source: Checkout from a Mirror
es_es: Comprobar desde un Espejo

source: Check out a working copy from a mirror by substituting the mirror's <acronym>URL</acronym> for <literal>svn+ssh://repo.freebsd.org/base</literal>. This can be an official mirror or a mirror maintained by using <command>svnsync</command>.
es_es: Compruebe una copia de trabajo desde una réplica sustituyendo <acronym>URL</acronym> por <literal>svn+ssh://repo.freebsd.org/base</literal>. Puede ser una réplica oficial o una réplica mantenida mediante el uso de <command>svnsync</command>.

source: Setting up a <application>svnsync</application> Mirror
es_es: Configuración de una Réplica <application>svnsync</application>.

source: Avoid setting up a <application>svnsync</application> mirror unless there is a very good reason for it. Most of the time a <command>git</command> mirror is a better alternative. Starting a fresh mirror from scratch takes a long time. Expect a minimum of 10 hours for high speed connectivity. If international links are involved, expect this to take four to ten times longer.
es_es: Evite configurar una réplica <application>svnsync</application> a menos que haya una buena razón para ello. La mayoría de las veces una réplica <command>git</command> es una alternativa mejor. Comenzar una réplica nueva desde cero lleva mucho tiempo. Se espera un mínimo de 10 horas para la conectividad de alta velocidad. Si se trata de enlaces internacionales, es de esperar que esto lleve entre cuatro y diez veces más tiempo.

source: One way to limit the time required is to grab a <link xlink:href="https://download.freebsd.org/ftp/development/subversion/">seed file</link>. It is large (~1GB) but will consume less network traffic and take less time to fetch than svnsync will.
es_es: Una forma de limitar el tiempo requerido es tomar un <link xlink:href="https://download.freebsd.org/ftp/development/subversion/">archivo semilla</link>. Es grande (~1GB) pero consumirá menos tráfico de red y tardará menos tiempo en obtenerlo que svnsync.

source: Extract the file and update it:
es_es: Extraiga el archivo y actualícelo:

source: Now, set that up to run from <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, do checkouts locally, set up a svnserve server for local machines to talk to, etc.
es_es: Ahora, configúrelo para que se ejecute desde <citerefentry><refentrytitle>cron</refentrytitle><manvolnum>8</manvolnum></citerefentry>, realice las comprobaciones localmente, configure un servidor svnserve para que las máquinas locales puedan hablar con él, etc.

source: The seed mirror is set to fetch from <literal>svn://svn.freebsd.org/base</literal>. The configuration for the mirror is stored in <literal>revprop 0</literal> on the local mirror. To see the configuration, try:
es_es: La réplica semilla está configurada para obtener desde <literal>svn://svn.freebsd.org/base</literal>. La configuración de la réplica se guarda en <literal>revprop 0</literal> en la réplica local. Para ver la configuración, intente:

source: Use <literal>svn propset</literal> to change things.
es_es: Use <literal>svn propset</literal> para cambiar cosas.

source: Committing High-<acronym>ASCII</acronym> Data
es_es: Enviando Datos High-<acronym>ASCII</acronym>.

source: Files that have high-<acronym>ASCII</acronym> bits are considered binary files in <acronym>SVN</acronym>, so the pre-commit checks fail and indicate that the <literal>mime-type</literal> property should be set to <literal>application/octet-stream</literal>. However, the use of this is discouraged, so please do not set it. The best way is always avoiding high-<acronym>ASCII</acronym> data, so that it can be read everywhere with any text editor but if it is not avoidable, instead of changing the mime-type, set the <literal>fbsd:notbinary</literal> property with <literal>propset</literal>:
es_es: Los archivos que tienen bits <acronym>ASCII</acronym>-high se consideran archivos binarios en <acronym>SVN</acronym>, por lo que las comprobaciones previas fallan e indican que la propiedad <literal>mime-type</literal> debe configurarse a <literal>application/octet-stream</literal>. Sin embargo, se desaconseja el uso de esta opción, así que por favor no la configure. La mejor manera es siempre evitar los datos de <acronym>ASCII</acronym>-high, para que pueda ser leído en cualquier lugar con cualquier editor de texto, pero si no es posible evitarlo, en lugar de cambiar el tipo mime, establezca la propiedad <literal>fbsd:notbinary</literal> con <literal>propset</literal>:

source: Maintaining a Project Branch
es_es: Mantenimiento de una Rama del Proyecto

source: A project branch is one that is synced to head (or another branch) is used to develop a project then commit it back to head. In <acronym>SVN</acronym>, <quote>dolphin</quote> branching is used for this. A <quote>dolphin</quote> branch is one that diverges for a while and is finally committed back to the original branch. During development code migration in one direction (from head to the branch only). No code is committed back to head until the end. After the branch is committed back at the end, it is dead (although a new branch with the same name can be created after the dead one is deleted).
es_es: Una rama del proyecto es aquella que está sincronizada con head (u otra rama) y se utiliza para desarrollar un proyecto y luego volver a enviarlo a la head. En <acronym>SVN</acronym>, <quote>dolphin</quote> se utiliza para esto. Una rama <quote>dolphin</quote> es aquella que se diverge por un tiempo y finalmente se vuelve a enviar a la rama original. Durante el desarollo es código migra en una dirección (de la cabecera a la rama solamente). Ningún código es enviado de nuevo a head hasta el final. Una vez enviada la rama, está muerta (aunque se puede crear una nueva rama con el mismo nombre después de que se haya eliminado la rama muerta).
