Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: When this is done, go back to step 6 saying the fallout was fixed and wait for the exp-run to be run again. Repeat as long as there are broken ports.
es_es: Una vez hecho esto, vuelva al paso 6 y diga que las consecuencias se han solucionado y espere a que se vuelva a ejecutar el exp-run. Repita mientras haya puertos rotos.

source: Issues Specific to Developers Who Are Not Committers
es_es: Problemas específicos para desarrolladores que no son comprometidos

source: A few people who have access to the FreeBSD machines do not have commit bits. Almost all of this document will apply to these developers as well (except things specific to commits and the mailing list memberships that go with them). In particular, we recommend that you read:
es_es: Algunas personas que tienen acceso a las máquinas FreeBSD no tienen bits de confirmación. Casi todo este documento también se aplicará a estos desarrolladores (excepto los aspectos específicos de las confirmaciones y las membresías de la lista de correo que las acompañan). En particular, le recomendamos que lea:

source: <link linkend="admin">Administrative Details</link>
es_es: <link linkend="admin">Detalles administrativos</link>

source: <link linkend="conventions-everyone">Conventions</link>
es_es: <link linkend="conventions-everyone">Convenciones</link>

source: Get your mentor to add you to the <quote>Additional Contributors</quote> (<filename>doc/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename>), if you are not already listed there.
es_es: Consigue que tu mentor te agregue a la <quote>Colaboradores adicionales</quote> (<filename>doc/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename>), si aún no está en la lista.

source: <link linkend="developer.relations">Developer Relations</link>
es_es: <link linkend="developer.relations">Relaciones con el desarrollador</link>

source: <link linkend="ssh.guide">SSH Quick-Start Guide</link>
es_es: <link linkend="ssh.guide">Guía de inicio rápido de SSH</link>

source: <link linkend="rules">The FreeBSD Committers' Big List of Rules</link>
es_es: <link linkend="rules"> La gran lista de reglas de los Committers de FreeBSD</link>

source: Information About Google Analytics
es_es: Información sobre Google Analytics

source: As of December 12, 2012, Google Analytics was enabled on the FreeBSD Project website to collect anonymized usage statistics regarding usage of the site. The information collected is valuable to the FreeBSD Documentation Project, to identify various problems on the FreeBSD website.
es_es: A partir del 12 de diciembre de 2012, se habilitó Google Analytics en el sitio web del Proyecto FreeBSD para recopilar estadísticas de uso anónimas con respecto al uso del sitio. La información recopilada es valiosa para el Proyecto de documentación de FreeBSD, para identificar varios problemas en el sitio web de FreeBSD.

source: Google Analytics General Policy
es_es: Política general de Google Analytics

source: The FreeBSD Project takes visitor privacy very seriously. As such, the FreeBSD Project website honors the <quote>Do Not Track</quote> header <emphasis>before</emphasis> fetching the tracking code from Google. For more information, please see the <link xlink:href="https://www.FreeBSD.org/privacy.html">FreeBSD Privacy Policy</link>.
es_es: El Proyecto FreeBSD se toma muy en serio la privacidad de los visitantes. Como tal, el sitio web del Proyecto FreeBSD honra la <quote>No rastrear</quote> header <emphasis>before</emphasis> obteniendo el código de seguimiento de Google. Para obtener más información, consulte el <link xlink:href="https://www.FreeBSD.org/privacy.html">Política de privacidad de FreeBSD</link>.

source: Google Analytics access is <emphasis>not</emphasis> arbitrarily allowed — access must be requested, voted on by the Documentation Engineering Team <email>doceng@FreeBSD.org</email>, and explicitly granted.
es_es: El acceso a Google Analytics es <emphasis>no</emphasis>Permitido arbitrariamente: el acceso debe ser solicitado, votado por el Equipo de Ingeniería de Documentación <email>doceng@FreeBSD.org</email>, Y explícitamente concedido.

source: Requests for Google Analytics data must include a specific purpose. For example, a valid reason for requesting access would be <quote>to see the most frequently used web browsers when viewing FreeBSD web pages to ensure page rendering speeds are acceptable.</quote>
es_es: Las solicitudes de datos de Google Analytics deben incluir un propósito específico. Por ejemplo, una razón válida para solicitar acceso sería <quote>para ver los navegadores web más utilizados al visualizar páginas web de FreeBSD para garantizar que las velocidades de reproducción de la página sean aceptables.</quote>

source: Conversely, <quote>to see what web browsers are most frequently used</quote> (without stating <emphasis>why</emphasis>) would be rejected.
es_es: Por el contrario, <quote>para ver qué navegadores web se utilizan con más frecuencia</quote> (sin decir <emphasis>porque</emphasis>) sería rechazado.

source: All requests must include the timeframe for which the data would be required. For example, it must be explicitly stated if the requested data would be needed for a timeframe covering a span of 3 weeks, or if the request would be one-time only.
es_es: Todas las solicitudes deben incluir el período de tiempo durante el cual se requerirían los datos. Por ejemplo, debe indicarse explícitamente si los datos solicitados serían necesarios para un período de tiempo que abarque un período de 3 semanas, o si la solicitud sería única.

source: Any request for Google Analytics data without a clear, reasonable reason beneficial to the FreeBSD Project will be rejected.
es_es: Se rechazará cualquier solicitud de datos de Google Analytics sin una razón clara y razonable que beneficie al Proyecto FreeBSD.

source: Data Available Through Google Analytics
es_es: Datos disponibles a través de Google Analytics

source: A few examples of the types of Google Analytics data available include:
es_es: Algunos ejemplos de los tipos de datos de Google Analytics disponibles incluyen:

source: Commonly used web browsers
es_es: Navegadores web de uso común

source: Page load times
es_es: Tiempos de carga de la página

source: Site access by language
es_es: Acceso al sitio por idioma

source: How do I add a new file to a branch?
es_es: ¿Cómo agrego un nuevo archivo a una rama?

source: To add a file onto a branch, simply checkout or update to the branch you want to add to and then add the file using the add operation as you normally would. This works fine for the <literal>doc</literal> and <literal>ports</literal> trees. The <literal>src</literal> tree uses SVN and requires more care because of the <literal>mergeinfo</literal> properties. See the <link linkend="subversion-primer">Subversion Primer</link> for details on how to perform an MFC.
es_es: para agregar un archivo a una rama, simplemente realice el pago o actualice la rama a la que desea agregar y luego agregue el archivo usando la operación de agregar como lo haría normalmente. Esto funciona bien para <literal>doc</literal> y <literal>ports</literal> trees. The <literal>src</literal> árbol utiliza SVN y requiere más cuidado debido a la <literal>mergeinfo</literal> propiedades. Ver el<link linkend="subversion-primer">Subversion Primer</link> para obtener detalles sobre cómo realizar un MFC.

source: How do I access <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> to put up personal or project information?
es_es: Como accedo <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> poner información personal o del proyecto?

source: <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> is the same as <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>. Just create a <filename>public_html</filename> directory. Anything you place in that directory will automatically be visible under <uri xlink:href="https://people.FreeBSD.org/">https://people.FreeBSD.org/</uri>.
es_es: <systemitem class="fqdomainname">people.FreeBSD.org</systemitem> Es lo mismo <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>. solo cree un <filename>public_html</filename> directorio. todo lo que coloque en ese directorio será visible automáticamente bajo <uri xlink:href="https://people.FreeBSD.org/">https://people.FreeBSD.org/</uri>.

source: Where are the mailing list archives stored?
es_es: ¿Dónde se almacenan los archivos de la lista de correo?

source: The mailing lists are archived under <filename>/local/mail</filename> on <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.
es_es: Las listas de correo se archivan bajo <filename>/local/mail</filename>en <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.

source: I would like to mentor a new committer. What process do I need to follow?
es_es: Me gustaría ser mentor de un nuevo committer. ¿Qué proceso debo seguir?

source: See the <link xlink:href="https://www.freebsd.org/internal/new-account.html">New Account Creation Procedure</link> document on the internal pages.
es_es: Ver el <link xlink:href="https://www.freebsd.org/internal/new-account.html">Procedimiento de creación de una nueva cuenta</link> documento en las páginas internas.

source: Benefits and Perks for FreeBSD Committers
es_es: Beneficios y ventajas para los confirmadores de FreeBSD

source: Recognition
es_es: Reconocimiento

source: Recognition as a competent software engineer is the longest lasting value. In addition, getting a chance to work with some of the best people that every engineer would dream of meeting is a great perk!
es_es: El reconocimiento como ingeniero de software competente es el valor más duradero. Además, tener la oportunidad de trabajar con algunas de las mejores personas con las que todo ingeniero soñaría conocer es una gran ventaja!

source: FreeBSD Mall
es_es: Centro comercial FreeBSD

source: FreeBSD committers can get a free 4-CD or DVD set at conferences from <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link>.
es_es: Los confirmadores de FreeBSD pueden obtener un juego de 4 CD o DVD gratis en conferencias de <link xlink:href="http://www.freebsdmall.com">FreeBSD Mall, Inc.</link>.

source: In addition, developers may request a cloaked hostmask for their account on the Freenode IRC network in the form of <literal>freebsd/developer/</literal><replaceable>freefall name</replaceable> or <literal>freebsd/developer/</literal><replaceable>NickServ name</replaceable>. To request a cloak, send an email to <email>irc@FreeBSD.org</email> with your requested hostmask and NickServ account name.
es_es: Además, los desarrolladores pueden solicitar una máscara de host encubierta para su cuenta en la red IRC de Freenode en forma de <literal>freebsd/developer/</literal><replaceable>nombre de caída libre</replaceable>o<literal>freebsd/developer/</literal><replaceable>nombre con NickServ</replaceable>.Para solicitar una capa, envíe un correo electrónico a<email>irc@FreeBSD.org</email> con la máscara de host solicitada y el nombre de la cuenta NickServ.

source: Gandi provides website hosting, cloud computing, domain registration, and X.509 certificate services.
es_es: Gandi ofrece servicios de alojamiento de sitios web, computación en la nube, registro de dominio y certificados X.509.

source: Gandi offers an E-rate discount to all FreeBSD developers. Send mail to <email>non-profit@gandi.net</email> using your <literal>@freebsd.org</literal> mail address, and indicate your Gandi handle.
es_es: Gandi ofrece un descuento de tarifa electrónica a todos los desarrolladores de FreeBSD. Enviar correo a<email>non-profit@gandi.net</email>usando tu<literal>@freebsd.org</literal> dirección de correo electrónico e indique su nombre de usuario de Gandi.
