Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: Backport of security and reliability fixes which only result in <varname>PORTREVISION</varname> bumps and no changes to enabled features. for example, adding a patch fixing a buffer overflow.
es_es: Backport de correcciones de seguridad y confiabilidad que solo dan como resultado <varname>PORTREVISION</varname> golpes y sin cambios en las funciones habilitadas. por ejemplo, agregar un parche que corrija un desbordamiento del búfer.

source: Minor version changes that do nothing but fix security or crash-related issues.
es_es: Cambios menores en la versión que no hacen más que solucionar problemas de seguridad o relacionados con fallas.

source: Adding/fixing <varname>CONFLICTS</varname>.
es_es: Agregar/arreglar<varname>CONFLICTS</varname>.

source: Web Browsers, browser plugins, and their required dependencies.
es_es: Navegadores web, complementos de navegador y sus dependencias necesarias.

source: Commits that are not covered by these blanket approvals always require explicit approval of either Ports Security Team <email>ports-secteam@FreeBSD.org</email> or Ports Management Team <email>portmgr@FreeBSD.org</email>.
es_es: Los compromisos que no están cubiertos por estas aprobaciones generales siempre requieren la aprobación explícita de cualquiera de los equipos de seguridad de puertos<email>ports-secteam@FreeBSD.org</email> o equipo de gestión de puertos <email>portmgr@FreeBSD.org</email>.

source: What is the procedure for merging commits to the quarterly branch?
es_es: ¿Cuál es el procedimiento para fusionar compromisos con la sucursal trimestral?

source: A script is provided to automate merging a specific commit: <filename>ports/Tools/scripts/mfh</filename>. It is used as follows:
es_es: Se proporciona un script para automatizar la fusión de una confirmación específica: <filename>ports/Tools/scripts/mfh</filename>. Se utiliza de la siguiente manera:

source: At that point, the script will either open a shell for you to fix things, or open your text editor with the commit message all prepared and then commit the merge.
es_es: En ese punto, el script abrirá un shell para que arregle las cosas o abrirá su editor de texto con el mensaje de confirmación todo preparado y luego confirmará la fusión.

source: The script assumes that you can connect to <literal>repo.FreeBSD.org</literal> with <application>SSH</application> directly, so if your local login name is different than your FreeBSD cluster account, you need a few lines in your <filename>~/.ssh/config</filename>:
es_es: La secuencia de comandos asume que puede conectarse a <literal>repo.FreeBSD.org</literal>con <application>SSH</application> directamente, por lo que si su nombre de inicio de sesión local es diferente de su cuenta de clúster de FreeBSD, necesita algunas líneas en su <filename>~/.ssh/config</filename>:

source: The script is also able to merge more than one revision at a time. If there have been other updates to the port since the branch was created that have not been merged because they were not security related. Add the different revisions <emphasis>in the order they were committed</emphasis> on the <command>mfh</command> line. The new commit log message will contain the combined log messages from all the original commits. These messages <emphasis>must</emphasis> be edited to show what is actually being done with the new commit.
es_es: El script también puede fusionar más de una revisión a la vez. Si ha habido otras actualizaciones en el puerto desde que se creó la sucursal que no se han fusionado porque no estaban relacionadas con la seguridad. Agregar las diferentes revisiones <emphasis>en el orden en que fueron cometidos</emphasis>en el <command>mfh</command> línea. El nuevo mensaje de registro de confirmaciones contendrá los mensajes de registro combinados de todas las confirmaciones originales. Estos mensajes<emphasis>debe</emphasis> ser editado para mostrar lo que realmente se está haciendo con la nueva confirmación.

source: The mfh script can also take an optional first argument, the branch where the merge is being done. Only the latest quarterly branch is supported, so specifying the branch is discouraged. To be safe, the script will give a warning if the quarterly branch is not the latest:
es_es: El script mfh también puede tomar un primer argumento opcional, la rama donde se realiza la fusión. Solo se admite la última rama trimestral, por lo que no se recomienda especificar la rama. Para estar seguro, el script dará una advertencia si la rama trimestral no es la más reciente:

source: <prompt>%</prompt> <userinput>/usr/ports/Tools/scripts/mfh 2016Q1 r407208 r407713</userinput> /!\ The latest branch is 2016Q2, do you really want to commit to 2016Q1? [y/n]
es_es: <prompt>%</prompt> <userinput>/usr/ports/Tools/scripts/mfh 2016Q1 r407208 r407713</userinput> /!\ la última sucursal es el segundo trimestre de 2016, ¿de verdad quieres comprometerte con el primer trimestre de 2016? [s/n]

source: Creating a New Category
es_es: Crear una nueva categoría

source: What is the procedure for creating a new category?
es_es: ¿Cuál es el procedimiento para crear una nueva categoría?

source: Please see <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#proposing-categories"> Proposing a New Category</link> in the Porter's Handbook. Once that procedure has been followed and the PR has been assigned to the Ports Management Team <email>portmgr@FreeBSD.org</email>, it is their decision whether or not to approve it. If they do, it is their responsibility to:
es_es: Por favor mira <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#proposing-categories"> Proponer una nueva categoría</link> en el Manual de Porter. Una vez que se ha seguido ese procedimiento y se ha asignado el RP al Equipo de Gestión de Puertos <email>portmgr@FreeBSD.org</email>, es su decisión aprobarlo o no. Si lo hacen, es su responsabilidad:

source: Perform any needed moves. (This only applies to physical categories.)
es_es: Realice los movimientos necesarios. (Esto solo se aplica a las categorías físicas.)

source: Update the <varname>VALID_CATEGORIES</varname> definition in <filename>ports/Mk/bsd.port.mk</filename>.
es_es: Actualizar el <varname>VALID_CATEGORIES</varname>definición en<filename>ports/Mk/bsd.port.mk</filename>.

source: Assign the PR back to you.
es_es: Asignar el PR de nuevo a usted.

source: What do I need to do to implement a new physical category?
es_es: ¿Qué debo hacer para implementar una nueva categoría física?

source: Upgrade each moved port's <filename>Makefile</filename>. Do not connect the new category to the build yet.
es_es: Actualizar cada puerto movido<filename>Makefile</filename>. No conecte la nueva categoría a la compilación todavía.

source: To do this, you will need to:
es_es: Para hacer esto, necesitará:

source: Change the port's <varname>CATEGORIES</varname> (this was the point of the exercise, remember?) The new category is listed <emphasis>first</emphasis>. This will help to ensure that the <varname>PKGORIGIN</varname> is correct.
es_es: Cambiar el puerto <varname>CATEGORÍAS</varname> (este era el objetivo del ejercicio, ¿recuerdas?) La nueva categoría aparece <emphasis>primero</emphasis>. Esto ayudará a asegurar que el <varname>PKGORIGIN</varname> es correcto.

source: Run a <command>make describe</command>. Since the top-level <command>make index</command> that you will be running in a few steps is an iteration of <command>make describe</command> over the entire ports hierarchy, catching any errors here will save you having to re-run that step later on.
es_es: corra con <command>make describe</command>. Desde el nivel superior <command>make index</command> que ejecutará en unos pocos pasos es una iteración de <command>make describe</command> en toda la jerarquía de puertos, detectar cualquier error aquí le evitará tener que volver a ejecutar ese paso más adelante.

source: If you want to be really thorough, now might be a good time to run <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Si quiere ser realmente minucioso, ahora puede ser un buen momento para ejecutar <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Check that the <varname>PKGORIGIN</varname>s are correct. The ports system uses each port's <varname>CATEGORIES</varname> entry to create its <varname>PKGORIGIN</varname>, which is used to connect installed packages to the port directory they were built from. If this entry is wrong, common port tools like <citerefentry><refentrytitle>pkg_version</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry vendor="ports"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry> fail.
es_es: Compruebe que el <varname>PKGORIGIN</varname>s son correctos. El sistema de puertos utiliza cada puerto <varname>CATEGORIES</varname> entrada para crear su <varname>PKGORIGIN</varname>, que se utiliza para conectar los paquetes instalados al directorio del puerto desde el que se crearon. Si esta entrada es incorrecta, herramientas de puerto comunes como <citerefentry><refentrytitle>pkg_version</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry vendor="puertos"><refentrytitle>portupgrade</refentrytitle><manvolnum>1</manvolnum></citerefentry> fail.

source: To do this, use the <filename>chkorigin.sh</filename> tool: <command>env PORTSDIR=<replaceable>/path/to/ports</replaceable> sh -e <replaceable>/path/to/ports</replaceable>/Tools/scripts/chkorigin.sh</command>. This will check <emphasis>every</emphasis> port in the ports tree, even those not connected to the build, so you can run it directly after the move operation. Hint: do not forget to look at the <varname>PKGORIGIN</varname>s of any slave ports of the ports you just moved!
es_es: Para hacer esto, usa el <filename>chkorigin.sh</filename> tool: <command>env PORTSDIR=<replaceable>/path/to/ports</replaceable> sh -e <replaceable>/path/to/ports</replaceable>/Tools/scripts/chkorigin.sh</command>. Esto comprobará <emphasis>every</emphasis> port en el árbol de ports, incluso aquellos que no están conectados a la compilación, por lo que puede ejecutarlo directamente después de la operación de movimiento. Sugerencia: no olvide mirar el <varname>PKGORIGIN</varname>s de cualquier puerto esclavo de los puertos que acaba de mover!

source: On your own local system, test the proposed changes: first, comment out the <varname>SUBDIR</varname> entries in the old ports' categories' <filename>Makefile</filename>s; then enable building the new category in <filename>ports/Makefile</filename>. Run <command>make checksubdirs</command> in the affected category directories to check the <varname>SUBDIR</varname> entries. Next, in the <filename>ports/</filename> directory, run <command>make index</command>. This can take over 40 minutes on even modern systems; however, it is a necessary step to prevent problems for other people.
es_es: En su propio sistema local, pruebe los cambios propuestos: primero, comente los <varname>SUBDIR</varname> entradas en las 'categorías' de los puertos antiguos <filename>Makefile</filename>s; luego habilite la construcción de la nueva categoría en<filename>ports/Makefile</filename>. Corra <command>make checksubdirs</command> in the affected category directories to check the <varname>SUBDIR</varname> entradas. A continuación, en el<filename>ports/</filename> directorio, ejecutar<command>make index</command>. Esto puede llevar más de 40 minutos incluso en sistemas modernos; sin embargo, es un paso necesario para prevenir problemas a otras personas.

source: Once this is done, you can commit the updated <filename>ports/Makefile</filename> to connect the new category to the build and also commit the <filename>Makefile</filename> changes for the old category or categories.
es_es: Una vez hecho esto, puede confirmar la actualización<filename>ports/Makefile</filename> para conectar la nueva categoría a la compilación y también confirmar el <filename>Makefile</filename>cambios para la categoría o categorías antiguas.

source: Add appropriate entries to <filename>ports/MOVED</filename>.
es_es: Agregue entradas apropiadas a <filename>ports/MOVED</filename>.

source: Update the documentation by modifying:
es_es: Actualice la documentación modificando:

source: the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#PORTING-CATEGORIES">list of categories</link> in the Porter's Handbook
es_es: el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/makefile-categories.html#PORTING-CATEGORIES">lista de categorías</link> en el manual del portero

source: <filename>doc/en_US.ISO8859-1/htdocs/ports</filename>. Note that these are now displayed by sub-groups, as specified in <filename>doc/en_US.ISO8859-1/htdocs/ports/categories.descriptions</filename>.
es_es: <filename>doc/en_US.ISO8859-1/htdocs/ports</filename>. Tenga en cuenta que ahora se muestran por subgrupos, como se especifica en <filename>doc/en_US.ISO8859-1/htdocs/ports/categories.descriptions</filename>

source: (Note: these are in the docs, not the ports, repository). If you are not a docs committer, you will need to submit a PR for this.
es_es: (Nota: estos están en los documentos, no en los puertos, repositorio). Si no es un confirmador de documentos, deberá enviar un PR para esto.

source: Only once all the above have been done, and no one is any longer reporting problems with the new ports, should the old ports be deleted from their previous locations in the repository.
es_es: Solo una vez que se haya hecho todo lo anterior, y ya no se informe de problemas con los nuevos puertos, los puertos antiguos deben eliminarse de sus ubicaciones anteriores en el repositorio.

source: It is not necessary to manually update the <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">ports web pages</link> to reflect the new category. This is done automatically via the change to <filename>en_US.ISO8859-1/htdocs/ports/categories</filename> and the automated rebuild of <filename>INDEX</filename>.
es_es: no es necesario actualizar manualmente el <link xlink:href="@@URL_RELPREFIX@@/ports/index.html">puertos páginas web</link> para reflejar la nueva categoría. Esto se hace automáticamente mediante el cambio a <filename>en_US.ISO8859-1/htdocs/ports/categories</filename> y la reconstrucción automatizada de<filename>INDEX</filename>.

source: What do I need to do to implement a new virtual category?
es_es: ¿Qué debo hacer para implementar una nueva categoría virtual?

source: This is much simpler than a physical category. Only a few modifications are needed:
es_es: Esto es mucho más simple que una categoría física. Solo se necesitan algunas modificaciones:

source: Miscellaneous Questions
es_es: Preguntas misceláneas

source: Are there changes that can be committed without asking the maintainer for approval?
es_es: ¿Hay cambios que se puedan confirmar sin pedir la aprobación del encargado del mantenimiento?

source: Blanket approval for most ports applies to these types of fixes:
es_es: La aprobación general para la mayoría de los puertos se aplica a estos tipos de arreglos:

source: Most infrastructure changes to a port (that is, modernizing, but not changing the functionality). For example, the blanket covers converting to new <varname>USES</varname> macros, enabling verbose builds, and switching to new ports system syntaxes.
es_es: La mayoría de la infraestructura cambia en un puerto (es decir, se moderniza, pero no se cambia la funcionalidad). Por ejemplo, las cubiertas de la manta se convierten en nuevas <varname>USES</varname> macros, permitiendo compilaciones detalladas y cambiando a nuevas sintaxis del sistema de puertos.

source: Trivial and <emphasis>tested</emphasis> build and runtime fixes.
es_es: Trivial y <emphasis>probado</emphasis> correcciones de compilación y tiempo de ejecución.

source: Exceptions to this are anything maintained by the Ports Management Team <email>portmgr@FreeBSD.org</email>, or the Security Officer Team <email>security-officer@FreeBSD.org</email>. No unauthorized commits may ever be made to ports maintained by those groups.
es_es: Las excepciones a esto son todo lo mantenido por el equipo de gestión de puertos. <email>portmgr@FreeBSD.org</email>, o el equipo de oficiales de seguridad <email>security-officer@FreeBSD.org</email>. Nunca se pueden realizar confirmaciones no autorizadas en puertos mantenidos por esos grupos.

source: How do I know if my port is building correctly or not?
es_es: ¿Cómo sé si mi puerto se está construyendo correctamente o no?

source: The packages are built multiple times each week. If a port fails, the maintainer will receive an email from <literal>pkg-fallout@FreeBSD.org</literal>.
es_es: Los paquetes se crean varias veces a la semana. Si falla un puerto, el mantenedor recibirá un correo electrónico de <literal>pkg-fallout@FreeBSD.org</literal>.

source: Reports for all the package builds (official, experimental, and non-regression) are aggregated at <link xlink:href="https://pkg-status.freebsd.org/">pkg-status.FreeBSD.org</link>.
es_es: Los informes de todas las compilaciones de paquetes (oficiales, experimentales y sin regresión) se agregan en <link xlink:href="https://pkg-status.freebsd.org/">pkg-status.FreeBSD.org</link>.

source: I added a new port. Do I need to add it to the <filename>INDEX</filename>?
es_es: Agregué un nuevo puerto. ¿Necesito agregarlo al <filename>INDEX</filename>?

source: No. The file can either be generated by running <command>make index</command>, or a pre-generated version can be downloaded with <command>make fetchindex</command>.
es_es: No. El archivo se puede generar ejecutando <command>make index</command>, o se puede descargar una versión pregenerada con <command>make fetchindex</command>.

source: Are there any other files I am not allowed to touch?
es_es: ¿Hay otros archivos que no pueda tocar?

source: Any file directly under <filename>ports/</filename>, or any file under a subdirectory that starts with an uppercase letter (<filename>Mk/</filename>, <filename>Tools/</filename>, etc.). In particular, the Ports Management Team <email>portmgr@FreeBSD.org</email> is very protective of <filename>ports/Mk/bsd.port*.mk</filename> so do not commit changes to those files unless you want to face their wrath.
es_es: Cualquier archivo directamente debajo <filename>ports</filename>, o cualquier archivo de un subdirectorio que comience con una letra mayúscula (<filename>Mk/</filename>,<filename>Herramientas/</filename>, etc.). En particular, el equipo de gestión de puertos <email>portmgr@FreeBSD.org</email> Es muy protector de<filename>ports/Mk/bsd.port*mk</filename> por lo tanto, no realice cambios en esos archivos a menos que desee enfrentar su ira.

source: What is the proper procedure for updating the checksum for a port distfile when the file changes without a version change?
es_es: ¿Cuál es el procedimiento adecuado para actualizar la suma de comprobación de un archivo distfile de puerto cuando el archivo cambia sin un cambio de versión?

source: When the checksum for a distribution file is updated due to the author updating the file without changing the port revision, the commit message includes a summary of the relevant diffs between the original and new distfile to ensure that the distfile has not been corrupted or maliciously altered. If the current version of the port has been in the ports tree for a while, a copy of the old distfile will usually be available on the ftp servers; otherwise the author or maintainer should be contacted to find out why the distfile has changed.
es_es: Cuando la suma de comprobación de un archivo de distribución se actualiza debido a que el autor actualizó el archivo sin cambiar la revisión del puerto, el mensaje de confirmación incluye un resumen de las diferencias relevantes entre el archivo dist original y el nuevo para garantizar que el archivo dist no haya sido dañado o alterado maliciosamente. . Si la versión actual del puerto ha estado en el árbol de puertos por un tiempo, una copia del antiguo archivo dist estará disponible en los servidores ftp; de lo contrario, se debe contactar al autor o al encargado del mantenimiento para averiguar por qué ha cambiado el archivo dist.

source: How can an experimental test build of the ports tree (<emphasis>exp-run</emphasis>) be requested?
es_es: ¿Cómo se puede construir una prueba experimental del árbol de puertos? (<emphasis>exp-run</emphasis>) ser solicitado?

source: An exp-run must be completed before patches with a significant ports impact are committed. The patch can be against the ports tree or the base system.
es_es: Se debe completar una ejecución de exp antes de que se comprometan los parches con un impacto significativo en los puertos. El parche puede ser contra el árbol de puertos o el sistema base.

source: Full package builds will be done with the patches provided by the submitter, and the submitter is required to fix detected problems (<emphasis>fallout</emphasis>) before commit.
es_es: Las compilaciones de paquetes completos se realizarán con los parches proporcionados por el remitente, y el remitente debe solucionar los problemas detectados. (<emphasis>fallout</emphasis> antes de comprometerse.

source: Go to the <link xlink:href="https://bugs.freebsd.org/submit">Bugzilla new <acronym>PR</acronym> page</link>.
es_es: Ve a la <link xlink:href="https://bugs.freebsd.org/submit">Bugzilla nuevo <acronym>PR</acronym> pagina</link>.

source: Select the product your patch is about.
es_es: Seleccione el producto de su parche.

source: Fill in the bug report as normal. Remember to attach the patch.
es_es: Complete el informe de error como de costumbre. Recuerda colocar el parche.

source: If at the top it says <quote>Show Advanced Fields</quote> click on it. It will now say <quote>Hide Advanced Fields</quote>. Many new fields will be available. If it already says <quote>Hide Advanced Fields</quote>, no need to do anything.
es_es: Si arriba dice <quote>Mostrar campos avanzados</quote>Haz click en eso. Ahora dirá<quote>Ocultar campos avanzados</quote>. Habrá muchos campos nuevos disponibles. Si ya dice <quote>Ocultar campos avanzados</quote>, No necesito hacer cualquier cosa.

source: In the <quote>Flags</quote> section, set the <quote>exp-run</quote> one to <literal>?</literal>. As for all other fields, hovering the mouse over any field shows more details.
es_es: en el <quote>Flags</quote> Sección, establecer el <quote>exp-run</quote> Uno para<literal>?</literal>. Como para todos los demás campos, al pasar el mouse sobre cualquier campo se muestran más detalles.

source: Submit. Wait for the build to run.
es_es: Enviar. Espere a que se ejecute la compilación.

source: Ports Management Team <email>portmgr@FreeBSD.org</email> will reply with a possible fallout.
es_es: Equipo de gestión de puertos <email>portmgr@FreeBSD.org</email> responderá con una posible secuela.

source: Depending on the fallout:
es_es: Dependiendo de las consecuencias:

source: If there is no fallout, the procedure stops here, and the change can be committed, pending any other approval required.
es_es: Si no hay consecuencias, el procedimiento se detiene aquí y el cambio se puede confirmar, pendiente de cualquier otra aprobación requerida.

source: If there is fallout, it <emphasis>must</emphasis> be fixed, either by fixing the ports directly in the ports tree, or adding to the submitted patch.
es_es: Si hay consecuencias, <emphasis>debe</emphasis> ser corregido, ya sea arreglando los puertos directamente en el árbol de puertos o agregándolos al parche enviado.
