Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: Many mistakes are made because someone is in a hurry and just assumes they know the right way of doing something. If you have not done it before, chances are good that you do not actually know the way we do things and really need to ask first or you are going to completely embarrass yourself in public. There is no shame in asking <quote>how in the heck do I do this?</quote> We already know you are an intelligent person; otherwise, you would not be a committer.
es_es: Se cometen muchos errores porque alguien tiene prisa y simplemente asume que sabe la forma correcta de hacer algo. Si no lo ha hecho antes, es muy probable que no sepa realmente la forma en que hacemos las cosas y realmente necesite preguntar primero o se avergonzará por completo en público. No hay vergüenza en preguntar <quote>¿Cómo diablos hago esto?</quote> Ya sabemos que eres una persona inteligente; de lo contrario, no sería un consumador.

source: This may sound obvious, but if it really were so obvious then we probably would not see so many cases of people clearly not doing this. If your changes are to the kernel, make sure you can still compile both GENERIC and LINT. If your changes are anywhere else, make sure you can still make world. If your changes are to a branch, make sure your testing occurs with a machine which is running that code. If you have a change which also may break another architecture, be sure and test on all supported architectures. Please refer to the <link xlink:href="https://www.FreeBSD.org/internal/">FreeBSD Internal Page</link> for a list of available resources. As other architectures are added to the FreeBSD supported platforms list, the appropriate shared testing resources will be made available.
es_es: Esto puede parecer obvio, pero si realmente fuera tan obvio, probablemente no veríamos tantos casos de personas que claramente no lo hacen. Si sus cambios son en el kernel, asegúrese de que aún puede compilar tanto GENERIC como LINT. Si sus cambios están en cualquier otro lugar, asegúrese de que aún puede hacer mundo. Si sus cambios son en una rama, asegúrese de que la prueba se realice con una máquina que ejecute ese código. Si tiene un cambio que también puede romper otra arquitectura, asegúrese de probar en todas las arquitecturas compatibles. por favor refiérase a <link xlink:href="https://www.FreeBSD.org/internal/">Página interna de FreeBSD</link> para obtener una lista de los recursos disponibles. A medida que se agregan otras arquitecturas a la lista de plataformas compatibles con FreeBSD, los recursos de prueba compartidos apropiados estarán disponibles.

source: Contributed software is anything under the <filename>src/contrib</filename>, <filename>src/crypto</filename>, or <filename>src/sys/contrib</filename> trees.
es_es: El software contribuido es todo lo que <filename>src/contrib</filename>,<filename>src/crypto</filename>, o <filename>src/sys/contrib</filename> arboles.

source: The trees mentioned above are for contributed software usually imported onto a vendor branch. Committing something there may cause unnecessary headaches when importing newer versions of the software. As a general consider sending patches upstream to the vendor. Patches may be committed to FreeBSD first with permission of the maintainer.
es_es: Los árboles mencionados anteriormente son para software contribuido generalmente importado a una sucursal de un proveedor. Cometer algo allí puede causar dolores de cabeza innecesarios al importar versiones más nuevas del software. En general, considere enviar parches en sentido ascendente al proveedor. Los parches se pueden enviar a FreeBSD primero con el permiso del desarrollador.

source: Reasons for modifying upstream software range from wanting strict control over a tightly coupled dependency to lack of portability in the canonical repository's distribution of their code. Regardless of the reason, effort to minimize the maintenance burden of fork is helpful to fellow maintainers. Avoid committing trivial or cosmetic changes to files since it makes every merge thereafter more difficult: such patches need to be manually re-verified every import.
es_es: Las razones para modificar el software ascendente van desde querer un control estricto sobre una dependencia estrechamente acoplada hasta la falta de portabilidad en la distribución del código del repositorio canónico. Independientemente de la razón, el esfuerzo por minimizar la carga de mantenimiento de la horquilla es útil para los compañeros de mantenimiento. Evite realizar cambios triviales o estéticos en los archivos, ya que hace que cada combinación a partir de entonces sea más difícil: dichos parches deben volver a verificarse manualmente en cada importación.

source: If a particular piece of software lacks a maintainer, you are encouraged to take up ownership. If you are unsure of the current maintainership email <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-arch">FreeBSD architecture and design mailing list</link> and ask.
es_es: Si una pieza de software en particular carece de un mantenedor, se le anima a asumir la propiedad. Si no está seguro del correo electrónico de mantenimiento actual <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-arch">Lista de correo de arquitectura y diseño de FreeBSD</link> y pregunte.

source: Policy on Multiple Architectures
es_es: Política sobre arquitecturas múltiples

source: FreeBSD has added several new architecture ports during recent release cycles and is truly no longer an <trademark>i386</trademark> centric operating system. In an effort to make it easier to keep FreeBSD portable across the platforms we support, core has developed this mandate:
es_es: FreeBSD ha agregado varios puertos de arquitectura nueva durante los ciclos de lanzamiento recientes y realmente ya no es un <trademark>i386</trademark> sistema operativo céntrico. En un esfuerzo por facilitar la portabilidad de FreeBSD en las plataformas que apoyamos, core ha desarrollado este mandato:

source: Our 32-bit reference platform is i386, and our 64-bit reference platform is amd64. Major design work (including major API and ABI changes) must prove itself on at least one 32-bit and at least one 64-bit platform, preferably the primary reference platforms, before it may be committed to the source tree.
es_es: Nuestra plataforma de referencia de 32 bits es i386 y nuestra plataforma de referencia de 64 bits es amd64. El trabajo de diseño importante (incluidos los cambios importantes de API y ABI) debe demostrar su valía en al menos una plataforma de 32 bits y al menos una de 64 bits, preferiblemente las plataformas de referencia primarias, antes de que se pueda comprometer con el árbol de origen.

source: The i386 and amd64 platforms were chosen due to being more readily available to developers and as representatives of more diverse processor and system designs - big versus little endian, register file versus register stack, different DMA and cache implementations, hardware page tables versus software TLB management etc.
es_es: Se eligieron las plataformas i386 y amd64 debido a que están más disponibles para los desarrolladores y como representantes de diseños de sistemas y procesadores más diversos: big versus little endian, archivo de registro versus pila de registro, diferentes implementaciones de caché y DMA, tablas de páginas de hardware versus administración de TLB de software etc.

source: We will continue to re-evaluate this policy as cost and availability of the 64-bit platforms change.
es_es: Continuaremos reevaluando esta política a medida que cambien el costo y la disponibilidad de las plataformas de 64 bits.

source: Developers should also be aware of our Tier Policy for the long term support of hardware architectures. The rules here are intended to provide guidance during the development process, and are distinct from the requirements for features and architectures listed in that section. The Tier rules for feature support on architectures at release-time are more strict than the rules for changes during the development process.
es_es: Los desarrolladores también deben conocer nuestra Política de niveles para el soporte a largo plazo de arquitecturas de hardware. Las reglas aquí están destinadas a proporcionar una guía durante el proceso de desarrollo y son distintas de los requisitos para las características y arquitecturas enumeradas en esa sección. Las reglas de nivel para el soporte de características en arquitecturas en el momento del lanzamiento son más estrictas que las reglas de cambios durante el proceso de desarrollo.

source: Other Suggestions
es_es: Otras sugerencias

source: When committing documentation changes, use a spell checker before committing. For all XML docs, verify that the formatting directives are correct by running <command>make lint</command> and <package>textproc/igor</package>.
es_es: Al realizar cambios en la documentación, utilice un corrector ortográfico antes de realizar la confirmación. Para todos los documentos XML, verifique que las directivas de formato sean correctas ejecutando <command>make lint</command>y<package>textproc/igor</package>.

source: For manual pages, run <package>sysutils/manck</package> and <package>textproc/igor</package> over the manual page to verify all of the cross references and file references are correct and that the man page has all of the appropriate <varname>MLINK</varname>s installed.
es_es: Para páginas de manual, ejecute <package>sysutils/manck</package>y<package>textproc/igor</package> sobre la página del manual para verificar que todas las referencias cruzadas y las referencias de archivos sean correctas y que la página del manual tenga todos los <varname>MLINK</varname>s instalado.

source: Do not mix style fixes with new functionality. A style fix is any change which does not modify the functionality of the code. Mixing the changes obfuscates the functionality change when asking for differences between revisions, which can hide any new bugs. Do not include whitespace changes with content changes in commits to <filename>doc/</filename> . The extra clutter in the diffs makes the translators' job much more difficult. Instead, make any style or whitespace changes in separate commits that are clearly labeled as such in the commit message.
es_es: No mezcle arreglos de estilo con nuevas funciones. Una corrección de estilo es cualquier cambio que no modifica la funcionalidad del código. La combinación de los cambios confunde el cambio de funcionalidad al solicitar diferencias entre las revisiones, lo que puede ocultar cualquier error nuevo. No incluya cambios de espacio en blanco con cambios de contenido en las confirmaciones de <filename>doc</filename>. El desorden adicional en las diferencias hace que el trabajo de los traductores sea mucho más difícil. En su lugar, realice cambios de estilo o espacios en blanco en confirmaciones separadas que estén claramente etiquetadas como tales en el mensaje de confirmación.

source: Deprecating Features
es_es: Funciones obsoletas

source: When it is necessary to remove functionality from software in the base system, follow these guidelines whenever possible:
es_es: Cuando sea necesario eliminar la funcionalidad del software en el sistema base, siga estas pautas siempre que sea posible:

source: Mention is made in the manual page and possibly the release notes that the option, utility, or interface is deprecated. Use of the deprecated feature generates a warning.
es_es: En la página del manual y posiblemente en las notas de la versión se menciona que la opción, utilidad o interfaz está obsoleta. El uso de la función obsoleta genera una advertencia.

source: The option, utility, or interface is preserved until the next major (point zero) release.
es_es: La opción, utilidad o interfaz se conserva hasta la próxima versión principal (punto cero).

source: The option, utility, or interface is removed and no longer documented. It is now obsolete. It is also generally a good idea to note its removal in the release notes.
es_es: La opción, utilidad o interfaz se elimina y ya no se documenta. Ahora está obsoleto. También es generalmente una buena idea anotar su eliminación en las notas de la versión.

source: Privacy and Confidentiality
es_es: Privacidad y confidencialidad

source: Most FreeBSD business is done in public.
es_es: La mayoría de los negocios de FreeBSD se realizan en público.

source: FreeBSD is an <emphasis>open</emphasis> project. Which means that not only can anyone use the source code, but that most of the development process is open to public scrutiny.
es_es: FreeBSD es un <emphasis>abierto</emphasis> proyecto. Lo que significa que no solo cualquiera puede usar el código fuente, sino que la mayor parte del proceso de desarrollo está abierto al escrutinio público.

source: Certain sensitive matters must remain private or held under embargo.
es_es: Ciertos asuntos delicados deben permanecer privados o mantenidos bajo embargo.

source: There unfortunately cannot be complete transparency. As a FreeBSD developer you will have a certain degree of privileged access to information. Consequently you are expected to respect certain requirements for confidentiality. Sometimes the need for confidentiality comes from external collaborators or has a specific time limit. Mostly though, it is a matter of not releasing private communications.
es_es: Lamentablemente, no puede haber una transparencia total. Como desarrollador de FreeBSD, tendrá un cierto grado de acceso privilegiado a la información. En consecuencia, se espera que respete ciertos requisitos de confidencialidad. A veces la necesidad de confidencialidad proviene de colaboradores externos o tiene un límite de tiempo específico. Sin embargo, sobre todo, se trata de no liberar comunicaciones privadas.

source: The Security Officer has sole control over the release of security advisories.
es_es: El oficial de seguridad tiene el control exclusivo sobre la publicación de avisos de seguridad.

source: Where there are security problems that affect many different operating systems, FreeBSD frequently depends on early access to be able to prepare advisories for coordinated release. Unless FreeBSD developers can be trusted to maintain security, such early access will not be made available. The Security Officer is responsible for controlling pre-release access to information about vulnerabilities, and for timing the release of all advisories. He may request help under condition of confidentiality from any developer with relevant knowledge to prepare security fixes.
es_es: Donde hay problemas de seguridad que afectan a muchos sistemas operativos diferentes, FreeBSD frecuentemente depende del acceso temprano para poder preparar avisos para el lanzamiento coordinado. A menos que se pueda confiar en que los desarrolladores de FreeBSD mantendrán la seguridad, dicho acceso temprano no estará disponible. El oficial de seguridad es responsable de controlar el acceso previo al lanzamiento a la información sobre vulnerabilidades y de programar el lanzamiento de todos los avisos. Puede solicitar ayuda bajo condición de confidencialidad de cualquier desarrollador con conocimientos relevantes para preparar soluciones de seguridad.

source: Communications with Core are kept confidential for as long as necessary.
es_es: Las comunicaciones con Core se mantienen confidenciales durante el tiempo que sea necesario.

source: Communications to core will initially be treated as confidential. Eventually however, most of Core's business will be summarized into the monthly or quarterly core reports. Care will be taken to avoid publicising any sensitive details. Records of some particularly sensitive subjects may not be reported on at all and will be retained only in Core's private archives.
es_es: Las comunicaciones al núcleo inicialmente se tratarán de forma confidencial. Sin embargo, con el tiempo, la mayor parte del negocio de Core se resumirá en informes básicos mensuales o trimestrales. Se tendrá cuidado de no hacer públicos los detalles sensibles. Es posible que los registros de algunos temas particularmente sensibles no se informen en absoluto y se conservarán solo en los archivos privados de Core.

source: Non-disclosure Agreements may be required for access to certain commercially sensitive data.
es_es: Es posible que se requieran acuerdos de no divulgación para acceder a ciertos datos comercialmente sensibles.

source: Access to certain commercially sensitive data may only be available under a Non-Disclosure Agreement. The FreeBSD Foundation legal staff must be consulted before any binding agreements are entered into.
es_es: El acceso a ciertos datos comercialmente sensibles solo puede estar disponible bajo un Acuerdo de confidencialidad. Se debe consultar al personal legal de la Fundación FreeBSD antes de celebrar cualquier acuerdo vinculante.

source: Private communications must not be made public without permission.
es_es: Las comunicaciones privadas no deben hacerse públicas sin permiso.

source: Beyond the specific requirements above there is a general expectation not to publish private communications between developers without the consent of all parties involved. Ask permission before forwarding a message onto a public mailing list, or posting it to a forum or website that can be accessed by other than the original correspondents.
es_es: Más allá de los requisitos específicos anteriores, existe una expectativa general de no publicar comunicaciones privadas entre desarrolladores sin el consentimiento de todas las partes involucradas. Pida permiso antes de reenviar un mensaje a una lista de correo pública o publicarlo en un foro o sitio web al que puedan acceder otras personas que no sean los corresponsales originales.

source: Communications on project-only or restricted access channels must be kept private.
es_es: Las comunicaciones en canales de acceso restringido o solo para proyectos deben mantenerse privadas.

source: Similarly to personal communications, certain internal communications channels, including FreeBSD Committer only mailing lists and restricted access IRC channels are considered private communications. Permission is required to publish material from these sources.
es_es: De manera similar a las comunicaciones personales, ciertos canales de comunicación internos, incluidas las listas de correo de FreeBSD Committer y los canales de IRC de acceso restringido, se consideran comunicaciones privadas. Se requiere permiso para publicar material de estas fuentes.

source: Core may approve publication.
es_es: Core puede aprobar la publicación.

source: Where it is impractical to obtain permission due to the number of correspondents or where permission to publish is unreasonably withheld, Core may approve release of such private matters that merit more general publication.
es_es: Cuando no sea práctico obtener permiso debido a la cantidad de corresponsales o cuando el permiso para publicar se niegue sin razón, Core puede aprobar la divulgación de tales asuntos privados que merecen una publicación más general.

source: Support for Multiple Architectures
es_es: Soporte para múltiples arquitecturas

source: FreeBSD is a highly portable operating system intended to function on many different types of hardware architectures. Maintaining clean separation of Machine Dependent (MD) and Machine Independent (MI) code, as well as minimizing MD code, is an important part of our strategy to remain agile with regards to current hardware trends. Each new hardware architecture supported by FreeBSD adds substantially to the cost of code maintenance, toolchain support, and release engineering. It also dramatically increases the cost of effective testing of kernel changes. As such, there is strong motivation to differentiate between classes of support for various architectures while remaining strong in a few key architectures that are seen as the FreeBSD <quote>target audience</quote>.
es_es: FreeBSD es un sistema operativo altamente portátil destinado a funcionar en muchos tipos diferentes de arquitecturas de hardware. Mantener una separación limpia del código dependiente de la máquina (MD) y el código independiente de la máquina (MI), así como minimizar el código MD, es una parte importante de nuestra estrategia para permanecer ágiles con respecto a las tendencias actuales de hardware. Cada nueva arquitectura de hardware soportada por FreeBSD aumenta sustancialmente el costo del mantenimiento del código, el soporte de la cadena de herramientas y la ingeniería de versiones. También aumenta drásticamente el costo de las pruebas efectivas de los cambios del kernel. Como tal, existe una fuerte motivación para diferenciar entre clases de soporte para varias arquitecturas mientras se mantiene fuerte en algunas arquitecturas clave que se ven como FreeBSD <quote>Público objetivo</quote>.

source: Statement of General Intent
es_es: Declaración de intención general

source: The FreeBSD Project targets "production quality commercial off-the-shelf (COTS) workstation, server, and high-end embedded systems". By retaining a focus on a narrow set of architectures of interest in these environments, the FreeBSD Project is able to maintain high levels of quality, stability, and performance, as well as minimize the load on various support teams on the project, such as the ports team, documentation team, security officer, and release engineering teams. Diversity in hardware support broadens the options for FreeBSD consumers by offering new features and usage opportunities, but these benefits must always be carefully considered in terms of the real-world maintenance cost associated with additional platform support.
es_es: El proyecto FreeBSD apunta a "estaciones de trabajo comerciales listas para usar (COTS) de calidad de producción, servidores y sistemas integrados de alta gama". Al mantener un enfoque en un conjunto estrecho de arquitecturas de interés en estos entornos, el Proyecto FreeBSD puede mantener altos niveles de calidad, estabilidad y rendimiento, así como minimizar la carga en varios equipos de soporte en el proyecto, como el equipo de puertos, equipo de documentación, oficial de seguridad y equipos de ingenieros de liberación. La diversidad en el soporte de hardware amplía las opciones para los consumidores de FreeBSD al ofrecer nuevas características y oportunidades de uso, pero estos beneficios siempre deben considerarse cuidadosamente en términos del costo de mantenimiento del mundo real asociado con el soporte de plataforma adicional.
