Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: As per <link xlink:href="https://people.FreeBSD.org/~peter/svn_notes.txt">https://people.FreeBSD.org/~peter/svn_notes.txt</link>, work that is intended to be merged back into HEAD should be in <filename>base/projects/</filename>. If the work is beneficial to the FreeBSD community in some way but not intended to be merged directly back into HEAD then the proper location is <filename>base/user/<replaceable>username</replaceable>/</filename>. <link xlink:href="https://svnweb.freebsd.org/base/projects/GUIDELINES.txt">This page</link> contains further details.
es_es: Según <link xlink:href="https://people.FreeBSD.org/~peter/svn_notes.txt">https://people.FreeBSD.org/~peter/svn_notes.txt</link>, el trabajo que se pretende fusionar de vuelta con HEAD debe estar en <filename>base/projects/</filename>. Si el trabajo es beneficioso para la comunidad FreeBSD de alguna manera pero no se pretende que se fusione directamente con HEAD, entonces la ubicación correcta es <filename>base/user/<replaceable>username</replaceable>/</filename>. <link xlink:href="https://svnweb.freebsd.org/base/projects/GUIDELINES.txt">This page</link> contiene más detalles.

source: To create a project branch:
es_es: Para crear una rama de proyecto:

source: To merge changes from HEAD back into the project branch:
es_es: Para fusionar los cambios de HEAD de nuevo en la rama del proyecto:

source: It is important to resolve any merge conflicts before committing.
es_es: Es importante resolver cualquier conflicto de fusión antes de comprometerse.

source: Some Tips
es_es: Algunos consejos

source: In commit logs etc., <quote>rev 179872</quote> is spelled <quote>r179872</quote> as per convention.
es_es: En los registros de envíos etc., <quote>rev 179872</quote> se escribe <quote>r179872</quote> según la convención.

source: Speeding up svn is possible by adding these entries to <filename>~/.ssh/config</filename>:
es_es: Es posible acelerar svn añadiendo estas entradas a <filename>~/.ssh/config</filename>:

source: and then typing
es_es: y luego escribiendo

source: Checking out a working copy with a stock Subversion client without FreeBSD-specific patches (<varname>OPTIONS_SET=FREEBSD_TEMPLATE</varname>) will mean that <literal>$FreeBSD$</literal> tags will not be expanded. Once the correct version has been installed, trick Subversion into expanding them like so:
es_es: Comprobar una copia de trabajo con un cliente stock de Subversion sin parches específicos de FreeBSD (<varname>OPTIONS_SET=FREEBSD_TEMPLATE</varname>) significará que las etiquetas <literal>$FreeBSD$</literal> no se expandirán. Una vez que se ha instalado la versión correcta, engañe a Subversion para que las expanda así:

source: This will wipe out uncommitted patches.
es_es: Esto eliminará los parches no confirmados.

source: It is possible to automatically fill the "Sponsored by" and "MFC after" commit log fields by setting "freebsd-sponsored-by" and "freebsd-mfc-after" fields in the "[miscellany]" section of the <filename>~/.subversion/config</filename> configuration file. For example:
es_es: Es posible rellenar automáticamente los campos de registro de envíos "Patrocinado por" y "MFC después" configurando los campos "freebsd-sponsored-by" y "freebsd-mfc-after" en la sección "[miscellany]" del archivo de configuración <filename>~/.subversion/config</filename>. Por ejemplo:

source: Setup, Conventions, and Traditions
es_es: Configuración, Convenciones y Tradiciones

source: There are a number of things to do as a new developer. The first set of steps is specific to committers only. These steps must be done by a mentor for those who are not committers.
es_es: Hay una serie de cosas que hacer como nuevo desarrollador. La primera serie de pasos es específica para los committers solamente. Estos pasos deben ser realizados por un mentor para aquellos que no son committers.

source: For New Committers
es_es: Para los Nuevos Committers

source: Those who have been given commit rights to the FreeBSD repositories must follow these steps.
es_es: Aquellos a los que se les han concedido derechos de envío a los repositorios de FreeBSD deben seguir estos pasos.

source: Get mentor approval before committing each of these changes!
es_es: ¡Obtenga la aprobación de los mentores antes de realizar cada uno de estos cambios!

source: The <filename>.ent</filename> and <filename>.xml</filename> files mentioned below exist in the FreeBSD Documentation Project SVN repository at <literal>svn+ssh://repo.FreeBSD.org/doc/</literal>.
es_es: Los archivos <filename>.ent</filename> y <filename>.xml</filename> mencionados a continuación existen en el repositorio SVN del Proyecto de Documentación de FreeBSD en <literal>svn+ssh://repo.FreeBSD.org/doc/</literal>.

source: New files that do not have the <literal>FreeBSD=%H</literal> <command>svn:keywords</command> property will be rejected when attempting to commit them to the repository. Be sure to read <xref linkend="svn-daily-use-adding-and-removing"/> regarding adding and removing files. Verify that <filename>~/.subversion/config</filename> contains the necessary <quote>auto-props</quote> entries from <filename>auto-props.txt</filename> mentioned there.
es_es: Los nuevos ficheros que no tengan la propiedad <literal>FreeBSD=%H</literal> <command>svn:keywords</command> serán rechazados cuando se intente enviarlos al repositorio. Asegúrese de leer <xref linkend="svn-daily-use-adding-and-removing"/> con respecto a la adición y eliminación de archivos. Compruebe que <filename>~/.subversion/config</filename> contiene las entradas <quote>auto-props</quote> necesarias de <filename>auto-props.txt</filename> mencionadas allí.

source: All <filename>src</filename> commits go to FreeBSD-CURRENT first before being merged to FreeBSD-STABLE. The FreeBSD-STABLE branch must maintain <acronym>ABI</acronym> and <acronym>API</acronym> compatibility with earlier versions of that branch. Do not merge changes that break this compatibility.
es_es: Todas las confirmaciones <filename>src</filename> van primero a FreeBSD-CURRENT antes de ser fusionadas con FreeBSD-STABLE. La rama FreeBSD-STABLE debe mantener la compatibilidad <acronym>ABI</acronym> y <acronym>API</acronym> con versiones anteriores de esa rama. No fusione los cambios que rompan esta compatibilidad.

source: Steps for New Committers
es_es: Pasos para los Nuevos Committers

source: Add an Author Entity
es_es: Añadir una Entidad de Autor

source: <filename>doc/head/share/xml/authors.ent</filename> — Add an author entity. Later steps depend on this entity, and missing this step will cause the <filename>doc/</filename> build to fail. This is a relatively easy task, but remains a good first test of version control skills.
es_es: <filename>doc/head/share/xml/authors.ent</filename> — Añadir una entidad de autor. Los pasos posteriores dependen de esta entidad, y la falta de este paso hará que el proceso de construcción de <filename>doc/</filename> falle. Esta es una tarea relativamente fácil, pero sigue siendo una buena primera prueba de las habilidades acerca del control de versiones.

source: Update the List of Developers and Contributors
es_es: Actualizar la lista de Desarrolladores y Colaboradores

source: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.committers.xml</filename> — Add an entry to the <quote>Developers</quote> section of the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/staff-committers.html">Contributors List</link>. Entries are sorted by last name.
es_es: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.committers.xml</filename> — Añada una entrada a la sección <quote>Desarrolladores</quote> de la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/staff-committers.html">Lista de colaboradores</link>. Las entradas están ordenadas por apellido.

source: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename> — <emphasis>Remove</emphasis> the entry from the <quote>Additional Contributors</quote> section. Entries are sorted by first name.
es_es: <filename>doc/head/en_US.ISO8859-1/articles/contributors/contrib.additional.xml</filename> — <emphasis>Elimine</emphasis> la entrada de la sección <quote>Colaboradores Adicionales</quote>. Las entradas se clasifican por nombre.

source: Add a News Item
es_es: Añadir una entrada de Novedades

source: <filename>doc/head/share/xml/news.xml</filename> — Add an entry. Look for the other entries that announce new committers and follow the format. Use the date from the commit bit approval email from <email>core@FreeBSD.org</email>.
es_es: <filename>doc/head/share/xml/news.xml</filename> — Añadir una entrada. Busque las otras entradas que anuncian nuevos committers y siga el formato. Use la fecha del correo electrónico de aprobación de <email>core@FreeBSD.org</email>.

source: Add a <acronym>PGP</acronym> Key
es_es: Agregue una clave <acronym>PGP</acronym>

source: <filename>doc/head/share/pgpkeys/pgpkeys.ent</filename> and <filename>doc/head/share/pgpkeys/pgpkeys-developers.xml</filename> - Add your <acronym>PGP</acronym> or Gnu<acronym>PG</acronym> key. Those who do not yet have a key should see <xref linkend="pgpkeys-creating"/>.
es_es: <filename>doc/head/share/pgpkeys/pgpkeys.ent</filename> y <filename>doc/head/share/pgpkeys/pgpkeys-developers.xml</filename> - Añada su clave <acronym>PGP</acronym> o Gnu<acronym>PG</acronym>. Aquellos que aún no tienen una clave deben ver <xref linkend="pgpkeys-creating"/>.

source: Dag-Erling Smørgrav <email>des@FreeBSD.org</email> has written a shell script (<filename>doc/head/share/pgpkeys/addkey.sh</filename>) to make this easier. See the <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/pgpkeys/README">README</link> file for more information.
es_es: Dag-Erling Smørgrav <email>des@FreeBSD.org</email> ha escrito un script (<filename>doc/head/share/pgpkeys/addkey.sh</filename>) para hacer esto más fácil. Para más información, consulte el archivo <link xlink:href="http://svnweb.FreeBSD.org/doc/head/share/pgpkeys/README">README</link>.

source: Use <filename>doc/head/share/pgpkeys/checkkey.sh</filename> to verify that keys meet minimal best-practices standards.
es_es: Utilice <filename>doc/head/share/pgpkeys/checkkey.sh</filename> para verificar que las claves cumplen con los estándares mínimos de mejores prácticas.

source: After adding and checking a key, add both updated files to source control and then commit them. Entries in this file are sorted by last name.
es_es: Después de añadir y comprobar una clave, añada ambos archivos actualizados al control de fuente y, a continuación, confírmelos. Las entradas en este archivo están ordenadas por apellido.

source: It is very important to have a current <acronym>PGP</acronym>/Gnu<acronym>PG</acronym> key in the repository. The key may be required for positive identification of a committer. For example, the FreeBSD Administrators <email>admins@FreeBSD.org</email> might need it for account recovery. A complete keyring of <systemitem class="fqdomainname">FreeBSD.org</systemitem> users is available for download from <link xlink:href="@@URL_RELPREFIX@@/doc/pgpkeyring.txt">https://www.FreeBSD.org/doc/pgpkeyring.txt</link>.
es_es: Es muy importante tener una clave <acronym>PGP</acronym>/Gnu<acronym>PG</acronym> actualizada en el repositorio. La clave puede ser necesaria para la identificación positiva de un committer. Por ejemplo, los administradores de FreeBSD <email>admins@FreeBSD.org</email> podrían necesitarlo para recuperar la cuenta. Un juego de llaves completo de los usuarios de <systemitem class="fqdomainname">FreeBSD.org</systemitem> está disponible para su descarga en <link xlink:href="@@URL_RELPREFIX@@/doc/pgpkeyring.txt">https://www.FreeBSD.org/doc/pgpkeyring.txt</link>.

source: Update Mentor and Mentee Information
es_es: Actualizar la Información del Mentor y del Aprendiz.

source: <filename>base/head/share/misc/committers-<replaceable>repository</replaceable>.dot</filename> — Add an entry to the current committers section, where <replaceable>repository</replaceable> is <literal>doc</literal>, <literal>ports</literal>, or <literal>src</literal>, depending on the commit privileges granted.
es_es: <filename>base/head/share/misc/committers-<replaceable>repositorio</replaceable>.dot</filename> — Añada una entrada a la sección actual de committers, donde <replaceable>repositorio</replaceable> es <literal>doc</literal>, <literal>ports</literal>, o <literal>src</literal>, dependiendo de los privilegios concedidos al envío.

source: Add an entry for each additional mentor/mentee relationship in the bottom section.
es_es: Agregue una entrada para cada relación adicional de mentor/aprendiz en la sección inferior.

source: Generate a <application>Kerberos</application> Password
es_es: Generar una Contraseña <application>Kerberos</application>

source: See <xref linkend="kerberos-ldap"/> to generate or set a <application>Kerberos</application> for use with other FreeBSD services like the bug tracking database.
es_es: Vea <xref linkend="kerberos-ldap"/> para generar o configurar un <application>Kerberos</application> para su uso con otros servicios de FreeBSD como la base de datos de seguimiento de errores.

source: Optional: Enable Wiki Account
es_es: Opcional: Habilitar Cuenta Wiki

source: <link xlink:href="https://wiki.freebsd.org">FreeBSD Wiki</link> Account — A wiki account allows sharing projects and ideas. Those who do not yet have an account can follow instructions on the <link xlink:href="https://wiki.freebsd.org/AboutWiki">AboutWiki Page</link> to obtain one. Contact <email>wiki-admin@FreeBSD.org</email> if you need help with your Wiki account.
es_es: <link xlink:href="https://wiki.freebsd.org">FreeBSD Wiki</link> Cuenta - Una cuenta wiki permite compartir proyectos e ideas. Aquellos que aún no tienen una cuenta pueden seguir las instrucciones en el <link xlink:href="https://wiki.freebsd.org/AboutWiki">Página AboutWiki</link> para obtener una. Contacte con <email>wiki-admin@FreeBSD.org</email> si necesita ayuda con su cuenta Wiki.

source: Optional: Update Wiki Information
es_es: Opcional: Actualizar la Información de la Wiki

source: Wiki Information - After gaining access to the wiki, some people add entries to the <link xlink:href="https://wiki.freebsd.org/HowWeGotHere">How We Got Here</link>, <link xlink:href="https://wiki.freebsd.org/IRC/Nicknames">IRC Nicks</link>, and <link xlink:href="https://wiki.freebsd.org/Community/Dogs"> Dogs of FreeBSD</link> pages.
es_es: Información Wiki - Después de acceder al wiki, algunas personas añaden entradas a las páginas <link xlink:href="https://wiki.freebsd.org/HowWeGotHere">Cómo llegamos aquí</link>, <link xlink:href="https://wiki.freebsd.org/IRC/Nicknames">IRC Nicks</link>, y <link xlink:href="https://wiki.freebsd.org/Community/Dogs"> Dogs of FreeBSD</link>.

source: Optional: Update Ports with Personal Information
es_es: Opcional: Actualizar Puertos con Información Personal

source: <filename>ports/astro/xearth/files/freebsd.committers.markers</filename> and <filename>src/usr.bin/calendar/calendars/calendar.freebsd</filename> - Some people add entries for themselves to these files to show where they are located or the date of their birthday.
es_es: <filename>ports/astro/xearth/files/freebsd.committers.markers</filename> y <filename>src/usr.bin/calendar/calendars/calendar.freebsd</filename> - Algunas personas añaden entradas para sí mismas a estos archivos para mostrar dónde se encuentran o la fecha de su cumpleaños.

source: Optional: Prevent Duplicate Mailings
es_es: Opcional: Prevenir Correos Duplicados

source: Subscribers to <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> or <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> might wish to unsubscribe to avoid receiving duplicate copies of commit messages and followups.
es_es: Los suscriptores de <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-src-all">svn-src-all</link>, <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-ports-all">svn-ports-all</link> o a <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/svn-doc-all">svn-doc-all</link> podrían darse de baja para evitar recibir copias duplicadas de los mensajes de envíos y seguimiento.

source: For Everyone
es_es: Para Todos

source: Introduce yourself to the other developers, otherwise no one will have any idea who you are or what you are working on. The introduction need not be a comprehensive biography, just write a paragraph or two about who you are, what you plan to be working on as a developer in FreeBSD, and who will be your mentor. Email this to the FreeBSD developers mailing list and you will be on your way!
es_es: Preséntese a los otros desarrolladores, de lo contrario nadie tendrá idea de quién es usted o en qué está trabajando. La introducción no tiene por qué ser una biografía exhaustiva, sólo tiene que escribir uno o dos párrafos sobre quién es usted, en qué piensa trabajar como desarrollador en FreeBSD y quién será su mentor. Envíe este mensaje a la lista de correo de desarrolladores de FreeBSD y ¡estará en camino!

source: Log into <systemitem>freefall.FreeBSD.org</systemitem> and create a <filename>/var/forward/<replaceable>user</replaceable></filename> (where <replaceable>user</replaceable> is your username) file containing the e-mail address where you want mail addressed to <replaceable>yourusername</replaceable>@FreeBSD.org to be forwarded. This includes all of the commit messages as well as any other mail addressed to the FreeBSD committer's mailing list and the FreeBSD developers mailing list. Really large mailboxes which have taken up permanent residence on <systemitem>freefall</systemitem> may get truncated without warning if space needs to be freed, so forward it or save it elsewhere.
es_es: Inicie sesión en<systemitem>freefall.FreeBSD.org</systemitem> y cree un archivo <filename>/var/forward/<replaceable>usuario</replaceable></filename> (donde <replaceable>usuario</replaceable> es su nombre de usuario) que contenga la dirección de correo electrónico a la que desea que se reenvíe el correo dirigido a <replaceable>su nombre de usuario</replaceable>@FreeBSD.org. Esto incluye todos los mensajes de envío, así como cualquier otro correo dirigido a la lista de correo de committers de FreeBSD y a la lista de correo de los desarrolladores de FreeBSD. Los buzones de correo realmente grandes que han fijado su residencia permanente en <systemitem>freefall</systemitem> pueden quedar truncados sin previo aviso si es necesario liberar espacio, así que reenvíelo o guárdelo en otro lugar.

source: If your e-mail system uses SPF with strict rules, you should whitelist <systemitem class="fqdomainname">mx2.FreeBSD.org</systemitem> from SPF checks.
es_es: Si su sistema de correo electrónico usa SPF con reglas estrictas, debe hacer una lista blanca en <systemitem class="fqdomainname">mx2.FreeBSD.org</systemitem> de las comprobaciones de SPF.

source: Due to the severe load dealing with SPAM places on the central mail servers that do the mailing list processing, the front-end server does do some basic checks and will drop some messages based on these checks. At the moment proper DNS information for the connecting host is the only check in place but that may change. Some people blame these checks for bouncing valid email. To have these checks turned off for your email, create a file named <filename>~/.spam_lover</filename> on <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.
es_es: Debido a la severa carga que implica el manejo de los lugares de SPAM en los servidores de correo centrales que realizan el procesamiento de las listas de correo, el servidor de entrada realiza algunas comprobaciones básicas y dejará caer algunos mensajes basados en estas comprobaciones. Por el momento, la única comprobación que existe es la información DNS adecuada para el host que se conecta, pero eso puede cambiar. Algunas personas culpan a estos cheques por rebotar correos electrónicos válidos. Para desactivar estas comprobaciones en su correo electrónico, cree un archivo llamado <filename>~/.spam_lover</filename> en <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem>.

source: Those who are developers but not committers will not be subscribed to the committers or developers mailing lists. The subscriptions are derived from the access rights.
es_es: Aquellos que son desarrolladores pero no son committers no serán suscritos a las listas de correo de committers o desarrolladores. Las suscripciones se derivan de los derechos de acceso.

source: SMTP Access Setup
es_es: Configuración de acceso SMTP

source: For those willing to send e-mail messages through the FreeBSD.org infrastructure, follow the instructions below:
es_es: Para aquellos que deseen enviar mensajes de correo electrónico a través de la infraestructura de FreeBSD.org, sigan las siguientes instrucciones:

source: Point your mail client at <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal>.
es_es: Indica a tu cliente de correo en <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal>.

source: Enable STARTTLS.
es_es: Activa STARTTLS.

source: Ensure your <literal>From:</literal> address is set to <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>.
es_es: Asegúrate de que tu dirección <literal>Desde:</literal> esté en <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>.

source: For authentication, you can use your FreeBSD Kerberos username and password (see <xref linkend="kerberos-ldap"/>). The <literal><replaceable>yourusername</replaceable>/mail</literal> principal is preferred, as it is only valid for authenticating to mail resources.
es_es: para la autenticación, puede utilizar su nombre de usuario y contraseña de FreeBSD Kerberos (consulte <xref linkend="kerberos-ldap"/>). El <literal><replaceable>yourusername</replaceable>mail</literal> Se prefiere principal, ya que solo es válido para autenticarse en los recursos de correo.

source: Do not include <literal>@FreeBSD.org</literal> when entering in your username.
es_es: No incluyas <literal>@FreeBSD.org</literal> al introducir tu nombre de usuario.

source: Additional Notes
es_es: Notas adicionales

source: Will only accept mail from <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>. If you are authenticated as one user, you are not permitted to send mail from another.
es_es: Solo aceptará correo de <literal><replaceable>yourusername</replaceable>@FreeBSD.org</literal>. Si está autenticado como un usuario, no se le permite enviar correo desde otro.

source: A header will be appended with the SASL username: (<literal>Authenticated sender: <replaceable>username</replaceable></literal>).
es_es: Se agregará un encabezado con el nombre de usuario SASL: (<literal>Remitente autenticado:<replaceable>usuario</replaceable></literal>).

source: Host has various rate limits in place to cut down on brute force attempts.
es_es: El anfitrión tiene varios límites de tasa para reducir los intentos de fuerza bruta.

source: Using a Local MTA to Forward Emails to the FreeBSD.org SMTP Service
es_es: Uso de un MTA local para reenviar correos electrónicos al servicio SMTP de FreeBSD.org

source: It is also possible to use a local <acronym>MTA</acronym> to forward locally sent emails to the FreeBSD.org SMTP servers.
es_es: También es posible usar un <acronym>MTA</acronym> local para reenviar los correos electrónicos enviados localmente a los servidores SMTP de FreeBSD.org.
