Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: Though the remaining examples in this document are written with the workflow of working with the <literal>src</literal> tree in mind, the underlying concepts are the same for working with the <literal>doc</literal> and the <literal>ports</literal> tree. Ports related Subversion operations are listed in <xref linkend="ports"/>.
es_es: Aunque los ejemplos que se mostrarán en el resto del documento están escritos teniendo en mente el flujo de trabajo haciendo uso del repositorio <literal>src</literal>, los conceptos son los mismos para trabajar con los repositorios de <literal>doc</literal> y <literal>ports</literal>. Las acciones de Subversion relacionadas con los ports se enumeran en <xref linkend="ports"/>.

source: The above command will check out a <literal>CURRENT</literal> source tree as <filename><replaceable>/usr/src/</replaceable></filename>, which can be any target directory on the local filesystem. Omitting the final argument of that command causes the working copy, in this case, to be named <quote>head</quote>, but that can be renamed safely.
es_es: El comando anterior realizará un check out de <literal>CURRENT</literal> en el directorio <filename><replaceable>/usr/src/</replaceable></filename>, el cual puede ser cualquier directorio en el sistema de archivos local. Omitir el argumento final del comando hará que el directorio, en este caso, se denomine <quote>head</quote>, pero se puede renombrar sin ningún problema.

source: <literal>svn+ssh</literal> means the <acronym>SVN</acronym> protocol tunnelled over <acronym>SSH</acronym>. The name of the server is <literal>repo.freebsd.org</literal>, <literal>base</literal> is the path to the repository, and <literal>head</literal> is the subdirectory within the repository.
es_es: <literal>svn+ssh</literal> significa que el protocolo <acronym>SVN</acronym> se ejecutará mediante un tunel sobre <acronym>SSH</acronym>. El nombre del servidor es <literal>repo.freebsd.org</literal>, <literal>base</literal>es la ruta al repositorio y <literal>head</literal> es el subdirectorio dentro del repositorio.

source: If your FreeBSD login name is different from the login name used on the local machine, either include it in the <acronym>URL</acronym> (for example <literal>svn+ssh://jarjar@repo.freebsd.org/base/head</literal>), or add an entry to <filename>~/.ssh/config</filename> in the form:
es_es: Si su nombre de login en FreeBSD es diferente al nombre utilizado para iniciar sesión en su ordenador local, inclúyalo en la <acronym>URL</acronym> (por ejemplo <literal>svn+ssh://jarjar@repo.freebsd.org/base/head</literal>), o agregue una entrada en el archivo <filename>~/.ssh/config</filename> con el siguiente formato:

source: This is the simplest method, but it is hard to tell just yet how much load it will place on the repository.
es_es: Este es el método más simple, pero es difícil saber qué carga generará en el repositorio.

source: The <command>svn diff</command> does not require access to the server as <acronym>SVN</acronym> stores a reference copy of every file in the working copy. This, however, means that Subversion working copies are very large in size.
es_es: El comando <command>svn diff</command> no requiere acceso al servidor, ya que <acronym>SVN</acronym> almacena una copia de referencia de cada archivos en la copia de trabajo local. Sin embargo, esto significa que las copias de trabajo locales de Subversion tienen un tamaño muy grande.

source: <literal>RELENG_*</literal> Branches and General Layout
es_es: Ramas <literal>RELENG_*</literal> y estructura general

source: In <literal>svn+ssh://repo.freebsd.org/base</literal>, <emphasis>base</emphasis> refers to the source tree. Similarly, <emphasis>ports</emphasis> refers to the ports tree, and so on. These are separate repositories with their own change number sequences, access controls and commit mail.
es_es: En <literal>svn+ssh://repo.freebsd.org/base</literal>, <emphasis>base</emphasis> hace referencia al árbol del código fuente. Del mismo modo, ports hace referencia al árbol del código fuente de los <emphasis>ports</emphasis>, y así sucesivamente. Estos repositorios están separados, cada uno con sus propias secuencias númericas de cambios, controles de acceso y correo electrónico de confirmación.

source: For the base repository, HEAD refers to the -CURRENT tree. For example, <filename>head/bin/ls</filename> is what would go into <filename>/usr/src/bin/ls</filename> in a release. Some key locations are:
es_es: Para el repositorio base, HEAD se refiere al árbol -CURRENT. Por ejemplo, <filename>head/bin/ls</filename> es lo que iría en <filename>/usr/src/bin/ls</filename> en una versión. Algunas de las ubicaciones clave son:

source: <emphasis>/head/</emphasis> which corresponds to <literal>HEAD</literal>, also known as <literal>-CURRENT</literal>.
es_es: <emphasis>/head/</emphasis> hace referencia a <literal>HEAD</literal>, también conocido como <literal>-CURRENT</literal>.

source: <emphasis>/stable/<replaceable>n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n</replaceable></literal>.
es_es: <emphasis>/stable/<replaceable>n</replaceable></emphasis> hace referencia a <literal>RELENG_<replaceable>n</replaceable></literal>.

source: <emphasis>/releng/<replaceable>n.n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n</replaceable></literal>.
es_es: <emphasis>/releng/<replaceable>n.n</replaceable></emphasis> hace referencia a <literal>RELENG_<replaceable>n_n</replaceable></literal>.

source: <emphasis>/release/<replaceable>n.n.n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n_n</replaceable>_RELEASE</literal>.
es_es: <emphasis>/release/<replaceable>n.n.n</replaceable></emphasis> hace referencia a <literal>RELENG_<replaceable>n_n_n</replaceable>_RELEASE</literal>.

source: <emphasis>/vendor*</emphasis> is the vendor branch import work area. This directory itself does not contain branches, however its subdirectories do. This contrasts with the <emphasis>stable</emphasis>, <emphasis>releng</emphasis> and <emphasis>release</emphasis> directories.
es_es: <emphasis>/vendor*</emphasis> es la rama de trabajo en al cual importar software de otros proyectos. El directorio en si no contiene ramas, sin embargo, sus subdirectorios sí. Esto contrasta con los directorios <emphasis>stable</emphasis>, <emphasis>releng</emphasis> y <emphasis>release</emphasis>.

source: <emphasis>/projects</emphasis> and <emphasis>/user</emphasis> feature a branch work area. As above, the <emphasis>/user</emphasis> directory does not contain branches itself.
es_es: <emphasis>/projects</emphasis> y <emphasis>/user</emphasis> cuentan con un área de trabajo en ramas. Como antes, el directorio <emphasis>/user</emphasis> no contiene ramas en sí.

source: FreeBSD Documentation Project Branches and Layout
es_es: Ramas y estructura del proyecto de documentación de FreeBSD

source: In <literal>svn+ssh://repo.freebsd.org/doc</literal>, <emphasis>doc</emphasis> refers to the repository root of the source tree.
es_es: En <literal>svn+ssh://repo.freebsd.org/doc</literal>, <emphasis>doc</emphasis> hace referencia a la raíz del repositorio.

source: In general, most FreeBSD Documentation Project work will be done within the <filename>head/</filename> branch of the documentation source tree.
es_es: En general, la mayor parte del trabajo del proyecto de documentación de FreeBSD se realiza en la rama <filename>head/</filename> del repositorio de documentación.

source: FreeBSD documentation is written and/or translated to various languages, each in a separate directory in the <filename>head/</filename> branch.
es_es: La documentación de FreeBSD está escrita y/o traducida a varios idiomas, cada uno separado en un directorio en la rama <filename>head/</filename>.

source: Each translation set contains several subdirectories for the various parts of the FreeBSD Documentation Project. A few noteworthy directories are:
es_es: Cada conjunto de traducciones contiene varios subdirectorios para las distintas partes del proyecto de documentación de FreeBSD. Algunos de los directorios más importantes son:

source: <emphasis>/articles/</emphasis> contains the source code for articles written by various FreeBSD contributors.
es_es: <emphasis>/articles/</emphasis> contiene el código fuente de los artículos escritos por varios colaboradores de FreeBSD.

source: <emphasis>/books/</emphasis> contains the source code for the different books, such as the FreeBSD Handbook.
es_es: <emphasis>/books/</emphasis> contiene el código fuente de los diferentes libros, como el Handbook de FreeBSD.

source: <emphasis>/htdocs/</emphasis> contains the source code for the FreeBSD website.
es_es: <emphasis>/htdocs/</emphasis> contiene el código fuente del sitio web de FreeBSD.

source: FreeBSD Ports Tree Branches and Layout
es_es: Ramas y estructura del árbol de ports de FreeBSD

source: In <literal>svn+ssh://repo.freebsd.org/ports</literal>, <emphasis>ports</emphasis> refers to the repository root of the ports tree.
es_es: En <literal>svn+ssh://repo.freebsd.org/ports</literal>, <emphasis>ports</emphasis> hace referencia a la raíz del repositorio de ports.

source: In general, most FreeBSD port work will be done within the <filename>head/</filename> branch of the ports tree which is the actual ports tree used to install software. Some other key locations are:
es_es: En general, la mayor parte del trabajo en la colección de ports de FreeBSD se realizará en la rama <filename>head/</filename>, que es el árbol de ports que se utiliza para instalar software. Algunas otras ubicaciones clave son:

source: <emphasis>/branches/RELENG_<replaceable>n_n_n</replaceable></emphasis> which corresponds to <literal>RELENG_<replaceable>n_n_n</replaceable></literal> is used to merge back security updates in preparation for a release.
es_es: <emphasis>/branches/RELENG_<replaceable>n_n_n</replaceable></emphasis> la cual hace referencia a <literal>RELENG_<replaceable>n_n_n</replaceable></literal> se utilizan para hacer el merge de actualizaciones de seguridad para su posterior release.

source: <emphasis>/tags/RELEASE_<replaceable>n_n_n</replaceable></emphasis> which corresponds to <literal>RELEASE_<replaceable>n_n_n</replaceable></literal> represents a release tag of the ports tree.
es_es: <emphasis>/tags/RELEASE_<replaceable>n_n_n</replaceable></emphasis> la cual hace referencia a <literal>RELEASE_<replaceable>n_n_n</replaceable></literal> representa un tag en el repositorio de ports.

source: <emphasis>/tags/RELEASE_<replaceable>n</replaceable>_EOL</emphasis> represents the end of life tag of a specific FreeBSD branch.
es_es: <emphasis>/tags/RELEASE_<replaceable>n</replaceable>_EOL</emphasis> representa de end of life tag de una rama especifica de FreeBSD.

source: Daily Use
es_es: Uso diario

source: This section will explain how to perform common day-to-day operations with Subversion.
es_es: Esta sección explicará cómo realizar operaciones diarias comunes con Subversion.

source: Help
es_es: Ayuda

source: <acronym>SVN</acronym> has built in help documentation. It can be accessed by typing:
es_es: <acronym>SVN</acronym> tiene ayuda incorporada. Puede acceder a ella ejecutando el comando:

source: Additional information can be found in the <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.
es_es: Puede encontrar información adicional en <link xlink:href="http://svnbook.red-bean.com/">el libro de Subversion</link>.

source: As seen earlier, to check out the FreeBSD head branch:
es_es: Como se ha visto antes, para hacer un checkout de la rama head de FreeBSD:

source: At some point, more than just <literal>HEAD</literal> will probably be useful, for instance when merging changes to stable/7. Therefore, it may be useful to have a partial checkout of the complete tree (a full checkout would be very painful).
es_es: En algún momento, probablemente será útil no sólo <literal>HEAD</literal>, por ejemplo cuando se fusionen los cambios a stable/7. Por lo tanto, puede ser útil tener una comprobación parcial del árbol completo (una comporobación completa sería muy trabajoso).

source: To do this, first check out the root of the repository:
es_es: Para hacer esto, primero compruebe la raíz del repositorio:

source: <prompt>%</prompt> <userinput>svn checkout --depth=immediates svn+ssh://repo.freebsd.org/base</userinput>
es_es: <prompt>%</prompt> <userinput>comprobación de svn --depth=inmediata svn+ssh://repo.freebsd.org/base</userinput>

source: This will give <literal>base</literal> with all the files it contains (at the time of writing, just <filename>ROADMAP.txt</filename>) and empty subdirectories for <literal>head</literal>, <literal>stable</literal>, <literal>vendor</literal> and so on.
es_es: Esto dará <literal>base</literal> con todos los archivos que contiene (en este momento, sólo <filename>ROADMAP.txt</filename>) y subdirectorios vacíos para <literal>head</literal>, <literal>stable</literal>, <literal>vendor</literal>, etc.

source: Expanding the working copy is possible. Just change the depth of the various subdirectories:
es_es: Es posible extender la copia de trabajo. Basta con cambiar la profundidad de los diferentes subdirectorios:

source: The above command will pull down a full copy of <literal>head</literal>, plus empty copies of every <literal>release</literal> tag, every <literal>releng</literal> branch, and every <literal>stable</literal> branch.
es_es: El comando anterior bajará una copia completa de <literal>head</literal>, más copias vacías de cada etiqueta <literal>release</literal>, cada rama <literal>releng</literal> y cada rama <literal>stable</literal>.

source: If at a later date merging to <literal>7-STABLE</literal> is required, expand the working copy:
es_es: Si en una fecha posterior se requiere fusionar a <literal>7-STABLE</literal>, extienda la copia de trabajo:

source: Subtrees do not have to be expanded completely. For instance, expanding only <literal>stable/7/sys</literal> and then later expand the rest of <literal>stable/7</literal>:
es_es: No es necesario extender completamente los subárboles. Por ejemplo, expandiendo sólo <literal>stable/7/sys</literal> y luego expandiendo el resto de <literal>stable/7</literal>:

source: Updating the tree with <command>svn update</command> will only update what was previously asked for (in this case, <literal>head</literal> and <literal>stable/7</literal>; it will not pull down the whole tree.
es_es: Actualizar el árbol con <command>svn update</command> sólo actualizará lo que se solicitó previamente (en este caso, <literal>head</literal> y <literal>stable/7</literal>; no bajará todo el árbol.

source: Anonymous Checkout
es_es: Comprobación anónima

source: It is possible to anonymously check out the FreeBSD repository with Subversion. This will give access to a read-only tree that can be updated, but not committed back to the main repository. To do this, use:
es_es: Es posible comprobar anónimamente el repositorio de FreeBSD con Subversion. Esto dará acceso a un árbol de sólo lectura que puede ser actualizado, pero que no puede ser enviado de vuelta al repositorio principal. Para ello, utilic

source: More details on using Subversion this way can be found in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Using Subversion</link>.
es_es: Puede encontrar más detalles sobre el uso de Subversion de esta forma en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/svn.html">Usando Subversion</link>.

source: Updating the Tree
es_es: Actualización del árbol

source: To update a working copy to either the latest revision, or a specific revision:
es_es: Para actualizar una copia de trabajo a la última revisión, o a una revisión específica:

source: Status
es_es: Estado

source: To view the local changes that have been made to the working copy:
es_es: Para ver los cambios locales que se han hecho en la copia de trabajo:

source: To show local changes and files that are out-of-date do:
es_es: Para mostrar los cambios locales y los archivos que están desactualizados haga lo siguiente:

source: Editing and Committing
es_es: Editando y Enviando

source: <acronym>SVN</acronym> does not need to be told in advance about file editing.
es_es: No es necesario avisar de con antelación a <acronym>SVN</acronym> sobre la edición de archivos.

source: To commit all changes in the current directory and all subdirectories:
es_es: Para incorporar todos los cambios en el directorio actual y en todos los subdirectorios:

source: To commit all changes in, for example, <filename><replaceable>lib/libfetch/</replaceable></filename> and <filename><replaceable>usr/bin/fetch/</replaceable></filename> in a single operation:
es_es: Para enviar todos los cambios a, por ejemplo, <filename><replaceable>lib/libfetch/</replaceable></filename> y <filename><replaceable>usr/bin/fetch/</replaceable></filename> en una sola operación:

source: There is also a commit wrapper for the ports tree to handle the properties and sanity checking the changes:
es_es: También hay una capa protectora para los envíos para que el árbol de ports maneje las propiedades y comprobar el buen estado de los cambios:

source: Adding and Removing Files
es_es: Adición y eliminación de archivos

source: Before adding files, get a copy of <link xlink:href="https://people.FreeBSD.org/~peter/auto-props.txt">auto-props.txt</link> (there is also a <link xlink:href="https://people.FreeBSD.org/~beat/cvs2svn/auto-props.txt"> ports tree specific version</link>) and add it to <filename>~/.subversion/config</filename> according to the instructions in the file. If you added something before reading this, use <command>svn rm --keep-local</command> for just added files, fix your config file and re-add them again. The initial config file is created when you first run a svn command, even something as simple as <command>svn help</command>.
es_es: Antes de añadir un archivo, consiga una copia de <link xlink:href="https://people.FreeBSD.org/~peter/auto-props.txt">auto-props.txt</link> (también hay un <link xlink:href="https://people.FreeBSD.org/~beat/cvs2svn/auto-props.txt"> ports tree specific version</link>) y añádalo a <filename>~/.subversion/config</filename> de acuerdo con las instrucciones del archivo. Si añadió algo antes de leer esto, use <command>svn rm --keep-local</command> para los archivos añadidos, arregle su archivo de configuración y añadalos de nuevo. El archivo inicial de configuración se crea cuando ejecuta por primera vez el comando svn, incluso algo tan simple como <command>svn help</command>.

source: Files are added to a <acronym>SVN</acronym> repository with <command>svn add</command>. To add a file named <emphasis>foo</emphasis>, edit it, then:
es_es: Los archivos se añaden al repositorio <acronym>SVN</acronym> con <command>svn add</command>. Para añadir un archivo con nombre <emphasis>foo</emphasis>, edítelo y después:

source: Most new source files should include a <literal>$FreeBSD$</literal> string near the start of the file. On commit, <command>svn</command> will expand the <literal>$FreeBSD$</literal> string, adding the file path, revision number, date and time of commit, and the username of the committer. Files which cannot be modified may be committed without the <literal>$FreeBSD$</literal> string.
es_es: La mayoría de los nuevos archivos fuente deben incluir una cadena <literal>$FreeBSD$</literal> cerca del inicio del archivo. En el envío, <command>svn</command> expandirá la cadena <literal>$FreeBSD$</literal>, añadiendo la ruta del archivo, el número de revisión, la fecha y la hora de la confirmación, y el nombre de usuario del committer. Los archivos que no se pueden modificar se pueden enviar sin la cadena <literal>$FreeBSD$</literal>.

source: Files can be removed with <command>svn remove</command>:
es_es: Los archivos se pueden eliminar con <command>svn remove</command>:

source: <prompt>%</prompt> <userinput>svn remove <replaceable>foo</replaceable></userinput>
es_es: <prompt>%</prompt> <userinput>svn add <replaceable>foo</replaceable></userinput>

source: Subversion does not require deleting the file before using <command>svn rm</command>, and indeed complains if that happens.
es_es: Subversion no requiere borrar el fichero antes de usar <command>svn rm</command>, y de hecho se queja si eso ocurre

source: It is possible to add directories with <command>svn add</command>:
es_es: Es posible añadir directorios con <command>svn add</command>:

source: Although <command>svn mkdir</command> makes this easier by combining the creation of the directory and the adding of it:
es_es: Aunque <command>svn mkdir</command> lo hace más fácil al combinar la creación del directorio y la adición del mismo:

source: Like files, directories are removed with <command>svn rm</command>. There is no separate command specifically for removing directories.
es_es: Al igual que los archivos, los directorios se eliminan con <command>svn rm</command>. No hay un comando separado específicamente para eliminar directorios.

source: Copying and Moving Files
es_es: Copiar y mover archivos

source: This command creates a copy of <filename>foo.c</filename> named <filename>bar.c</filename>, with the new file also under version control and with the full history of <filename>foo.c</filename>:
es_es: Este comando crea una copia de <filename>foo.c</filename> llamado <filename>bar.c</filename>, con el nuevo archivo también bajo control de versiones y con el historial completo de <filename>foo.c</filename>:

source: This is usually preferred to copying the file with <command>cp</command> and adding it to the repository with <command>svn add</command> because this way the new file does not inherit the original one's history.
es_es: Esto suele ser preferible a copiar el fichero con <command>cp</command> y añadirlo al repositorio con <command>svn add</command> porque de esta forma el nuevo fichero no hereda la historia del original.

source: To move and rename a file:
es_es: Para mover y renombrar un archivo:

source: Log and Annotate
es_es: Registro y anotación

source: <command>svn log</command> shows revisions and commit messages, most recent first, for files or directories. When used on a directory, all revisions that affected the directory and files within that directory are shown.
es_es: <command>svn log</command> muestra las revisiones y los mensajes de los commits, los más recientes primero, para archivos o directorios. Cuando se utiliza en un directorio, se muestran todas las revisiones que afectaron al directorio y se muestran los ficheros dentro de ese directorio.

source: <command>svn annotate</command>, or equally <command>svn praise</command> or <command>svn blame</command>, shows the most recent revision number and who committed that revision for each line of a file.
es_es: <command>svn annotate</command>, o igualmente <command>svn praise</command> o <command>svn blame</command>, muestra el número de revisión más reciente y quién ha enviado dicha revisión para cada línea de un fichero.

source: Diffs
es_es: Diferencias

source: <command>svn diff</command> displays changes to the working copy. Diffs generated by <acronym>SVN</acronym> are unified and include new files by default in the diff output.
es_es: <command>svn diff</command> muestra los cambios en la copia de trabajo. Las diferencias generadas por <acronym>SVN</acronym> son unificadas e incluyen nuevos archivos por defecto en la salida de las diferencias.

source: <command>svn diff</command> can show the changes between two revisions of the same file:
es_es: <command>svn diff</command> puede mostrar los cambios entre dos revisiones del mismo fichero:
