Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

# _
source: translator-credits
es_es: Manuel Megías joramsinkin@hotmail.com, 2019 Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: Committer's Guide
es_es: Guía para los committers

source: This document provides information for the FreeBSD committer community. All new committers should read this document before they start, and existing committers are strongly encouraged to review it from time to time.
es_es: Este documento proporciona información para la comunidad de committers de FreeBSD. Todos los committers nuevos deben leer este documento antes de empezar, y se recomienda encarecidamente a los committers actuales que lo revisen de vez en cuando.

source: Almost all FreeBSD developers have commit rights to one or more repositories. However, a few developers do not, and some of the information here applies to them as well. (For instance, some people only have rights to work with the Problem Report database). Please see <xref linkend="non-committers"/> for more information.
es_es: Casi todos los desarrolladores de FreeBSD tienen derechos sobre uno o más repositorios. Sin embargo, algunos desarrolladores no los tienen, y parte de la información aquí se aplica también a ellos. (Por ejemplo, algunas personas solo tienen derecho para trabajar con la base de datos de informes de problemas). Por favor, vea <xref linkend="non-committers"/> para más información.

source: This document may also be of interest to members of the FreeBSD community who want to learn more about how the project works.
es_es: Este documento también puede ser de interés para los miembros de la comunidad de FreeBSD que quieran saber más sobre el funcionamiento del proyecto.

source: Administrative Details
es_es: Detalles administrativos

source: <emphasis>Login Methods</emphasis>
es_es: <emphasis>Métodos de acceso</emphasis>

source: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, protocol 2 only
es_es: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, solo el protocolo 2

source: <emphasis>Main Shell Host</emphasis>
es_es: <emphasis>Servidor shell principal</emphasis>

source: <emphasis>SMTP Host</emphasis>
es_es: <emphasis>Host SMTP</emphasis>

source: <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal> (see also <xref linkend="smtp-setup"/>).
es_es: <literal><systemitem class="fqdomainname">smtp.FreeBSD.org</systemitem>:587</literal> (vea también <xref linkend="smtp-setup"/>).

source: <emphasis><literal>src/</literal> Subversion Root</emphasis>
es_es: <emphasis><literal>src/</literal>raíz de subversion</emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/base</filename> (see also <xref linkend="svn-getting-started-base-layout"/>).
es_es: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/base</filename> (vea también <xref linkend="svn-getting-started-base-layout"/>).

source: <emphasis><literal>doc/</literal> Subversion Root</emphasis>
es_es: <emphasis><literal>doc/</literal> raíz de subversion</emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/doc</filename> (see also <xref linkend="svn-getting-started-doc-layout"/>).
es_es: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/doc</filename> (ver también <xref linkend="svn-getting-started-doc-layout"/>).

source: <emphasis><literal>ports/</literal> Subversion Root</emphasis>
es_es: <emphasis><literal>ports/</literal> raíz de subversion</emphasis>

source: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/ports</filename> (see also <xref linkend="svn-getting-started-ports-layout"/>).
es_es: <literal>svn+ssh://</literal><systemitem class="fqdomainname">repo.FreeBSD.org</systemitem><filename>/ports</filename> (vea también <xref linkend="svn-getting-started-ports-layout"/>

source: <emphasis>Internal Mailing Lists</emphasis>
es_es: <emphasis>Listas de correo interno</emphasis>

source: developers (technically called all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Each project repository has its own -developers and -committers mailing lists. Archives for these lists can be found in the files <filename>/local/mail/<replaceable>repository-name</replaceable>-developers-archive</filename> and <filename>/local/mail/<replaceable>repository-name</replaceable>-committers-archive</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.)
es_es: developers (técnicamente all-developers), doc-developers, doc-committers, ports-developers, ports-committers, src-developers, src-committers. (Cada repositorio del proyecto tiene sus propias listas de correo de -developers y -committers. Los archivos historicos de estas listas se pueden encontrar en <filename>/local/mail/<replaceable>repository-name</replaceable>-developers-archive</filename> y <filename>/local/mail/<replaceable>repository-name</replaceable>-committers-archive</filename> en el clúster de <systemitem class="fqdomainname">FreeBSD.org</systemitem>)

source: <emphasis>Core Team monthly reports</emphasis>
es_es: <emphasis>Informes mensuales del Core Team</emphasis>

source: <filename>/home/core/public/monthly-reports</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.
es_es: <filename>/home/core/public/monthly-reports</filename> en el clúster de <systemitem class="fqdomainname">FreeBSD.org</systemitem>.

source: <emphasis>Ports Management Team monthly reports</emphasis>
es_es: <emphasis>Informes mensuales del equipo de gestión de los ports</emphasis>

source: <filename>/home/portmgr/public/monthly-reports</filename> on the <systemitem class="fqdomainname">FreeBSD.org</systemitem> cluster.
es_es: <filename>/home/portmgr/public/monthly-reports</filename> en el clúster de <systemitem class="fqdomainname">FreeBSD.org</systemitem>.

source: <emphasis>Noteworthy <literal>src/</literal> SVN Branches</emphasis>
es_es: <emphasis>Ramas SVN descatables <literal>src/</literal></emphasis>

source: <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> is required to connect to the project hosts. For more information, see <xref linkend="ssh.guide"/>.
es_es: Se requiere <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> para conectarse a los hosts del proyecto. Para obtener más información, consulte la <xref linkend="ssh.guide"/>.

source: Useful links:
es_es: Enlaces de interés:

source: <link xlink:href="@@URL_RELPREFIX@@/internal/">FreeBSD Project Internal Pages</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/internal/">Páginas internas del proyecto FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/internal/machines.html">FreeBSD Project Hosts</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/internal/machines.html">Hosts del proyecto FreeBSD</link>

source: <link xlink:href="@@URL_RELPREFIX@@/administration.html">FreeBSD Project Administrative Groups</link>
es_es: <link xlink:href="@@URL_RELPREFIX@@/administration.html">Grupos administrativos del proyecto FreeBSD</link>

source: Open<acronym>PGP</acronym> Keys for FreeBSD
es_es: Claves Open<acronym>PGP</acronym> para FreeBSD

source: Cryptographic keys conforming to the Open<acronym>PGP</acronym> (<emphasis>Pretty Good Privacy</emphasis>) standard are used by the FreeBSD project to authenticate committers. Messages carrying important information like public <acronym>SSH</acronym> keys can be signed with the Open<acronym>PGP</acronym> key to prove that they are really from the committer. See <link xlink:href="http://www.nostarch.com/pgp_ml.htm">PGP &amp; GPG: Email for the Practical Paranoid by Michael Lucas</link> and <link xlink:href="http://en.wikipedia.org/wiki/Pretty_Good_Privacy"/> for more information.
es_es: El proyecto FreeBSD utiliza claves criptográficas compatibles con Open<acronym>PGP</acronym> (<emphasis>Pretty Good Privacy</emphasis>) para autenticar a los committers. Los mensajes que contienen información importante, como las claves públicas <acronym>SSH</acronym>, se pueden firmar con una clave Open<acronym>PGP</acronym> para demostrar que son realmente del committer. Para obtener más información consulte <link xlink:href="http://www.nostarch.com/pgp_ml.htm">PGP &amp; GPG: Email for the Practical Paranoid by Michael Lucas</link> y <link xlink:href="http://en.wikipedia.org/wiki/Pretty_Good_Privacy"/>.

source: Creating a Key
es_es: Creando una clave

source: Existing keys can be used, but should be checked with <filename>doc/head/share/pgpkeys/checkkey.sh</filename> first. In this case, make sure the key has a FreeBSD user ID.
es_es: Se pueden utilizar las claves ya existentes, pero primero, deben ser comprobadas con el script <filename>doc/head/share/pgpkeys/checkkey.sh</filename>. En este caso, asegúrese de que la clave tenga un ID de usuario de FreeBSD.

source: For those who do not yet have an Open<acronym>PGP</acronym> key, or need a new key to meet FreeBSD security requirements, here we show how to generate one.
es_es: Para aquellos que aún no disponen de una clave Open<acronym>PGP</acronym>, o necesitan una nueva clave para cumplir con los requisitos de seguridad de FreeBSD, en esta sección le mostraremos cómo generar una.

source: Install <filename role="package">security/gnupg</filename>. Enter these lines in <filename>~/.gnupg/gpg.conf</filename> to set minimum acceptable defaults:
es_es: Instale <filename role="package">security/gnupg</filename>. Introduzca estas líneas en el archivo <filename>~/.gnupg/gpg.conf</filename> para establecer los valores mínimos aceptables de forma predeterminada:

source: Generate a key:
es_es: Generar una clave:

source: 2048-bit keys with a three-year expiration provide adequate protection at present (2013-12). <link xlink:href="http://danielpocock.com/rsa-key-sizes-2048-or-4096-bits"/> describes the situation in more detail.
es_es: Las claves de 2048 bits con una caducidad de tres años proporcionan una protección adecuada en el momento de escribir estas líneas(12-2013). El artículo <link xlink:href="http://danielpocock.com/rsa-key-sizes-2048-or-4096-bits"/> describe la situación con más detalle.

source: A three year key lifespan is short enough to obsolete keys weakened by advancing computer power, but long enough to reduce key management problems.
es_es: Tres años de vida útil para una clave hacen que sea lo suficientemente corta como para hacer que quede obsoleta por el avance de la potencia de los ordenadores, pero lo suficiente para reducir los problemas de administración de claves.

source: Use your real name here, preferably matching that shown on government-issued <acronym>ID</acronym> to make it easier for others to verify your identity. Text that may help others identify you can be entered in the <literal>Comment</literal> section.
es_es: Utilice su nombre real, preferiblemente, que coincida con el que se muestra en la identificación (<acronym>ID</acronym>) emitida por su gobierno, para que sea más fácil para otros verificar su identidad. En la sección de <literal>Comment</literal>, puede añadir algún texto que ayude a otros a identificarlo.

source: After the email address is entered, a passphrase is requested. Methods of creating a secure passphrase are contentious. Rather than suggest a single way, here are some links to sites that describe various methods: <link xlink:href="http://world.std.com/~reinhold/diceware.html"/>, <link xlink:href="http://www.iusmentis.com/security/passphrasefaq/"/>, <link xlink:href="http://xkcd.com/936/"/>, <link xlink:href="http://en.wikipedia.org/wiki/Passphrase"/>.
es_es: Después de introducir la dirección de correo electrónico, se solicita una contraseña. Los métodos para crear una contraseña segura son bastante polémicos. En lugar de sugerir una única forma, aquí hay algunos enlaces a sitios que describen varios métodos: <link xlink:href="http://world.std.com/~reinhold/diceware.html"/>, <link xlink:href="http://www.iusmentis.com/security/passphrasefaq/"/>, <link xlink:href="http://xkcd.com/936/"/>, <link xlink:href="http://en.wikipedia.org/wiki/Passphrase"/>.

source: Protect the private key and passphrase. If either the private key or passphrase may have been compromised or disclosed, immediately notify <email>accounts@FreeBSD.org</email> and revoke the key.
es_es: Proteja la clave privada y la contraseña. Si la clave privada o la contraseña podrían haber sido comprometidas o reveladas, notifiquelo de forma inmediata a <email>accounts@FreeBSD.org</email> y revoque la clave.

source: Committing the new key is shown in <xref linkend="commit-steps"/>.
es_es: El proceso para hacer el commit de la nueva clave se muestra en <xref linkend="commit-steps"/>.

source: Kerberos and LDAP web Password for FreeBSD Cluster
es_es: Kerberos y contraseña web LDAP para el clúster de FreeBSD

source: The FreeBSD cluster requires a Kerberos password to access certain services. The Kerberos password also serves as the LDAP web password, since LDAP is proxying to Kerberos in the cluster. Some of the services which require this include:
es_es: El clúster de FreeBSD requiere una contraseña de Kerberos para acceder a ciertos servicios. La contraseña de Kerberos también sirve como contraseña web LDAP, ya que LDAP hace un proxy a Kerberos en el clúster. Algunos de los servicios que requieren esto incluyen:

source: To create a new Kerberos account in the FreeBSD cluster, or to reset a Kerberos password for an existing account using a random password generator:
es_es: Para crear una nueva cuenta de Kerberos en el clúster de FreeBSD, o para restablecer una contraseña de Kerberos para una cuenta existente utilizando un generador de contraseñas aleatorias:

source: This must be done from a machine outside of the FreeBSD.org cluster.
es_es: Esto debe hacerse desde una máquina fuera del clúster de FreeBSD.org.

source: A Kerberos password can also be set manually by logging into <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> and running:
es_es: Una contraseña de Kerberos también se puede establecer manualmente iniciando sesión en <systemitem class="fqdomainname">freefall.FreeBSD.org</systemitem> y ejecutando:

source: Unless the Kerberos-authenticated services of the FreeBSD.org cluster have been used previously, <errorname>Client unknown</errorname> will be shown. This error means that the <command>ssh kpasswd.freebsd.org</command> method shown above must be used first to initialize the Kerberos account.
es_es: A menos que los servicios autenticados por Kerberos del clúster FreeBSD.org se hayan utilizado previamente, se mostrará <errorname>Client unknown</errorname>. Esto error significa que el método <command>ssh kpasswd.freebsd.org</command> que se muestra arriba desde ejecutarse primero para inicializar la cuenta de Kerberos.

source: Commit Bit Types
es_es: Tipos de Commit Bits

source: The FreeBSD repository has a number of components which, when combined, support the basic operating system source, documentation, third party application ports infrastructure, and various maintained utilities. When FreeBSD commit bits are allocated, the areas of the tree where the bit may be used are specified. Generally, the areas associated with a bit reflect who authorized the allocation of the commit bit. Additional areas of authority may be added at a later date: when this occurs, the committer should follow normal commit bit allocation procedures for that area of the tree, seeking approval from the appropriate entity and possibly getting a mentor for that area for some period of time.
es_es: El repositorio de FreeBSD tiene una serie de componentes que, cuando se combinan, integran el código fuente del sistema base del sistema operativo, la documentación, la infraestructura de ports de las aplicaciones de terceros y varias utilidades mantenidas. Cuando se asignan los commit bits, se especifican las áras del árbol donde se tiene permiso. Generalmente, las áreas asociadas con un commit bit reflejan quién autorizó la asignación del commit bit. Se pueden agregar más áreas de autoridad posteriormente: cuando esto ocurre, el committer debe seguir los procedimientos normales de asignación de commit bit para esa área del árbol, buscar la aprobación de la entidad apropiada y posiblemente obtener un mentor para esa área durante un cierto periodo de tiempo.

source: <emphasis>Committer Type</emphasis>
es_es: <emphasis>Tipo de committer</emphasis>

source: <emphasis>Responsible</emphasis>
es_es: <emphasis>Responsable</emphasis>

source: <emphasis>Tree Components</emphasis>
es_es: <emphasis>Componentes del árbol</emphasis>

source: src/, doc/ subject to appropriate review
es_es: src/, doc/ sujeto a una revisión apropiada

source: Commit bits allocated prior to the development of the notion of areas of authority may be appropriate for use in many parts of the tree. However, common sense dictates that a committer who has not previously worked in an area of the tree seek review prior to committing, seek approval from the appropriate responsible party, and/or work with a mentor. Since the rules regarding code maintenance differ by area of the tree, this is as much for the benefit of the committer working in an area of less familiarity as it is for others working on the tree.
es_es: Los commit bits asignados antes de que se conozca el funcionamiento de la sección sobre la cual se tenga autoridad, pueden ser apropiados para su uso en muchas partes del árbol. Sin embargo, el sentido común dicta que un committer que no haya trabajado previamente en esa área del árbol busque una revisión antes de realizar el commit, busque la aprobación del equipo responsable, y/o trabaje con un mentor. Dado que las reglas con respecto al mantenimiento del código difieren según el área del árbol, esto será beneficioso tanto para quién trabaja en un área del árbol con la que no está muy familiarizado como para quiénes trabajan en el árbol.

source: Committers are encouraged to seek review for their work as part of the normal development process, regardless of the area of the tree where the work is occurring.
es_es: Se anima a los committers a buscar la revisión de su trabajo como parte del proceso natural del desarrollo, independientemente del área del árbol en la cual se esté realizando el trabajo.

source: Policy for Committer Activity in Other Trees
es_es: Política para la actividad de los Committers en otros árboles

source: All committers may modify <filename>base/head/share/misc/committers-*.dot</filename>, <filename>base/head/usr.bin/calendar/calendars/calendar.freebsd</filename>, and <filename>ports/head/astro/xearth/files</filename>.
es_es: Todos los committers pueden modificar <filename>base/head/share/misc/committers-*.dot</filename>, <filename>base/head/usr.bin/calendar/calendars/calendar.freebsd</filename>, y <filename>ports/head/astro/xearth/files</filename>.

source: doc committers may commit documentation changes to <filename>src</filename> files, such as man pages, READMEs, fortune databases, calendar files, and comment fixes without approval from a src committer, subject to the normal care and tending of commits.
es_es: los doc committers pueden realizar commits en la documentación de <filename>src</filename>, como las páginas man, READMEs, bases de datos de fortune, archivos de calendario y correcciones de comentarios sin la aprobación de un src committer, teniendo en cuenta las normas requeridas para la correcta realización de los commits.

source: Any committer may make changes to any other tree with an "Approved by" from a non-mentored committer with the appropriate bit.
es_es: Cualquier committer puede realizar cambios en cualquier otro árbol con un "Approved by" de un committer que no esté tutelado y dispone del commit bit apropiado.

source: Committers can acquire an additional bit by the usual process of finding a mentor who will propose them to core, doceng, or portmgr, as appropriate. When approved, they will be added to 'access' and the normal mentoring period will ensue, which will involve a continuing of <quote>Approved by</quote> for some period.
es_es: Los committers pueden adquirir commit bit adicionales mediante el proceso habitual, encontrar a un mentor que lo proponga a core, doceng o portmgr, según sea el caso. Una vez aprobados, se añadirán al "acceso" y se producirá el periodo normal de tutoría, que implicará una continuación de <quote>Approved by</quote> durante algún tiempo.

source: "Approved by" is only acceptable from non-mentored src committers -- mentored committers can provide a "Reviewed by" but not an "Approved by".
es_es: "Approved by" solo es aceptable para los committers que no están bajo tutoria -- los committers tutelados pueden proporcionar un "Reviewed by", pero no un "Approved by".

source: New committers are assumed to already be familiar with the basic operation of Subversion. If not, start by reading the <link xlink:href="http://svnbook.red-bean.com/">Subversion Book</link>.
es_es: Se asume que los nuevos committers están ya familiarizados con el funcionamiento básico de Subversion. Si no es así, comience leyendo el <link xlink:href="http://svnbook.red-bean.com/">libro de Subversion</link>.

source: Introduction
es_es: Introducción

source: The FreeBSD source repository switched from <acronym>CVS</acronym> to Subversion on May 31st, 2008. The first real <acronym>SVN</acronym> commit is <emphasis>r179447</emphasis>.
es_es: El repositorio del código fuente de FreeBSD migró de <acronym>CVS</acronym> a Subversion el 31 de mayo de 2008. El primer commit real del repositorio <acronym>SVN</acronym> es <emphasis>r179447</emphasis>.

source: The FreeBSD <literal>doc/www</literal> repository switched from <acronym>CVS</acronym> to Subversion on May 19th, 2012. The first real <acronym>SVN</acronym> commit is <emphasis>r38821</emphasis>.
es_es: El repositorio <literal>doc/www</literal> de FreeBSD migró de <acronym>CVS</acronym> a Subversion el 19 de mayo de 2012. El primer commit real del repositorio <acronym>SVN</acronym> es <emphasis>r38821</emphasis>.

source: The FreeBSD <literal>ports</literal> repository switched from <acronym>CVS</acronym> to Subversion on July 14th, 2012. The first real <acronym>SVN</acronym> commit is <emphasis>r300894</emphasis>.
es_es: El repositorio <literal>ports</literal> de FreeBSD migró de <acronym>CVS</acronym> a Subversion el 14 de julio de 2012. El primer commit real del repositorio <acronym>SVN</acronym> es <emphasis>r300894</emphasis>.

source: Subversion can be installed from the FreeBSD Ports Collection by issuing these commands:
es_es: Subversion puede instalarse desde la colección de ports de FreeBSD ejecutando el comando:

source: Getting Started
es_es: Primeros pasos

source: There are a few ways to obtain a working copy of the tree from Subversion. This section will explain them.
es_es: Existen varias formas de obtener una copia del árbol del código fuente de Subversion. Esta sección las explicará.

source: Direct Checkout
es_es: Checkout directo

source: The first is to check out directly from the main repository. For the <literal>src</literal> tree, use:
es_es: La primera de ellas es hacer un check out directo del repositorio principal. Para el repositorio <literal>src</literal>, use el comando:

source: For the <literal>doc</literal> tree, use:
es_es: Para el repositorio <literal>doc</literal>, use el comando:

source: For the <literal>ports</literal> tree, use:
es_es: Para el repositorio <literal>ports</literal>, use el comando:
