Repository: doc-br/translate
Catalog: articles/*/committers-guide.po
Languages: es_es

source: The easiest way to add a new port is the <command>addport</command> script located in the <filename>ports/Tools/scripts</filename> directory. It adds a port from the directory specified, determining the category automatically from the port <filename>Makefile</filename>. It also adds an entry to the port's category <filename>Makefile</filename>. It was written by Michael Haro <email>mharo@FreeBSD.org</email>, Will Andrews <email>will@FreeBSD.org</email>, and Renato Botelho <email>garga@FreeBSD.org</email>. When sending questions about this script to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>, please also CC Chris Rees <email>crees@FreeBSD.org</email>, the current maintainer.
es_es: La forma más sencilla de agregar un nuevo puerto es <command>addport</command> script ubicado en el <filename>ports/Tools/scripts</filename> directorio. Agrega un puerto del directorio especificado, determinando la categoría automáticamente desde el puerto <filename>Makefile</filename>. También agrega una entrada a la categoría del puerto. <filename>Makefile</filename>. Fue escrito por Michael Haro <email>mharo@FreeBSD.org</email>, Will Andrews <email>will@FreeBSD.org</email>, and Renato Botelho <email>garga@FreeBSD.org</email>. Al enviar preguntas sobre este script al <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">Lista de correo de puertos de FreeBSD</link>, please also CC Chris Rees <email>crees@FreeBSD.org</email>, el mantenedor actual.

source: Any other things I need to know when I add a new port?
es_es: ¿Alguna otra cosa que deba saber cuando agregue un nuevo puerto?

source: Check the port, preferably to make sure it compiles and packages correctly. This is the recommended sequence:
es_es: Verifique el puerto, preferiblemente para asegurarse de que se compila y empaqueta correctamente. Esta es la secuencia recomendada:

source: The <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Porters Handbook</link> contains more detailed instructions.
es_es: el <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/index.html">Manual de porteadores</link> contiene instrucciones más detalladas.

source: Use <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> to check the syntax of the port. You do not necessarily have to eliminate all warnings but make sure you have fixed the simple ones.
es_es: Use <citerefentry vendor="ports"><refentrytitle>portlint</refentrytitle><manvolnum>1</manvolnum></citerefentry> para comprobar la sintaxis del puerto. No necesariamente tiene que eliminar todas las advertencias, pero asegúrese de haber solucionado las simples.

source: If the port came from a submitter who has not contributed to the Project before, add that person's name to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/contrib-additional.html">Additional Contributors</link> section of the FreeBSD Contributors List.
es_es: Si el puerto proviene de un remitente que no ha contribuido al proyecto antes, agregue el nombre de esa persona al <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/contributors/contrib-additional.html">Colaboradores adicionales</link> de la lista de colaboradores de FreeBSD.

source: Close the PR if the port came in as a PR. To close a PR, change the state to <literal>Issue Resolved</literal> and the resolution as <literal>Fixed</literal>.
es_es: Cierre el PR si el puerto entró como PR. Para cerrar un PR, cambie el estado a <literal>Problema resuelto</literal> y la resolución como<literal>Fixed</literal>.

source: Removing an Existing Port
es_es: Eliminar un puerto existente

source: How do I remove an existing port?
es_es: ¿Cómo elimino un puerto existente?

source: First, please read the section about repository copies. Before you remove the port, you have to verify there are no other ports depending on it.
es_es: Primero, lea la sección sobre copias del repositorio. Antes de eliminar el puerto, debe verificar que no haya otros puertos que dependan de él.

source: Make sure there is no dependency on the port in the ports collection:
es_es: Asegúrese de que no haya dependencia del puerto en la colección de puertos:

source: The port's PKGNAME appears in exactly one line in a recent INDEX file.
es_es: El PKGNAME del puerto aparece exactamente en una línea en un archivo INDEX reciente.

source: No other ports contains any reference to the port's directory or PKGNAME in their Makefiles
es_es: Ningún otro puerto contiene ninguna referencia al directorio del puerto o PKGNAME en sus Makefiles

source: When using <application>Git</application>, consider using <command>git grep</command>, it is much faster than <command>grep -r</command>.
es_es: Cuando usas <application>Git</application>, Considere usar <command>git grep</command>, es mucho más rápido que <command>grep -r</command>.

source: Then, remove the port:
es_es: Luego, quita el puerto:

source: Remove the port's files and directory with <command>svn remove</command>.
es_es: Elimine los archivos y el directorio del puerto con <command>svn remove</command>.

source: Remove the <varname>SUBDIR</varname> listing of the port in the parent directory <filename>Makefile</filename>.
es_es: Quitar el <varname>SUBDIR</varname> listado del puerto en el directorio principal <filename>Makefile</filename>.

source: Add an entry to <filename>ports/MOVED</filename>.
es_es: Agregar una entrada a <filename>ports/MOVED</filename>.

source: Search for entries in <filename>ports/security/vuxml/vuln.xml</filename> and adjust them accordingly. In particular, check for previous packages with the new name which version could include the new port.
es_es: Buscar entradas en <filename>ports/security/vuxml/vuln.xml</filename> y ajústelos en consecuencia. En particular, verifique los paquetes anteriores con el nuevo nombre cuya versión podría incluir el nuevo puerto.

source: Remove the port from <filename>ports/LEGAL</filename> if it is there.
es_es: Quite el puerto de <filename>ports/LEGAL</filename> si está ahí.

source: Alternatively, you can use the <command>rmport</command> script, from <filename>ports/Tools/scripts</filename>. This script was written by Vasil Dimov <email>vd@FreeBSD.org</email>. When sending questions about this script to the <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">FreeBSD ports mailing list</link>, please also CC Chris Rees <email>crees@FreeBSD.org</email>, the current maintainer.
es_es: Alternativamente, puede utilizar el <command>rmport</command> script, from <filename>ports/Tools/scripts</filename>. este guión fue escrito por Vasil Dimov <email>vd@FreeBSD.org</email>. Al enviar preguntas sobre este script al <link xlink:href="http://lists.FreeBSD.org/mailman/listinfo/freebsd-ports">lista de correo de puertos de freeBSD</link>, por favor también un CC a Chris Rees<email>crees@FreeBSD.org</email>, el mantenedor actual.

source: Re-adding a Deleted Port
es_es: Volver a agregar un puerto eliminado

source: How do I re-add a deleted port?
es_es: ¿Cómo vuelvo a agregar un puerto eliminado?

source: This is essentially the reverse of deleting a port.
es_es: Esto es esencialmente lo contrario de eliminar un puerto.

source: Do not use <command>svn add</command> to add the port. Follow these steps. If they are unclear, or are not working, ask for help, do not just <command>svn add</command> the port.
es_es: No utilice <command>svn add</command> para agregar el puerto. Sigue estos pasos. Si no están claros o no funcionan, pida ayuda, no se limite a <command>svn add</command> el puerto.

source: Figure out when the port was removed. Use this <link xlink:href="https://people.FreeBSD.org/~crees/removed_ports/index.xml">list</link>, or look for the port on <link xlink:href="http://www.freshports.org/">freshports</link>, and then copy the last living revision of the port:
es_es: Averigüe cuándo se eliminó el puerto. Utilizar este <link xlink:href="https://people.FreeBSD.org/~crees/removed_ports/index.xml">list</link>, o busque el puerto en <link xlink:href="http://www.freshports.org/">freshports</link>, y luego copie la última revisión viva del puerto:

source: Pick the revision that is just before the removal. For example, if the revision where it was removed is <literal>269874</literal>, use <literal>269873</literal>.
es_es: Elija la revisión que está justo antes de la eliminación. Por ejemplo, si la revisión donde se eliminó es<literal>269874</literal>, use<literal>269873</literal>.

source: It is also possible to specify a date. In that case, pick a date that is before the removal but after the last commit to the port.
es_es: También es posible especificar una fecha. En ese caso, elija una fecha anterior a la eliminación, pero posterior a la última confirmación del puerto.

source: Make the changes necessary to get the port working again. If it was deleted because the distfiles are no longer available, either volunteer to host the distfiles, or find someone else to do so.
es_es: Realice los cambios necesarios para que el puerto vuelva a funcionar. Si se eliminó porque los archivos dist ya no están disponibles, ofrézcase como voluntario para alojar los archivos dist o busque a otra persona para que lo haga.

source: If some files have been added, or were removed during the resurrection process, use <command>svn add</command> or <command>svn remove</command> to make sure all the files in the port will be committed.
es_es: si se han agregado o eliminado algunos archivos durante el proceso de resurrección, utilice <command>svn add </command>o <command>svn remove</command> para asegurarse de que se confirmarán todos los archivos del puerto.

source: Restore the <varname>SUBDIR</varname> listing of the port in the parent directory <filename>Makefile</filename>, keeping the entries sorted.
es_es: Restaurar el <varname>SUBDIR</varname> listado del puerto en el directorio principal<filename>Makefile</filename>, manteniendo las entradas ordenadas.

source: Delete the port entry from <filename>ports/MOVED</filename>.
es_es: Eliminar la entrada del puerto de <filename>ports/MOVED</filename>.

source: If the port had an entry in <filename>ports/LEGAL</filename>, restore it.
es_es: Si el puerto tuviera una entrada en <filename>ports/LEGAL</filename>, restaurarlo.

source: <command>svn commit</command> these changes, preferably in one step.
es_es: <command>svn commit</command> estos cambios, preferiblemente en un solo paso.

source: The <command>addport</command> script mentioned in <xref linkend="ports-qa-adding"/> now detects when the port to add has previously existed, and attempts to handle all except the <filename>ports/LEGAL</filename> step automatically.
es_es: El <command>addport</command> guión mencionado en <xref linkend="ports-qa-adding"/> ahora detecta cuando el puerto para agregar ha existido previamente e intenta manejar todos excepto el <filename>ports/LEGAL</filename>paso automáticamente.

source: Repository Copies
es_es: Copias de repositorio

source: When do we need a repository copy?
es_es: ¿Cuándo necesitamos una copia del repositorio?

source: When you want to add a port that is related to any port that is already in the tree in a separate directory, you have to do a repository copy. Here <wordasword>related</wordasword> means it is a different version or a slightly modified version. Examples are <filename>print/ghostscript*</filename> (different versions) and <filename>x11-wm/windowmaker*</filename> (English-only and internationalized version).
es_es: Cuando desee agregar un puerto que esté relacionado con cualquier puerto que ya esté en el árbol en un directorio separado, debe hacer una copia del repositorio. aquí <wordasword>related</wordasword> significa que es una versión diferente o una versión ligeramente modificada. Ejemplos son <filename>print/ghostscript*</filename> (diferentes versiones) y <filename>x11-wm/windowmaker*</filename> (Versión solo en inglés e internacionalizada).

source: Another example is when a port is moved from one subdirectory to another, or when the name of a directory must be changed because the authors renamed their software even though it is a descendant of a port already in a tree.
es_es: Otro ejemplo es cuando un puerto se mueve de un subdirectorio a otro, o cuando el nombre de un directorio debe cambiarse porque los autores cambiaron el nombre de su software a pesar de que es un descendiente de un puerto que ya está en un árbol.

source: What do I need to do?
es_es: ¿Que necesito hacer?

source: With Subversion, a repo copy can be done by any committer:
es_es: Con Subversion, cualquier confirmador puede realizar una copia del repositorio:

source: Doing a repo copy:
es_es: Haciendo una copia de repositorio:

source: Verify that the target directory does not exist.
es_es: Verifique que el directorio de destino no exista.

source: Use <command>svn up</command> to make certain the original files, directories, and checkout information is current.
es_es: Use<command>svn up</command> para asegurarse de que los archivos, directorios e información de pago originales estén actualizados.

source: Use <command>svn move</command> or <command>svn copy</command> to do the repo copy.
es_es: Use<command>svn move</command> o <command>svn copy</command> para hacer la copia del repositorio.

source: Upgrade the copied port to the new version. Remember to add or change the <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> so there are no duplicate ports with the same name. In some rare cases it may be necessary to change the <varname>PORTNAME</varname> instead of adding <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname>, but this is only done when it is really needed — for example, using an existing port as the base for a very similar program with a different name, or upgrading a port to a new upstream version which actually changes the distribution name, like the transition from <filename>textproc/libxml</filename> to <filename>textproc/libxml2</filename>. In most cases, adding or changing <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> suffices.
es_es: Actualice el puerto copiado a la nueva versión. Recuerde agregar o cambiar el <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> por lo que no hay puertos duplicados con el mismo nombre. En algunos casos raros, puede ser necesario cambiar el <varname>PORTNAME</varname> en lugar de agregar <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname>, pero esto solo se hace cuando es realmente necesario, por ejemplo, usar un puerto existente como base para un programa muy similar con un nombre diferente, o actualizar un puerto a una nueva versión ascendente que realmente cambia el nombre de la distribución, como la transición desde <filename>textproc/libxml</filename> a <filename>textproc/libxml2</filename>.En la mayoría de los casos, agregar o cambiar <varname>PKGNAMEPREFIX</varname> or <varname>PKGNAMESUFFIX</varname> suffices.

source: Add the new subdirectory to the <varname>SUBDIR</varname> listing in the parent directory <filename>Makefile</filename>. You can run <command>make checksubdirs</command> in the parent directory to check this.
es_es: Agregue el nuevo subdirectorio al <varname>SUBDIR</varname> listado en el directorio principal<filename>Makefile</filename>. Usted puede correr <command>make checksubdirs</command> en el directorio principal para comprobarlo.

source: If the port changed categories, modify the <varname>CATEGORIES</varname> line of the port's <filename>Makefile</filename> accordingly
es_es: Si el puerto cambió de categoría, modifique el <varname>CATEGORÍAS</varname> línea del puerto<filename>Makefile</filename> en consecuencia

source: Add an entry to <filename>ports/MOVED</filename>, if you remove the original port.
es_es: Agregar una entrada a <filename>ports/MOVED</filename>, si quita el puerto original.

source: Commit all changes on one commit.
es_es: Confirme todos los cambios en una confirmación.

source: When removing a port:
es_es: Al eliminar un puerto:

source: Perform a thorough check of the ports collection for any dependencies on the old port location/name, and update them. Running <command>grep</command> on <filename>INDEX</filename> is not enough because some ports have dependencies enabled by compile-time options. A full <command>grep -r</command> of the ports collection is recommended.
es_es: Realice una verificación exhaustiva de la colección de puertos para detectar cualquier dependencia en la ubicación/nombre del puerto anterior y actualícelas. Corriendo <command>grep</command>en<filename>INDEX</filename> no es suficiente porque algunos puertos tienen dependencias habilitadas por las opciones de tiempo de compilación. Una completa <command>grep -r</command> de la colección de puertos se recomienda.

source: Remove the old port and the old <varname>SUBDIR</varname> entry.
es_es: Quite el puerto viejo y el viejo <varname>SUBDIR</varname> entrada.

source: After repo moves (<quote>rename</quote> operations where a port is copied and the old location is removed):
es_es: Después de los movimientos de repositorio (<quote>rename</quote> operaciones donde se copia un puerto y se elimina la ubicación anterior):

source: Follow the same steps that are outlined in the previous two entries, to activate the new location of the port and remove the old one.
es_es: Siga los mismos pasos que se describen en las dos entradas anteriores, para activar la nueva ubicación del puerto y eliminar la antigua.

source: Ports Freeze
es_es: Congelación de puertos

source: What is a <quote>ports freeze</quote>?
es_es: Que es un <quote>puertos congelados</quote>?

source: A <quote>ports freeze</quote> was a restricted state the ports tree was put in before a release. It was used to ensure a higher quality for the packages shipped with a release. It usually lasted a couple of weeks. During that time, build problems were fixed, and the release packages were built. This practice is no longer used, as the packages for the releases are built from the current stable, quarterly branch.
es_es: Un <quote>Congelación de puertos</quote> era un estado restringido en el que se colocaba el árbol de ports antes de un lanzamiento. Se utilizó para garantizar una mayor calidad de los paquetes enviados con una versión. Suele durar un par de semanas. Durante ese tiempo, se solucionaron los problemas de compilación y se compilaron los paquetes de lanzamiento. Esta práctica ya no se utiliza, ya que los paquetes para las versiones se crean a partir de la rama trimestral estable actual.

source: For more information on how to merge commits to the quarterly branch, see <xref linkend="ports-qa-misc-request-mfh"/>.
es_es: Para obtener más información sobre cómo fusionar confirmaciones en la rama trimestral, consulte<xref linkend="ports-qa-misc-request-mfh"/>.

source: Quarterly Branches
es_es: Sucursales trimestrales

source: What is the procedure to request authorization for merging a commit to the quarterly branch?
es_es: ¿Cuál es el procedimiento para solicitar autorización para fusionar un compromiso con la sucursal trimestral?

source: When doing the commit, add the branch name to the <literal>MFH:</literal> line, for example:
es_es: Al realizar la confirmación, agregue el nombre de la rama al <literal>MFH:</literal> linea, por ejemplo:

source: It will automatically notify the Ports Security Team <email>ports-secteam@FreeBSD.org</email> and the Ports Management Team <email>portmgr@FreeBSD.org</email>. They will then decide if the commit can be merged and answer with the procedure.
es_es: Notificará automáticamente al equipo de seguridad de puertos <email>ports-secteam@FreeBSD.org</email> y el equipo de gestión de puertos <email>portmgr@FreeBSD.org</email>. Luego decidirán si la confirmación se puede fusionar y responderán con el procedimiento.

source: If the commit has already been made, send an email to the Ports Security Team <email>ports-secteam@FreeBSD.org</email> and the Ports Management Team <email>portmgr@FreeBSD.org</email> with the revision number and a small description of why the commit needs to be merged.
es_es: Si la confirmación ya se ha realizado, envíe un correo electrónico al equipo de seguridad de puertos <email>ports-secteam@FreeBSD.org</email> y el equipo de gestión de puertos<email>portmgr@FreeBSD.org</email> con el número de revisión y una pequeña descripción de por qué la confirmación debe fusionarse.

source: If the MFH is covered by a blanket approval, please explain why with a couple of words on the <literal>MFH</literal> line, so that the reviewing team can skip this commit and save time. For example:
es_es: Si el MFH está cubierto por una aprobación general, explique por qué con un par de palabras en el <literal>MFH</literal> línea, para que el equipo de revisión pueda omitir este compromiso y ahorrar tiempo. Por ejemplo:

source: The list of blanket approvals is available in <xref linkend="ports-qa-blanket"/>.
es_es: La lista de aprobaciones generales está disponible en <xref linkend="ports-qa-blanket"/>.

source: Are there any changes that can be merged without asking for approval?
es_es: ¿Hay cambios que se puedan fusionar sin solicitar aprobación?

source: The following blanket approvals for merging to the quarterly branches are in effect:
es_es: Están vigentes las siguientes aprobaciones generales para la fusión con las sucursales trimestrales:

source: This blanket approval also applies to direct commits for ports that have been removed from <literal>head</literal>.
es_es: Esta aprobación general también se aplica a las confirmaciones directas para los puertos que se han eliminado de <literal>head</literal>.

source: These fixes <emphasis>must</emphasis> be tested on the quarterly branch.
es_es: Estas correcciones <emphasis>debe</emphasis> ser probado en la sucursal trimestral.

source: Fixes that do not result in a change in contents of the resulting package. For example:
es_es: Correcciones que no dan como resultado un cambio en el contenido del paquete resultante. Por ejemplo:

source: <filename>pkg-descr</filename>: <literal>WWW:</literal> URL updates (existing 404, moved or incorrect)
es_es: <filename>pkg-descr</filename>:<literal>WWW:</literal> Actualizaciones de URL (404 existente, movida o incorrecta)

source: Build, runtime or packaging fixes, if the quarterly branch version is currently broken.
es_es: Correcciones de compilación, tiempo de ejecución o empaquetado, si la versión de la rama trimestral no funciona actualmente.

source: Missing dependencies (detected, linked against but not registered via <varname><replaceable>*</replaceable>_DEPENDS</varname>).
es_es: Faltan dependencias (detectadas, vinculadas pero no registradas a través de <varname><replaceable>*</replaceable>_DEPENDS</varname>).

source: Fixing <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/uses-shebangfix.html">shebangs</link>, stripping installed libraries and binaries, and plist fixes.
es_es: Arreglando <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/uses-shebangfix.html">shebangs</link>, eliminar las bibliotecas y binarios instalados y las correcciones de plist.
