Repository: doc-br/translate
Catalog: articles/*/fonts.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: Fonts and FreeBSD
es_es: Fuentes y FreeBSD

source: A Tutorial
es_es: Un tutorial

source: $FreeBSD: head/en_US.ISO8859-1/articles/fonts/article.xml 52891 2019-03-23 04:50:01Z bcr $
es_es: $FreeBSD$

source: This document contains a description of the various font files that may be used with FreeBSD and the syscons driver, <application>X11</application>, <application>Ghostscript</application> and <application>Groff</application>. Cookbook examples are provided for switching the syscons display to 80x60 mode, and for using type 1 fonts with the above application programs.
es_es: Este documento contiene una descripción de los divertos archivos de fuentes que pueden utilizarse con FreeBSD y el controlador syscons, <application>X11</application>, <application>Ghostscript</application> y <application>Groff</application>. Se proporcionan manuales paso a paso para cambiar la pantalla de syscons al modo 80x60, y para usar fuentes de tipo 1 con los programas anteriores.

source: Introduction
es_es: Introducción

source: There are many sources of fonts available, and one might ask how they might be used with FreeBSD. The answer can be found by carefully searching the documentation for the component that one would like to use. This is very time consuming, so this tutorial is an attempt to provide a shortcut for others who might be interested.
es_es: Hay muchos orígenes (sources) de fuentes disponibles, y uno podría preguntarse cómo podrían usarse en FreeBSD. La respuesta se puede encontrar buscando cuidadosamente la documentación del componente que desea utilizar. Esto requiere mucho tiempo, por lo que este tutorial es un intento de proporcionar un acceso directo a otras personas que puedan estar interesadas.

source: Basic Terminology
es_es: Terminología básica

source: There are many different font formats and associated font file suffixes. A few that will be addressed here are:
es_es: Hay muchos formatos de fuentes diferentes y sufijos de archivos de fuentes asociadas. Algunos de los que se abordarán aquí son:

source: <trademark class="registered">PostScript</trademark> type 1 fonts. The <filename>.pfa</filename> is the <emphasis>A</emphasis>scii form and <filename>.pfb</filename> the <emphasis>B</emphasis>inary form.
es_es: <trademark class="registered">PostScript</trademark> fuentes tipo 1. <filename>.pfa</filename> es el formato <emphasis>A</emphasis>scii y el <filename>.pfb</filename> es el formato <emphasis>B</emphasis>inario.

source: The font metrics associated with a type 1 font.
es_es: Font metrics asociada con la fuente tipo 1.

source: The printer font metrics associated with a type 1 font.
es_es: Printer font metrics asociada con la fuente tipo 1.

source: A <trademark class="registered">TrueType</trademark> font
es_es: Fuente <trademark class="registered">TrueType</trademark>

source: An indirect reference to a TrueType font (not an actual font)
es_es: Una referencia indirecta a una fuente TrueType (no es una fuente real)

source: Bitmapped screen fonts
es_es: Fuentes de pantalla de mapa de bits

source: The <filename>.fot</filename> is used by <trademark class="registered">Windows</trademark> as sort of a symbolic link to the actual <trademark class="registered">TrueType</trademark> font (<filename>.ttf</filename>) file. The <filename>.fon</filename> font files are also used by Windows. I know of no way to use this font format with FreeBSD.
es_es: El archivo <filename>.fot</filename> es utilizado por <trademark class="registered">Windows</trademark> como una especie de enlace simbólico al archivo de fuente <trademark class="registered">TrueType</trademark> (<filename>.ttf</filename>). Los archivos de fuente <filename>.fon</filename> también son utilizados por Windows. No conozco ninguna forma de usar este formato de fuente en FreeBSD.

source: What Font Formats Can I Use?
es_es: ¿Qué formatos de fuente puedo usar?

source: Which font file format is useful depends on the application being used. FreeBSD by itself uses no fonts. Application programs and/or drivers may make use of the font files. Here is a small cross reference of application/driver to the font type suffixes:
es_es: Qué fuente es útil depende de la aplicación que se esté utilizando. FreeBSD, por si mismo, no utiliza fuentes. Las aplicaciones y/o los controladores pueden utilizar archivos de fuentes. Aquí tiene una pequeña referencia cruzada de la aplicación/controlador para los sufijos del tipo de fuentes:

source: Driver
es_es: Controlador

source: Application
es_es: Aplicación

source: The <filename>.fnt</filename> suffix is used quite frequently. I suspect that whenever someone wanted to create a specialized font file for their application, more often than not they chose this suffix. Therefore, it is likely that files with this suffix are not all the same format; specifically, the <filename>.fnt</filename> files used by syscons under FreeBSD may not be the same format as a <filename>.fnt</filename> one encounters in the <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark> environment. I have not made any attempt at using other <filename>.fnt</filename> files other than those provided with FreeBSD.
es_es: La extensión <filename>.fnt</filename> se utiliza con bastante frecuencia. Sospecho que cada vez que alguien quería crear un archivo de fuente especializado para su aplicación, la mayoría de las veces elegían esta extensión. Por lo tanto, es probable que los archivos con esta extensión, no todos tengan el mismo formato; en concreto, los archivos <filename>.fnt</filename> utilizados por syscons en FreeBSD pueden no tener el mismo formado que un archivo <filename>.fnt</filename> que se encuentre en el entorno <trademark class="registered">MS-DOS</trademark>/<trademark class="registered">Windows</trademark>. No he intentado utilizar otros archivos <filename>.fnt</filename> que no sean los suministrados con FreeBSD.

source: Setting a Virtual Console to 80x60 Line Mode
es_es: Configuración de una consola virtual en modo de línea 80x60

source: First, an 8x8 font must be loaded. To do this, <filename>/etc/rc.conf</filename> should contain the line (change the font name to an appropriate one for your locale):
es_es: En primer lugar, se debe cargar una fuente 8x8. Para ello, el archivo <filename>/etc/rc.conf</filename> debe tener la línea (cambie el nombre de la fuente a una apropiada para su región):

source: font8x8="iso-8x8" # font 8x8 from /usr/share/syscons/fonts/* (or NO).
es_es: font8x8="iso-8x8" # fuente 8x8 de /usr/share/syscons/fonts/* (o NO para cargar la fuente por defecto).

source: The command to actually switch the mode is <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>:
es_es: El comando para cambiar el modo es <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>:

source: Various screen-oriented programs, such as <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, must be able to determine the current screen dimensions. As this is achieved this through <command>ioctl</command> calls to the console driver (such as <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>) they will correctly determine the new screen dimensions.
es_es: Varios programas screen-oriented, como <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, deben ser capaces de determinar el tamaño actual de la pantalla. Esto se logra a través de una llamada de <command>ioctl</command> al controlador de la consola (como <citerefentry><refentrytitle>syscons</refentrytitle><manvolnum>4</manvolnum></citerefentry>), que determinará correctamente las nuevas dimensiones de la pantalla.

source: To make this more seamless, one can embed these commands in the startup scripts so it takes place when the system boots. To do this is add this line to <filename>/etc/rc.conf</filename>.
es_es: Para hacerlo más sencillo, puede incluir estos comandos en los scripts de inicio del sistema, para que se ejecuten cuando se inicie el sistema. Para hacerlo, agregue esta línea en el archivo <filename>/etc/rc.conf</filename>.

source: allscreens_flags="VGA_80x60" # Set this vidcontrol mode for all virtual screens
es_es: allscreens_flags="VGA_80x60" # Establecer el modo vidcontrol para todas las pantallas virtuales

source: References: <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Referencias: <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>vidcontrol</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Using Type 1 Fonts with <application>X11</application>
es_es: Usando fuentes Type 1 con <application>X11</application>

source: <application>X11</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. The <application>X11</application> fonts are located in various subdirectories under <filename>/usr/X11R6/lib/X11/fonts</filename>. Each font file is cross referenced to its <application>X11</application> name by the contents of <filename>fonts.dir</filename> in each directory.
es_es: <application>X11</application> puede utilizar tanto el formato <filename>.pfa</filename> como el formato <filename>.pfb</filename>. Las fuentes de <application>X11</application> se encuentran en varios subdirectorios por debajo de <filename>/usr/X11R6/lib/X11/fonts</filename>. Cada fuente es una referencia cruzada entre su nombre <application>X11</application> y el contenido del archivo <filename>fonts.dir</filename> en cada directorio.

source: There is already a directory named <filename>Type1</filename>. The most straight forward way to add a new font is to put it into this directory. A better way is to keep all new fonts in a separate directory and use a symbolic link to the additional font. This allows one to more easily keep track of ones fonts without confusing them with the fonts that were originally provided. For example:
es_es: Ya existe un directorio llamado <filename>Type1</filename>. La forma más directa de añadir una nueva fuente es ponerla en ese directorio. Una mejor forma sería colocar todas las fuentes nuevas en un directorio separado y utilizar un enlace simbólico a las fuentes adicionales. Esto permite identificar las fuentes sin confundir las que se suministraron originalmente. Por ejemplo:

source: <lineannotation>Create a directory to contain the font files</lineannotation> <prompt>%</prompt> <userinput>mkdir -p /usr/local/share/fonts/type1</userinput> <prompt>%</prompt> <userinput>cd /usr/local/share/fonts/type1</userinput> <lineannotation>Place the .pfa, .pfb and .afm files here</lineannotation> <lineannotation>One might want to keep readme files, and other documentation</lineannotation> <lineannotation>for the fonts here also</lineannotation> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.pfb .</userinput> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.afm .</userinput> <lineannotation>Maintain an index to cross reference the fonts</lineannotation> <prompt>%</prompt> <userinput>echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat &gt;&gt;INDEX</userinput>
es_es: <lineannotation>Crear un directorio para contener los archivos de fuentes.</lineannotation> <prompt>%</prompt> <userinput>mkdir -p /usr/local/share/fonts/type1</userinput> <prompt>%</prompt> <userinput>cd /usr/local/share/fonts/type1</userinput> <lineannotation>Coloque los archivos .pfa, .pfb y .afm aquí</lineannotation> <lineannotation>Se puede querer mantener los archivos readme, y otras documentaciones</lineannotation> <lineannotation>para las fuentes</lineannotation> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.pfb .</userinput> <prompt>%</prompt> <userinput>cp /cdrom/fonts/atm/showboat/showboat.afm .</userinput> <lineannotation>Mantenga un índice para la referencia cruzada de las fuentes</lineannotation> <prompt>%</prompt> <userinput>echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat &gt;&gt;INDEX</userinput>

source: Now, to use a new font with <application>X11</application>, one must make the font file available and update the font name files. The <application>X11</application> font names look like:
es_es: Ahora, pasar usar la fuente nueva con <application>X11</application>, debe hacer que el archivo de fuente esté disponible y actualizar el nombre de la fuente. Los nombres de las fuentes de <application>X11</application> son así:

source: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- character set | | | | \ \ \ \ \ \ \ +- average width | | | | \ \ \ \ \ \ +- spacing | | | \ \ \ \ \ \ +- vertical res. | | | \ \ \ \ \ +- horizontal res. | | | \ \ \ \ +- points | | | \ \ \ +- pixels | | | \ \ \ foundry family weight slant width additional style
es_es: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- juego de caracteres | | | | \ \ \ \ \ \ \ +- ancho promedio | | | | \ \ \ \ \ \ +- espaciado | | | \ \ \ \ \ \ +- resolución vertical. | | | \ \ \ \ \ +- resolución horizontal. | | | \ \ \ \ +- puntos | | | \ \ \ +- píxeles | | | \ \ \ empresa familia densidad inclinación anchura estilo adicional

source: A new name needs to be created for each new font. If you have some information from the documentation that accompanied the font, then it could serve as the basis for creating the name. If there is no information, then you can get some idea by using <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> on the font file. For example:
es_es: Es necesario crear un nombre nuevo para cada fuente. Si tiene alguna información de la documentación que acompaña a la fuente, podría servir como base para crear el nombre. Si no hay información, entonces puede hacerse una idea utilizando el comando <citerefentry><refentrytitle>strings</refentrytitle> <manvolnum>1</manvolnum></citerefentry> en la fuente Por ejemplo:

source: Using this information, a possible name might be:
es_es: Usando esta información, un nombre podría ser:

source: The components of our name are:
es_es: Los componentes de nuestro nombre son:

source: Foundry
es_es: Empresa

source: Lets just name all the new fonts <literal>type1</literal>.
es_es: Vamos a nombrar todas las fuentes nuevas como <literal>type1</literal>.

source: Family
es_es: Familia

source: The name of the font.
es_es: El nombre de la fuente.

source: Weight
es_es: Densidad

source: Normal, bold, medium, semibold, etc. From the <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry> output above, it appears that this font has a weight of <emphasis>medium</emphasis>.
es_es: Normal, negrita, media, seminegrita, etc. Por el resultado anterior del comando <citerefentry><refentrytitle>strings</refentrytitle><manvolnum>1</manvolnum></citerefentry>, parece que esta fuente tiene una densidad <emphasis>media</emphasis>.

source: Slant
es_es: Inclinación

source: <emphasis remap="bf">r</emphasis>oman, <emphasis remap="bf">i</emphasis>talic, <emphasis remap="bf">o</emphasis>blique, etc. Since the <emphasis>ItalicAngle</emphasis> is zero, <emphasis>roman</emphasis> will be used.
es_es: <emphasis remap="bf">r</emphasis>oman, <emphasis remap="bf">c</emphasis>ursiva, <emphasis remap="bf">o</emphasis>blicua, etc. Dado que <emphasis>ItalicAngle</emphasis> es cero, se utilizará <emphasis>roman</emphasis>.

source: Width
es_es: Anchura

source: Normal, wide, condensed, extended, etc. Until it can be examined, the assumption will be <emphasis>normal</emphasis>.
es_es: Normal, ancha, condensada, extendida, etc. Hasta que pueda ser examinada, suponemos que será <emphasis>normal</emphasis>.

source: Additional style
es_es: Estilo adicional

source: Usually omitted, but this will indicate that the font contains decorative capital letters.
es_es: Generalmente se omite, pero esto indicará que la fuente contiene mayúsculas decorativas.

source: Spacing
es_es: Espaciado

source: proportional or monospaced. <emphasis>Proportional</emphasis> is used since <emphasis>isFixedPitch</emphasis> is false.
es_es: proporcional o monoespaciado. La opción <emphasis>Proportional</emphasis> se usa cuando <emphasis>isFixedPitch</emphasis> es false.

source: All of these names are arbitrary, but one should strive to be compatible with the existing conventions. A font is referenced by name with possible wild cards by an <application>X11</application> program, so the name chosen should make some sense. One might begin by simply using <_:informalexample-1/> as the name, and then use <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry> to examine it and adjust the name based on the appearance of the font.
es_es: Todos estos nombres son arbitrarios, pero uno debe tratar de ser compatible con las convenciones existentes. El nombre hace referencia a la fuente con posibles comodines del programa <application>X11</application>, por lo que el nombre elegido debe tener algún sentido. Simplemente puede comenzar a usar <_:informalexample-1/> como nombre, y luego usar <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry> para examinarla y ajustar el nombre en función de la apariencia de la fuente.

source: So, to complete our example:
es_es: Con lo cual, para completar nuestro ejemplo:

source: <lineannotation>Make the font accessible to X11</lineannotation> <prompt>%</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/Type1</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edit fonts.dir and fonts.scale, adding the line describing the font and incrementing the number of fonts which is found on the first line.</lineannotation> <prompt>%</prompt> <userinput>ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq</userinput> <lineannotation>fonts.scale seems to be identical to fonts.dir…</lineannotation> <prompt>%</prompt> <userinput>cp fonts.dir fonts.scale</userinput> <lineannotation>Tell X11 that things have changed</lineannotation> <prompt>%</prompt> <userinput>xset fp rehash</userinput> <lineannotation>Examine the new font</lineannotation> <prompt>%</prompt> <userinput>xfontsel -pattern -type1-*</userinput>
es_es: <lineannotation>Haga que la fuente esté accesible para X11</lineannotation> <prompt>%</prompt> <userinput>cd /usr/X11R6/lib/X11/fonts/Type1</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite fonts.dir y fonts.scale, agregando la línea que describe la fuente e incrementando el número de fuentes que se encuentran en la primera línea.</lineannotation> <prompt>%</prompt> <userinput>ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq</userinput> <lineannotation>fonts.scale parece ser idéntico a fonts.dir…</lineannotation> <prompt>%</prompt> <userinput>cp fonts.dir fonts.scale</userinput> <lineannotation>Indique a X11 que las cosas han cambiado</lineannotation> <prompt>%</prompt> <userinput>xset fp rehash</userinput> <lineannotation>Examine la fuente nueva</lineannotation> <prompt>%</prompt> <userinput>xfontsel -pattern -type1-*</userinput>

source: References: <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry vendor="xfree86"><refentrytitle>xset</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citetitle>The X Windows System in a Nutshell</citetitle>, <link xlink:href="http://www.ora.com/">O'Reilly &amp; Associates</link>.
es_es: Referencias: <citerefentry vendor="xfree86"><refentrytitle>xfontsel</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citerefentry vendor="xfree86"><refentrytitle>xset</refentrytitle><manvolnum>1</manvolnum></citerefentry>, <citetitle>The X Windows System in a Nutshell</citetitle>, <link xlink:href="http://www.ora.com/">O'Reilly &amp; Associates</link>.

source: Using Type 1 Fonts with Ghostscript
es_es: Usando fuentes Type 1 con Ghostscript

source: <application>Ghostscript</application> references a font via its <filename>Fontmap</filename>. This must be modified in a similar way to the <application>X11</application> <filename>fonts.dir</filename>. <application>Ghostscript</application> can use either the <filename>.pfa</filename> or the <filename>.pfb</filename> format fonts. Using the font from the previous example, here is how to use it with <application>Ghostscript</application>:
es_es: <application>Ghostscript</application> hace referencia a una fuente a travéz de su archivo <filename>Fontmap</filename>. Esto debe modificarse de manera similar al archivo <filename>fonts.dir</filename> de <application>X11</application>. <application>Ghostscript</application> puede usar los formatos <filename>.pfa</filename> y <filename>.pfb</filename>. Usando la fuente del ejemplo anterior, aquí hay una guía paso a paso sobre cómo usarla con <application>Ghostscript</application>:
