Repository: doc-br/translate
Catalog: articles/*/fonts.po
Languages: es_es

source: <lineannotation>Put the font in Ghostscript's font directory</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/fonts</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edit Fontmap so Ghostscript knows about the font</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/4.01</userinput> <prompt>%</prompt> <userinput>ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq</userinput> <lineannotation>Use Ghostscript to examine the font</lineannotation> <prompt>%</prompt> <userinput>gs prfont.ps</userinput> Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS&gt;<userinput>Showboat DoFont</userinput> Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; GS&gt;<userinput>quit</userinput>
es_es: <lineannotation>Coloque la fuente en el directorio de fuentes de Ghostscript</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/fonts</userinput> <prompt>%</prompt> <userinput>ln -s /usr/local/share/fonts/type1/showboat.pfb .</userinput> <lineannotation>Edite el archivo Fontmap para que Ghostscript esté al corriente de la fuente</lineannotation> <prompt>%</prompt> <userinput>cd /usr/local/share/ghostscript/4.01</userinput> <prompt>%</prompt> <userinput>ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq</userinput> <lineannotation>Use Ghostscript para examinar la fuente</lineannotation> <prompt>%</prompt> <userinput>gs prfont.ps</userinput> Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS&gt;<userinput>Showboat DoFont</userinput> Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; &gt;&gt;showpage, press &lt;return&gt; to continue&lt;&lt; GS&gt;<userinput>quit</userinput>

source: References: <filename>fonts.txt</filename> in the <application>Ghostscript 4.01</application> distribution
es_es: Referencias: consulte el archivo <filename>fonts.txt</filename> en la distribución <application>4.01 de Ghostscript</application>

source: Using Type 1 Fonts with Groff
es_es: Usando fuentes Type 1 con Groff

source: Now that the new font can be used by both <application>X11</application> and <application>Ghostscript</application>, how can one use the new font with <application>groff</application>? First of all, since we are dealing with type 1 <trademark class="registered">PostScript</trademark> fonts, the <application>groff</application> device that is applicable is the <emphasis>ps</emphasis> device. A font file must be created for each font that <application>groff</application> can use. A <application>groff</application> font name is just a file in <filename>/usr/share/groff_font/devps</filename>. With our example, the font file could be <filename>/usr/share/groff_font/devps/SHOWBOAT</filename>. The file must be created using tools provided by <application>groff</application>.
es_es: Ahora que la nueva fuente puede ser utilizada tanto por <application>X11</application> como por <application>Ghostscript</application>, ¿cómo se puede usar la nueva fuente con <application>groff</application>? En primer lugar, dado que estamos utilizando fuentes <trademark class="registered">PostScript</trademark> type 1, el dispositivo <application>groff</application> es aplicable en el dispositivo <emphasis>ps</emphasis>. Se debe crear un archivo de fuente para cada fuente que se pueda usar con <application>groff</application>. Un nombre de fuente de <application>groff</application> es simplemente un archivo en el directorio <filename>/usr/share/groff_font/devps</filename>. Con nuestro ejemplo, el archivo de la fuente podría ser <filename>/usr/share/groff_font/devps/SHOWBOAT</filename>. El archivo debe crearse utilizando las herramientas proporcionadas por <application>groff</application>.

source: The first tool is <command>afmtodit</command>. This is not normally installed, so it must be retrieved from the source distribution. I found I had to change the first line of the file, so I did:
es_es: La primera herramienta es <command>afmtodit</command>. Normalmente, no está instalada, por lo que debe recuperarse de la distribución de origen. Descubrí que tenía que cambiar la primera línea del archivo, así que hice:

source: This tool will create the <application>groff</application> font file from the metrics file (<filename>.afm</filename> suffix.) Continuing with our example:
es_es: Esta herramienta creará el archivo de fuente <application>groff</application> a partir del archivo de métricas (sufijo <filename>.afm</filename>). Continuando con nuestro ejemplo:

source: <lineannotation>Many .afm files are in Mac format… ^M delimited lines We need to convert them to <trademark class="registered">UNIX</trademark> style ^J delimited lines</lineannotation> <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' &gt;showboat.afm</userinput> <lineannotation>Now create the groff font file</lineannotation> <prompt>%</prompt> <userinput>cd /usr/share/groff_font/devps</userinput> <prompt>%</prompt> <userinput>/tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT</userinput>
es_es: <lineannotation>Muchos archivos .afm están en formato Mac, con ^M delimitando las líneas Tenemos que convertirlos al estilo <trademark class="registered">UNIX</trademark> que delimita las líneas con ^J</lineannotation> <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' &gt;showboat.afm</userinput> <lineannotation>Ahora cree el archivo de fuente groff</lineannotation> <prompt>%</prompt> <userinput>cd /usr/share/groff_font/devps</userinput> <prompt>%</prompt> <userinput>/tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT</userinput>

source: The font can now be referenced with the name SHOWBOAT.
es_es: Ahora se puede hacer referencia a la fuente con el nombre SHOWBOAT.

source: If <application>Ghostscript</application> is used to drive the printers on the system, then nothing more needs to be done. However, if true <trademark class="registered">PostScript</trademark> printers are used, then the font must be downloaded to the printer in order for the font to be used (unless the printer happens to have the showboat font built in or on an accessible font disk.) The final step is to create a downloadable font. The <command>pfbtops</command> tool is used to create the <filename>.pfa</filename> format of the font, and <filename>download</filename> is modified to reference the new font. The <filename>download</filename> must reference the internal name of the font. This can easily be determined from the groff font file as illustrated:
es_es: Si se usa <application>Ghostscript</application> para manejar las impresoras en el sistema, no es necesario hacer nada más. Sin embargo, si las impresoras usan <trademark class="registered">PostScript</trademark>, entonces la fuente se debe descargada a la impresora para que la pueda usar (a menos que la impresora tenga la fuente showboat incorporada o en un disco que esté accesible.) El último paso es crear una fuente descargable. La herramienta <command>pfbtops</command> se utiliza para crear el formato de fuente <filename>.pfa</filename>, y el archivo <filename>download</filename> se modifica para hacer referencia a la nueva fuente. El archivo <filename>download</filename> debe hacer referencia al nombre interno de la fuente. Esto se puede determinar fácilmente a partir del archivo de fuente de groff como se indica:

source: <lineannotation>Create the .pfa font file</lineannotation> <prompt>%</prompt> <userinput>pfbtops /usr/local/share/fonts/type1/showboat.pfb &gt;showboat.pfa</userinput>
es_es: <lineannotation>Cree el archivo de fuente .pfa</lineannotation> <prompt>%</prompt> <userinput>pfbtops /usr/local/share/fonts/type1/showboat.pfb &gt;showboat.pfa</userinput>

source: Of course, if <filename>.pfa</filename> is already available, just use a symbolic link to reference it.
es_es: Por supuesto, si el archivo <filename>.pfa</filename> ya existe, simplemente cree un enlace simbólico para referenciarlo.

source: <lineannotation>Get the internal font name</lineannotation> <prompt>%</prompt> <userinput>fgrep internalname SHOWBOAT</userinput> internalname Showboat <lineannotation>Tell groff that the font must be downloaded</lineannotation> <prompt>%</prompt> <userinput>ex download :$a Showboat showboat.pfa . :wq</userinput>
es_es: <lineannotation>Obtener el nombre interno de la fuente</lineannotation> <prompt>%</prompt> <userinput>fgrep internalname SHOWBOAT</userinput> internalname Showboat <lineannotation>Indique a groff que la fuente debe ser descargada</lineannotation> <prompt>%</prompt> <userinput>ex download :$a Showboat showboat.pfa . :wq</userinput>

source: To test the font:
es_es: Para probar la fuente:

source: <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat &gt;example.t &lt;&lt;EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF</userinput> <prompt>%</prompt> <userinput>groff -Tps example.t &gt;example.ps</userinput> <lineannotation>To use ghostscript/ghostview</lineannotation> <prompt>%</prompt> <userinput>ghostview example.ps</userinput> <lineannotation>To print it</lineannotation> <prompt>%</prompt> <userinput>lpr -Ppostscript example.ps</userinput>
es_es: <prompt>%</prompt> <userinput>cd /tmp</userinput> <prompt>%</prompt> <userinput>cat &gt;example.t &lt;&lt;EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF</userinput> <prompt>%</prompt> <userinput>groff -Tps example.t &gt;example.ps</userinput> <lineannotation>Para utilizar ghostscript/ghostview</lineannotation> <prompt>%</prompt> <userinput>ghostview example.ps</userinput> <lineannotation>Para imprimirla</lineannotation> <prompt>%</prompt> <userinput>lpr -Ppostscript example.ps</userinput>

source: References: <filename>/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man</filename>, <citerefentry><refentrytitle>groff_font</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_char</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>pfbtops</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Referencias: <filename>/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man</filename>, <citerefentry><refentrytitle>groff_font</refentrytitle><manvolnum>5</manvolnum></citerefentry>, <citerefentry><refentrytitle>groff_char</refentrytitle><manvolnum>7</manvolnum></citerefentry>, <citerefentry><refentrytitle>pfbtops</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Converting TrueType Fonts to a groff/PostScript Format For groff
es_es: Conversión de fuentes TrueType a un formato groff/PostScript para groff

source: This potentially requires a bit of work, simply because it depends on some utilities that are not installed as part of the base system. They are:
es_es: Esto puede requerir un poco de trabajo, simplemente porque depende de algunas utilidades que no están instaladas como parte del sistema base. Son:

source: TrueType to PostScript conversion utilities. This allows conversion of a TrueType font to an ascii font metric (<filename>.afm</filename>) file.
es_es: Utilidades de conversión de TrueType a PostScript. Esto permite la conversión de una fuente TrueType a un archivo de métrica de fuente ascii (<filename>.afm</filename>).

source: Currently available at <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/">http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Note: These files are PostScript programs and must be downloaded to disk by holding down <keycap>Shift</keycap> when clicking on the link. Otherwise, your browser may try to launch <application>ghostview</application> to view them.
es_es: Actualmente disponible en <uri xlink:href="http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/">http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/</uri>. Nota: Estos ficheros son programas PostScript y deben ser descargados manteniendo la tecla <keycap>Shift</keycap> cuando haga clic en el enlace. De lo contrario, su navegador puede intentar iniciar <application>ghostview</application> para verlos.

source: The files of interest are:
es_es: Los archivos de interés son:

source: The funny upper/lower case is due to their being intended also for DOS shells. <filename>ttf2pf.ps</filename> makes use of the others as upper case, so any renaming must be consistent with this. (Actually, <filename>GS_TTF.PS</filename> and <filename>PFS2AFM.PS</filename> are supposedly part of the <application>Ghostscript</application> distribution, but it is just as easy to use these as an isolated utility. FreeBSD does not seem to include the latter.) You also may want to have these installed to <filename>/usr/local/share/groff_font/devps</filename>(?).
es_es: Lo divertido del caso mayúscula/minúscula es que también están destinadas a los shells de DOS. <filename>ttf2pf.ps</filename> utiliza el resto como mayúsculas, por lo que cualquier cambio de nombre debe ser consistente con esto. (En realidad, <filename>GS_TTF.PS</filename> y <filename>PFS2AFM.PS</filename> son parte de la distribución de <application>Ghostscript</application>, pero es muy fácil usarlos como utilidades independientes. FreeBSD parece no incluir esta última.) También es posible que desee tenerlas instaladas en <filename>/usr/local/share/groff_font/devps</filename>(?).

source: Creates font files for use with <application>groff</application> from ascii font metrics file. This usually resides in the directory, <filename>/usr/src/contrib/groff/afmtodit</filename>, and requires some work to get going.
es_es: Crea archivos de fuentes para usar con <application>groff</application> desde el archivo de métricas de fuentes ascii. Por lo general, se encuentra en el directorio <filename>/usr/src/contrib/groff/afmtodit</filename>, y requiere algo de trabajo para continuar.

source: If you are paranoid about working in the <filename>/usr/src</filename> tree, simply copy the contents of the above directory to a work location.
es_es: Si desconfia de trabajar en el directorio <filename>/usr/src</filename>, simplemente copie el contenido del directorio anterior en otra ubicación.

source: In the work area, you will need to make the utility. Just type:
es_es: En el directorio, necesitará compilar la utilidad. Escriba:

source: You may also need to copy <filename>/usr/contrib/groff/devps/generate/textmap</filename> to <filename>/usr/share/groff_font/devps/generate</filename> if it does not already exist.
es_es: También es posible que necesite copiar <filename>/usr/contrib/groff/devps/generate/textmap</filename> a <filename>/usr/share/groff_font/devps/generate</filename> si no existe.

source: Once all these utilities are in place, you are ready to commence:
es_es: Una vez que todas estas utilidades estén en su sitio, estará listo para comenzar:

source: Create <filename>.afm</filename> by typing:
es_es: Cree el archivo <filename>.afm</filename> escribiendo:

source: <prompt>%</prompt> <userinput>gs -dNODISPLAY -q -- ttf2pf.ps <replaceable>TTF_name</replaceable> <replaceable>PS_font_name</replaceable> <replaceable>AFM_name</replaceable></userinput>
es_es: <prompt>%</prompt> <userinput>gs -dNODISPLAY -q -- ttf2pf.ps <replaceable>nombre_TTF</replaceable> <replaceable>nombre_fuente_PS</replaceable> <replaceable>nombre_AFM</replaceable></userinput>

source: Where, <replaceable>TTF_name</replaceable> is your TrueType font file, <replaceable>PS_font_name</replaceable> is the file name for <filename>.pfa</filename>, <replaceable>AFM_name</replaceable> is the name you wish for <filename>.afm</filename>. If you do not specify output file names for the <filename>.pfa</filename> or <filename>.afm</filename> files, then default names will be generated from the TrueType font file name.
es_es: Donde, <replaceable>nombre_TTF</replaceable> es su archivo de fuente TrueType, <replaceable>nombre_fuente_PS</replaceable> es el nombre del archivo <filename>.pfa</filename>, <replaceable>nombre_AFM</replaceable> es el nombre que quiere que tenga el archivo <filename>.afm</filename>. Si no especifica los nombres de los archivos de salida para los archivos <filename>.pfa</filename> o <filename>.afm</filename, los nombres predeterminados se generan a partir del nombre de archivo de la fuente TrueType.

source: This also produces a <filename>.pfa</filename>, the ascii PostScript font metrics file (<filename>.pfb</filename> is for the binary form). This will not be needed, but could (I think) be useful for a fontserver.
es_es: Esto también produce un archivo <filename>.pfa</filename>, el archivo ascii de las métricas de la fuente PostScript (<filename>.pfb</filename> es para el formato binario). Esto no será necesario, pero podría (creo) ser útil para un servidor de fuentes.

source: For example, to convert the 30f9 Barcode font using the default file names, use the following command:
es_es: Por ejemplo, para convertir la fuente de código de barras 30f9 usando los nombres de archivo predeterminados, use el siguiente comando:

source: If you want the converted fonts to be stored in <filename>A.pfa</filename> and <filename>B.afm</filename>, then use this command:
es_es: Si desea que las fuentes convertidas se almacenen en <filename>A.pfa</filename> y <filename>B.afm</filename>, use este comando:

source: Create the <application>groff</application> PostScript file:
es_es: Crear el archivo PostScript <application>groff</application>:

source: Change directories to <filename>/usr/share/groff_font/devps</filename> so as to make the following command easier to execute. You will probably need root privileges for this. (Or, if you are paranoid about working there, make sure you reference the files <filename>DESC</filename>, <filename>text.enc</filename> and <filename>generate/textmap</filename> as being in this directory.)
es_es: Vaya al directorio <filename>/usr/share/groff_font/devps</filename> para que sea más fácil de ejecutar el siguiente comando. Probablemente necesitará privilegios de root. (O, si desconfia de trabajar en ese directorio, asegúrese de hacer referencia a los archivos <filename>DESC</filename>, <filename>text.enc</filename> y <filename>generate/textmap</filename> que están en este directorio).

source: <prompt>%</prompt> <userinput>afmtodit -d DESC -e text.enc file.afm generate/textmap <replaceable>PS_font_name</replaceable></userinput>
es_es: <prompt>%</prompt> <userinput>afmtodit -d DESC -e text.enc file.afm generate/textmap <replaceable>nombre_fuente_PS</replaceable></userinput>

source: Where, <filename>file.afm</filename> is the <replaceable>AFM_name</replaceable> created by <command>ttf2pf.ps</command> above, and <replaceable>PS_font_name</replaceable> is the font name used from that command, as well as the name that <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> will use for references to this font. For example, assuming you used the first <command>tiff2pf.ps</command> above, then the 3of9 Barcode font can be created using the command:
es_es: Donde, <filename>file.afm</filename> es el <replaceable>AFM_name</replaceable> creado anteriormente por <command>ttf2pf.ps</command> y <replaceable>nombre_fuente_PS</replaceable> es el nombre de la fuente utilizada para ese comando, así como el nombre que <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilizará para las referencias a este fuente. Por ejemplo, suponiendo que haya utilizado el primero comando <command>tiff2pf.ps</command>, entonces, la fuente de código de barras 3of9 se puede crear usando el comando:

source: Ensure that the resulting <replaceable>PS_font_name</replaceable> file (e.g., <filename>3of9</filename> in the example above) is located in the directory <filename>/usr/share/groff_font/devps</filename> by copying or moving it there.
es_es: Asegúrese de que el archivo <replaceable>nombre_fuente_PS</replaceable> resultante (por ejemplo, <filename>3of9</filename> en el ejemplo anterior) se encuentra en el directorio <filename>/usr/share/groff_font/devps</filename> al copiarlo o moverlo allí.

source: Note that if <filename>ttf2pf.ps</filename> assigns a font name using the one it finds in the TrueType font file and you want to use a different name, you must edit the <filename>.afm</filename> prior to running <command>afmtodit</command>. This name must also match the one used in the Fontmap file if you wish to pipe <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> into <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Tenga en cuenta que si <filename>ttf2pf.ps</filename> asigna un nombre de fuente con el nombre que se encuentra en el archivo de fuentes TrueType y quiere usar un nombre diferente, antes de ejecutar <command>afmtodit</command> editar el archivo <filename>.afm</filename>. Este nombre también debe coincidir con el que se usa en el archivo Fontmap si desea redirigir <citerefentry><refentrytitle>groff</refentrytitle><manvolnum>1</manvolnum></citerefentry> a <citerefentry vendor="ports"><refentrytitle>gs</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Can TrueType Fonts be Used with Other Programs?
es_es: ¿Se pueden usar las fuentes TrueType con otros programas?

source: The TrueType font format is used by Windows, Windows 95, and Mac's. It is quite popular and there are a great number of fonts available in this format.
es_es: Windows, Windows 95 y Mac utilizan el formato de fuente TrueType. Es bastante popular y hay una gran cantidad de fuentes disponibles en este formato.
