Repository: doc-br/translate
Catalog: articles/*/fonts.po
Languages: es_es

source: Unfortunately, there are few applications that I am aware of that can use this format: <application>Ghostscript</application> and <application>Povray</application> come to mind. <application>Ghostscript's</application> support, according to the documentation, is rudimentary and the results are likely to be inferior to type 1 fonts. <application>Povray</application> version 3 also has the ability to use TrueType fonts, but I rather doubt many people will be creating documents as a series of raytraced pages :-).
es_es: Desafortunadamente, conozco pocas aplicaciones que puedan usar este formato: me vienen a la mente <application>Ghostscript</application> y <application>Povray</application>. Según la documentación, el soporte de <application>Ghostscript</application> es rudimentario y es probable que los resultados sean inferiores a las fuentes Type 1. La versión 3 de <application>Povray</application> también tiene la capacidad de usar fuentes TrueType, pero dudo que muchas personas creen documentos como una serie de páginas con raytraced :-).

source: This rather dismal situation may soon change. The <link xlink:href="http://www.freetype.org/">FreeType Project</link> is currently developing a useful set of FreeType tools:
es_es: Esta situación, un tanto triste, puede cambiar pronto. El <link xlink:href="http://www.freetype.org/">proyecto FreeType</link> está desarrollando actualmente un conjunto útil de herramientas FreeType:

source: The <command>xfsft</command> font server for <application>X11</application> can serve TrueType fonts in addition to regular fonts. Though currently in beta, it is said to be quite usable. See <link xlink:href="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">Juliusz Chroboczek's page</link> for further information. Porting instructions for FreeBSD can be found at <link xlink:href="http://math.missouri.edu/~stephen/software/">Stephen Montgomery's software page</link>.
es_es: El servidor de fuentes para <application>X11</application>, <command>xfsft</command>, puede proporcionar fuentes TrueTYpe además de las fuentes normales. Aunque actualmente se encuentra en versión beta, dicen que es bastante útil. Vea la <link xlink:href="http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/">página de Juliusz Chroboczek</link> para más información. Las instrucciones para portarlo a FreeBSD se pueden encontrar en la <link xlink:href="http://math.missouri.edu/~stephen/software/">página de software de Stephen Montgomery</link>.

source: <application>xfstt</application> is another font server for <application>X11</application>, available under <uri xlink:href="ftp://sunsite.unc.edu/pub/Linux/X11/fonts/">ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.
es_es: <application>xfstt</application> es otro servidor de fuentes para <application>X11</application>, disponible en <uri xlink:href="ftp://sunsite.unc.edu/pub/Linux/X11/fonts/">ftp://sunsite.unc.edu/pub/Linux/X11/fonts/</uri>.

source: A program called <command>ttf2bdf</command> can produce BDF files suitable for use in an X environment from TrueType files. Linux binaries are said to be available from <uri xlink:href="ftp://crl.nmsu.edu/CLR/multiling/General/">ftp://crl.nmsu.edu/CLR/multiling/General/</uri>.
es_es: Un programa llamado <command>ttf2bdf</command> puede producir archivos BDF adecuados para su uso en un entorno X a partir de archivos TrueType. Los binarios para Linux están disponibles en <uri xlink:href="ftp://crl.nmsu.edu/CLR/multiling/General/">ftp://crl.nmsu.edu/CLR/multiling/General/</uri>.

source: and others …
es_es: y otras…

source: Where Can Additional Fonts be Obtained?
es_es: ¿Dónde se pueden obtener fuentes adicionales?

source: Many fonts are available on the Internet. They are either entirely free, or are share-ware. In addition many fonts are available in the <filename>x11-fonts/</filename> category in the ports collection
es_es: Muchas fuentes están disponibles en Internet. Son totalmente gratuitas o shareware. Además, muchas fuentes están disponibles en la categoría de ports <filename>x11-fonts/</filename>

source: Additional Questions
es_es: Preguntas adicionales

source: What use are the <filename>.pfm</filename> files?
es_es: ¿Para qué sirven los archivos <filename>.pfm</filename>?

source: Can one generate the <filename>.afm</filename> from a <filename>.pfa</filename> or <filename>.pfb</filename>?
es_es: ¿Se puede generar el archivo <filename>.afm</filename> desde un archivo <filename>.pfa</filename> o <filename>.pfb</filename>?

source: How to generate the <application>groff</application> character mapping files for PostScript fonts with non-standard character names?
es_es: ¿Cómo generar los archivos de mapeo de caracteres <application>groff</application> para fuentes PostScript con nombres de caracteres no estándar?

source: Can xditview and devX?? devices be set up to access all the new fonts?
es_es: ¿Se pueden configurar los dispositivos xditview y devX para acceder a todas las fuentes nuevas?

source: It would be good to have examples of using TrueType fonts with <application>Povray</application> and <application>Ghostscript</application>.
es_es: Sería bueno tener ejemplos del uso de fuentes TrueType con <application>Povray</application> y <application>Ghostscript</application>.
