Repository: doc-br/translate
Catalog: articles/*/freebsd-update-server.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019, 2020

source: Build Your Own FreeBSD Update Server
es_es: Construye tu propio servidor de actualizaciones de FreeBSD

source: This article describes building an internal <application>FreeBSD Update Server</application>. The <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/">freebsd-update-server</link> is written by Colin Percival <email>cperciva@FreeBSD.org</email>, Security Officer Emeritus of FreeBSD. For users that think it is convenient to update their systems against an official update server, building their own <application>FreeBSD Update Server</application> may help to extend its functionality by supporting manually-tweaked FreeBSD releases or by providing a local mirror that will allow faster updates for a number of machines.
es_es: Este artículo describe cómo construir un <application>FreeBSD Update Server</application> propio. <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/">freebsd-update-server</link> está escrito por Colin Percival <email>cperciva@FreeBSD.org</email>, oficial de seguridad emérito de FreeBSD. Para los usuarios que piensan que es conveniente actualizar sus sistemas desde un servidor de actualizaciones oficial, crear su propio <application>FreeBSD Update Server</application> puede ayudar a ampliar la funcionalidad al admitir las versiones de FreeBSD modificadas manualmente o al proporcionar una réplica local que permita actualizaciones más rápidas para un número concreto de ordenadores.

source: Acknowledgments
es_es: Agradecimientos

source: This article was subsequently printed at <link xlink:href="https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf">BSD Magazine</link>.
es_es: Este artículo fue publicado posteriormente en <link xlink:href="https://people.freebsd.org/~jgh/files/fus/BSD_03_2010_EN.pdf">BSD Magazine</link>.

source: Introduction
es_es: Introducción

source: Experienced users or administrators are often responsible for several machines or environments. They understand the difficult demands and challenges of maintaining such an infrastructure. Running a <application>FreeBSD Update Server</application> makes it easier to deploy security and software patches to selected test machines before rolling them out to production. It also means a number of systems can be updated from the local network rather than a potentially slower Internet connection. This article outlines the steps involved in creating an internal <application>FreeBSD Update Server</application>.
es_es: Los usuarios experimentados o administradores a menudo son responsables de múltiples máquinas o entornos. Entienden las complicadas demandas y los desafíos de mantener una infraestructura de este tipo. Ejecutar un <application>Servidor de actualizaciones de FreeBSD</application> facilita la implementación de parches de seguridad y software en las máquinas de pruebas seleccionadas antes de implementarlos en producción. Esto también significa que se pueden actualizar varios sistemas desde la red local en lugar de una conexión a Internet la cual sea potencialmente más lenta. Este artículo describe los pasos necesarios para crear un <application>servidor de actualizaciones de FreeBSD</application> propio.

source: Prerequisites
es_es: Prerequisitos

source: To build an internal <application>FreeBSD Update Server</application> some requirements should be met.
es_es: Para construir un <application>Servidor de actualizaciones de FreeBSD</application> propio se deben cumplir algunos requisitos.

source: A running FreeBSD system.
es_es: Un sistema FreeBSD en ejecución.

source: At a minimum, updates require building on a FreeBSD release greater than or equal to the target release version for distribution.
es_es: Como mínimo, las actualizaciones requieren que cree una versión de FreeBSD que sea mayor o igual a la versión de la versión de destino para la distribución.

source: A user account with at least 4 GB of available space. This will allow the creation of updates for 7.1 and 7.2, but the exact space requirements may change from version to version.
es_es: Una cuenta de usuario con al menos 4 GB de espacio disponible. Esto permitirá la creación de actualizaciones para las versiones 7.1 y 7.2, los requisitos de espacio exactos pueden cambiar de una versión a otra.

source: An <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> account on a remote machine to upload distributed updates.
es_es: Una cuenta con acceso <citerefentry><refentrytitle>ssh</refentrytitle><manvolnum>1</manvolnum></citerefentry> en una máquina remota para cargar las actualizaciones.

source: A web server, like <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-apache.html">Apache</link>, with over half of the space required for the build. For instance, test builds for 7.1 and 7.2 consume a total amount of 4 GB, and the webserver space needed to distribute these updates is 2.6 GB.
es_es: Un servidor web, como <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-apache.html">Apache</link>, con más de la mitad del espacio necesario para la compilación. Por ejemplo, las compilaciones de prueba para las versiones 7.1 y 7.2 utilizan una cantidad total de 4 GB, y el espacio del servidor web necesario para distribuir estas actualizaciones es de 2.6 GB.

source: Basic knowledge of shell scripting with Bourne shell, <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es_es: Conocimientos básicos de shell scripting con la shell Bournel, <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Configuration: Installation &amp; Setup
es_es: Configuración: Instalación &amp; Configuración

source: Download the <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/"> freebsd-update-server</link> software by installing <package>devel/subversion</package> and <package>security/ca_root_nss</package>, and execute:
es_es: Descargue el software <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/"> freebsd-update-server</link> instalando <package>devel/subversion</package> y <package>security/ca_root_nss</package>, y ejecute:

source: Update <filename>scripts/build.conf</filename> appropriately. It is sourced during all build operations.
es_es: Actualice el fichero <filename>scripts/build.conf</filename> apropiadamente. Se crea durante todas las operaciones de construcción (build).

source: Here is the default <filename>build.conf</filename>, which should be modified to suit your environment.
es_es: Aquí está el archivo <filename>build.conf</filename> predeterminado, que debe ser modificado para adaptarse a su entorno.

source: # Main configuration file for FreeBSD Update builds. The # release-specific configuration data is lower down in # the scripts tree. # Location from which to fetch releases export FTP=ftp://ftp2.freebsd.org/pub/FreeBSD/releases<co xml:id="ftp-id"/> # Host platform export HOSTPLATFORM=`uname -m` # Host name to use inside jails export BUILDHOSTNAME=${HOSTPLATFORM}-builder.daemonology.net<co xml:id="buildhost-id"/> # Location of SSH key export SSHKEY=/root/.ssh/id_dsa<co xml:id="sshkey-id"/> # SSH account into which files are uploaded MASTERACCT=builder@wadham.daemonology.net<co xml:id="mstacct-id"/> # Directory into which files are uploaded MASTERDIR=update-master.freebsd.org<co xml:id="mstdir-id"/>
es_es: # Archivo de configuración principal para las actualizaciones de FreeBSD. # Los datos de configuración específicos de la versión están más abajo # en el árbol de scripts. # Localización de la cual bajar las releases export FTP=ftp://ftp2.freebsd.org/pub/FreeBSD/releases<co xml:id="ftp-id"/> # Plataforma del host export HOSTPLATFORM=`uname -m` # Host name a usar dentro de jails export BUILDHOSTNAME=${HOSTPLATFORM}-builder.daemonology.net<co xml:id="buildhost-id"/> # Localización de la clave SSH export SSHKEY=/root/.ssh/id_dsa<co xml:id="sshkey-id"/> # Cuenta SSH en la cual se suben los archivos MASTERACCT=builder@wadham.daemonology.net<co xml:id="mstacct-id"/> # Directorio en el cual se suben los archivos MASTERDIR=update-master.freebsd.org<co xml:id="mstdir-id"/>

source: Parameters for consideration would be:
es_es: Los parámetros a considerar son:

source: This is the location where ISO images are downloaded from (by the <function>fetchiso()</function> subroutine of <filename>scripts/build.subr</filename>). The location configured is not limited to FTP URIs. Any URI scheme supported by standard <citerefentry><refentrytitle>fetch</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility should work fine.
es_es: Esta es la ubicación desde donde se descargan las imágenes ISO (mediante la subrutina <function>fetchiso()</function> de <filename>scripts/build.subr</filename>). La ubicación configurada no se limita a URIs de FTP. Cualquier esquema URI compatible con la utilidad <citerefentry><refentrytitle>fetch</refentrytitle><manvolnum>1</manvolnum></citerefentry> debería funcionar correctamente.

source: Customizations to the <function>fetchiso()</function> code can be installed by copying the default <filename>build.subr</filename> script to the release and architecture-specific area at <filename>scripts/RELEASE/ARCHITECTURE/build.subr</filename> and applying local changes.
es_es: Las personalizaciones en <function>fetchiso()</function> se pueden instalar copiando el script predeterminado <filename>build.subr</filename> al área de releases y arquitectura específica en el directorio <filename>scripts/RELEASE/ARCHITECTURE/build.subr</filename>y aplicar los cambios locales.

source: The name of the build host. This information will be displayed on updated systems when issuing:
es_es: El nombre del host de compilación. Esta información se mostrará en los sistemas que estén actualizados cuando se ejecute el comando:

source: The <application>SSH</application> key for uploading files to the update server. A key pair can be created by typing <command>ssh-keygen -t dsa</command>. This parameter is optional; standard password authentication will be used as a fallback authentication method when <literal>SSHKEY</literal> is not defined.
es_es: La clave <application>SSH</application> para subir archivos al servidor de actualizaciones. Se puede crear un par de claves ejecutando el comando <command>ssh-keygen -t dsa</command>. Este parámetro es opcional; la autenticación por contraseña estándar se utilizará como método de autenticación de reserva cuando <literal>SSHKEY</literal> no esté definido.

source: The <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page has more detailed information about <application>SSH</application> and the appropriate steps for creating and using one.
es_es: La página del manual de <citerefentry><refentrytitle>ssh-keygen</refentrytitle><manvolnum>1</manvolnum></citerefentry> contiene información más detallada sobre <application>SSH</application> y los pasos apropiados para crear y usar una clave.

source: Account for uploading files to the update server.
es_es: Cuenta para subir archivos al servidor de actualizaciones.

source: Directory on the update server where files are uploaded to.
es_es: Directorio en el servidor de actualización donde se subirán los archivos.

source: The default <filename>build.conf</filename> shipped with the <application>freebsd-update-server</application> sources is suitable for building i386 releases of FreeBSD. As an example of building an update server for other architectures, the following steps outline the configuration changes needed for amd64:
es_es: El archivo <filename>build.conf</filename> predeterminado incluido con el código fuente de <application>freebsd-update-server</application> es adecuado para compilar versiones i386 de FreeBSD. Como ejemplo de creación de un servidor de actualizaciones para otras arquitecturas, los siguientes pasos describen los cambios necesarios en la configuración para amd64:

source: Create a build environment for amd64:
es_es: Cree un entorno de compilación para amd64:

source: Install a <filename>build.conf</filename> in the newly created build directory. The build configuration options for FreeBSD 7.2-RELEASE on amd64 should be similar to:
es_es: Coloque el archivo <filename>build.conf</filename> en el directorio de compilación que acaba de crear. Las opciones de configuración de la compilación para FreeBSD 7.2-RELEASE en la arquitectura amd64 deberían de ser similares a:

source: # SHA256 hash of RELEASE disc1.iso image. export RELH=1ea1f6f652d7c5f5eab7ef9f8edbed50cb664b08ed761850f95f48e86cc71ef5<co xml:id="sha256-id"/> # Components of the world, source, and kernels export WORLDPARTS="base catpages dict doc games info manpages proflibs lib32" export SOURCEPARTS="base bin contrib crypto etc games gnu include krb5 \ lib libexec release rescue sbin secure share sys tools \ ubin usbin cddl" export KERNELPARTS="generic" # EOL date export EOL=1275289200<co xml:id="eol-id"/>
es_es: # SHA256 hash de la imagen RELEASE de disc1.iso. export RELH=1ea1f6f652d7c5f5eab7ef9f8edbed50cb664b08ed761850f95f48e86cc71ef5<co xml:id="sha256-id"/> # Componentes de world, source, y kernels export WORLDPARTS="base catpages dict doc games info manpages proflibs lib32" export SOURCEPARTS="base bin contrib crypto etc games gnu include krb5 \ lib libexec release rescue sbin secure share sys tools \ ubin usbin cddl" export KERNELPARTS="generic" # Fecha EOL export EOL=1275289200<co xml:id="eol-id"/>

source: The <citerefentry><refentrytitle>sha256</refentrytitle><manvolnum>1</manvolnum></citerefentry> hash key for the desired release, is published within the respective <link xlink:href="@@URL_RELPREFIX@@/releases/">release announcement</link>.
es_es: La clave <citerefentry><refentrytitle>sha256</refentrytitle><manvolnum>1</manvolnum></citerefentry> utilizada para hacer el hash de la release deseada, se publica dentro del <link xlink:href="@@URL_RELPREFIX@@/releases/">anuncio de la respectiva release</link>.

source: To generate the "End of Life" number for <filename>build.conf</filename>, refer to the "Estimated EOL" posted on the <link xlink:href="@@URL_RELPREFIX@@/security/security.html">FreeBSD Security Website</link>. The value of <literal>EOL</literal> can be derived from the date listed on the web site, using the <citerefentry><refentrytitle>date</refentrytitle><manvolnum>1</manvolnum></citerefentry> utility, for example:
es_es: Para generar el número "End of Life" para <filename>build.conf</filename>, consulte el "Estimated EOL" publicado en el <link xlink:href="@@URL_RELPREFIX@@/security/security.html">sitio web de seguridad de FreeBSD</link>. El valor de <literal>EOL</literal> se puede obtener de la fecha que figura en el sitio web, utilizando el comando <citerefentry><refentrytitle>date</refentrytitle><manvolnum>1</manvolnum></citerefentry>, por ejemplo:

source: Building Update Code
es_es: Compilando el código de actualización

source: The first step is to run <filename>scripts/make.sh</filename>. This will build some binaries, create directories, and generate an RSA signing key used for approving builds. In this step, a passphrase will have to be supplied for the final creation of the signing key.
es_es: El primer paso es ejecutar <filename>scripts/make.sh</filename>. Esto creará algunos binarios, creará directorios y generará una clave RSA utilizada para aprobar las compilaciones. En este paso, se deberá proporcionar una contraseña para la creación de la clave de firma.

source: Keep a note of the generated key fingerprint. This value is required in <filename>/etc/freebsd-update.conf</filename> for binary updates.
es_es: Guarde una copia de seguridad de la huella digital generada. Este valor es necesario en el archivo <filename>/etc/freebsd-update.conf</filename> para las actualizaciones binarias.

source: At this point, we are ready to stage a build.
es_es: En este punto, estamos listos para empezar el build.

source: What follows is a sample of an <emphasis>initial</emphasis> build run.
es_es: Lo que se muestra a continuación es un ejemplo de la ejecución <emphasis>inicial</emphasis> del build.

source: Then the build of the world is performed again, with world patches. A more detailed explanation may be found in <filename>scripts/build.subr</filename>.
es_es: Entonces, se vuelve a realizar el build de word, con los parches de world. Puede encontrar una explicación más detallada en <filename>scripts/build.subr</filename>.

source: During this second build cycle, the network time protocol daemon, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, is turned off. Per Colin Percival <email>cperciva@FreeBSD.org</email>, Security Officer Emeritus of FreeBSD, "the <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/">freebsd-update-server</link> build code needs to identify timestamps which are stored in files so that they can be ignored when comparing builds to determine which files need to be updated. This timestamp-finding works by doing two builds 400 days apart and comparing the results."
es_es: Durante este segundo ciclo de compilación, el daemon del protocolo de tiempo de red, <citerefentry><refentrytitle>ntpd</refentrytitle><manvolnum>8</manvolnum></citerefentry>, está deshabilitado. De acuerdo con Colin Percival <email>cperciva@FreeBSD.org</email>, oficial de seguridad emérito de FreeBSD, "al compilar el código de <link xlink:href="https://svnweb.freebsd.org/base/user/cperciva/freebsd-update-build/">freebsd-update-server</link> necesita identificar las marcas de tiempo que se almacenan en los archivos para que puedan ignorarse al comparar compilaciones para determinar qué archivos necesitan actualizarse. Esta búsqueda de la marca de tiempo funciona con dos compilaciones, con 400 días de diferencia, y compara los resultados."

source: Finally, the build completes.
es_es: Finalmente, el build termina.

source: Approve the build if everything is correct. More information on determining this can be found in the distributed source file named <filename>USAGE</filename>. Execute <filename>scripts/approve.sh</filename>, as directed. This will sign the release, and move components into a staging area suitable for uploading.
es_es: Aprobar el build si todo es correcto. Puede encontrar más información sobre cómo determinar si es correcto en el archivo <filename>USAGE</filename>. Ejecute <filename>scripts/approve.sh</filename>, como se indica. Esto firmará la release y moverá los componentes a un área de preparación adecuada para la subida.

source: After the approval process is complete, the upload procedure may be started.
es_es: Una vez finalizado el proceso de aprobación, se puede iniciar el proceso de subida.

source: In the event update code needs to be re-uploaded, this may be done by changing to the public distributions directory for the target release and updating attributes of the <emphasis>uploaded</emphasis> file.
es_es: En caso de que se deban volver a subir las actualizaciones, esto se puede hacer cambiando al directorio de distribuciones públicas para la versión de destino y actualizando los atributos del archivo <emphasis>subido</emphasis>.

source: The uploaded files will need to be in the document root of the webserver in order for updates to be distributed. The exact configuration will vary depending on the web server used. For the <application>Apache</application> web server, please refer to the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-apache.html">Configuration of Apache servers</link> section in the Handbook.
es_es: Los archivos subidos deberán estar en el directorio raíz del servidor web para que las actualizaciones se distribuyan. La configuración exacta variará dependiendo del servidor web utilizado. Para el servidor web <application>Apache</application>, consulte la sección de <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/network-apache.html">configuración del servidor Apache</link> en el Handbook.

source: Update client's <literal>KeyPrint</literal> and <literal>ServerName</literal> in <filename>/etc/freebsd-update.conf</filename>, and perform updates as instructed in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html">FreeBSD Update</link> section of the Handbook.
es_es: Actualice los archivos <literal>KeyPrint</literal> y <literal>ServerName</literal> en el archivo <filename>/etc/freebsd-update.conf</filename>, y realice las actualizaciones como se indica en la sección de <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/updating-upgrading-freebsdupdate.html">actualización de FreeBSD</link> en el manual.

source: In order for <application>FreeBSD Update Server</application> to work properly, updates for both the <emphasis>current</emphasis> release and the release <emphasis>one wants to upgrade to</emphasis> need to be built. This is necessary for determining the differences of files between releases. For example, when upgrading a FreeBSD system from 7.1-RELEASE to 7.2-RELEASE, updates will need to be built and uploaded to your distribution server for both versions.
es_es: Para que el <application>servidor de actualizaciones de FreeBSD</application> funcione correctamente, deben compilarse las actualizaciones tanto para la versión <emphasis>actual</emphasis> como para la <emphasis>versión a la que se desea actualizar</emphasis>. Esto es necesario para determinar las diferencias de archivos entre versiones. Por ejemplo, al actualizar un sistema FreeBSD de 7.1-RELEASE a 7.2-RELEASE, las actualizaciones deberán compilarse y subirse a su servidor de distribución para ambas versiones.

source: For reference, the entire run of <link xlink:href="init.txt"><filename>init.sh</filename></link> is attached.
es_es: Como referencia, se adjunta toda la ejecución del script <link xlink:href="init.txt"><filename>init.sh</filename></link>.

source: Building a Patch
es_es: Compilar un parche

source: Every time a <link xlink:href="@@URL_RELPREFIX@@/security/advisories.html">security advisory</link> or <link xlink:href="@@URL_RELPREFIX@@/security/notices.html">security notice</link> is announced, a patch update can be built.
es_es: Cada vez que se publica un <link xlink:href="@@URL_RELPREFIX@@/security/advisories.html">security advisory</link> o un <link xlink:href="@@URL_RELPREFIX@@/security/notices.html">security notice</link>, se puede crear un parche de actualización.

source: For this example, 7.1-RELEASE will be used.
es_es: Para este ejemplo, se utilizará 7.1-RELEASE.

source: A couple of assumptions are made for a different release build:
es_es: Para una versión de lanzamiento diferente, se da por hecho un par de suposiciones:

source: Setup the correct directory structure for the initial build.
es_es: Que ha configurado la estructura de directorios correcta para la compilación inicial.

source: Perform an initial build for 7.1-RELEASE.
es_es: Que ha realizado una compilación inicial para la versión 7.1-RELEASE.

source: Create the patch directory of the respective release under <filename>/usr/local/freebsd-update-server/patches/</filename>.
es_es: Cree el directorio de parches para la versión correspondiente en <filename>/usr/local/freebsd-update-server/patches/</filename>.
