Repository: doc-br/translate
Catalog: articles/*/freebsd-update-server.po
Languages: es_es

source: As an example, take the patch for <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Read the advisory, and grab the necessary file from <link xlink:href="@@URL_RELPREFIX@@/security/advisories.html">FreeBSD Security Advisories</link>. More information on interpreting the advisory, can be found in the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/security-advisories.html">FreeBSD Handbook</link>.
es_es: Como ejemplo, coja el parche para <citerefentry><refentrytitle>named</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Lea el advisory, y obtenga el archivo necesario de <link xlink:href="@@URL_RELPREFIX@@/security/advisories.html">FreeBSD Security Advisories</link>. Puede encontrar más información sobre la interpretación del advisory en el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/security-advisories.html">Handbook de FreeBSD</link>.

source: In the <link xlink:href="https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc">security brief</link>, this advisory is called <literal>SA-09:12.bind</literal>. After downloading the file, it is required to rename the file to an appropriate patch level. It is suggested to keep this consistent with official FreeBSD patch levels, but its name may be freely chosen. For this build, let us follow the currently established practice of FreeBSD and call this <literal>p7</literal>. Rename the file:
es_es: En el <link xlink:href="https://security.freebsd.org/advisories/FreeBSD-SA-09:12.bind.asc">informe de seguridad</link>, este advisory se llama <literal>SA-09:12.bind</literal>. Después de descargar el archivo, es necesario cambiar el nombre del archivo a uno que indique el nivel adecuado del parche. Se sugiere mantener esto en consonancia con los niveles de los parches oficiales de FreeBSD, pero puede elegir libremente el nombre. Para esta compilación, sigamos la práctica establecida actualmente en FreeBSD y llamemosle <literal>p7</literal>. Renombre el archivo ejecutando el siguiente comando:

source: When running a patch level build, it is assumed that previous patches are in place. When a patch build is run, it will run all patches contained in the patch directory.
es_es: Cuando se ejecuta la compilación del parche, se asume que los parches anteriores están en su sitio. Cuando se ejecute la compilación de los parches, se ejecutarán todos los parches que se encuentren en el directorio de parches.

source: There can be custom patches added to any build. Use the number zero, or any other number.
es_es: Puede haber parches personalizados adjuntos a cualquier compilación. Usa el número cero, o cualquier otro número.

source: It is up to the administrator of the <application>FreeBSD Update Server</application> to take appropriate measures to verify the authenticity of every patch.
es_es: Es responsabilidad del administrador del <application>servidor de actualizaciones de FreeBSD</application> tomar las medidas adecuadas para verificar la autenticidad de cada parche.

source: At this point, a <emphasis>diff</emphasis> is ready to be built. The software checks first to see if a <filename>scripts/init.sh</filename> has been run on the respective release prior to running the diff build.
es_es: En este punto, el <emphasis>diff</emphasis> está listo para ser compilado. El software verifica primero si se ha ejecutado un <filename>scripts/init.sh</filename> en la versión correspondiente antes de ejecutar la compilación.

source: What follows is a sample of a <emphasis>differential</emphasis> build run.
es_es: Lo que se muestra a continuación son las <emphasis>diferencias</emphasis> del proceso de construcción.

source: Updates are printed, and approval is requested.
es_es: Se muestran las actualizaciones y se le solicita aprobación.

source: Follow the same process as noted before for approving a build:
es_es: Siga el mismo proceso descrito anteriormente para dar su aprobación a una compilación:

source: After approving the build, upload the software:
es_es: Después de dar su aprobación a la compilación, suba el software al servidor de actualizaciones:

source: For reference, the entire run of <link xlink:href="diff.txt"><filename>diff.sh</filename></link> is attached.
es_es: Como referencia, se adjunta toda la ejecución del comando <link xlink:href="diff.txt"><filename>diff.sh</filename></link>.

source: Tips
es_es: Consejos

source: If a custom release is built using the native <command>make release</command> <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/articles/releng/release-build.html">procedure</link>, <application>freebsd-update-server</application> code will work from your release. As an example, a release without ports or documentation can be built by clearing functionality pertaining to documentation subroutines <function> findextradocs ()</function>, <function>addextradocs ()</function> and altering the download location in <function>fetchiso ()</function>, respectively, in <filename>scripts/build.subr</filename>. As a last step, change the <citerefentry><refentrytitle>sha256</refentrytitle><manvolnum>1</manvolnum></citerefentry> hash in <filename>build.conf</filename> under your respective release and architecture and you are ready to build off your custom release.
es_es: Si se crea una versión personalizada utilizando el <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/articles/releng/release-build.html">procedimiento</link> <command>make release</command> nativo, <application>freebsd-update-server</application> funcionará desde su versión. Como ejemplo, se puede crear una versión sin ports o documentación, borrando la funcionalidad correspondiente a las subrutinas <function> findextradocs ()</function>, <function>addextradocs ()</function> y cambiando la ubicación de descarga de <function>fetchiso ()</function>, respectivamente, en <filename>scripts/build.subr</filename>. Como último paso, cambie el hash <citerefentry><refentrytitle>sha256</refentrytitle><manvolnum>1</manvolnum></citerefentry> en el archivo <filename>build.conf</filename> con su respectiva versión y arquitectura, y estará listo para crear su versión personalizada.

source: # Compare ${WORKDIR}/release and ${WORKDIR}/$1, identify which parts # of the world|doc subcomponent are missing from the latter, and # build a tarball out of them. findextradocs () { } # Add extra docs to ${WORKDIR}/$1 addextradocs () { }
es_es: # Compare ${WORKDIR}/release y ${WORKDIR}/$1, identifique qué partes # del subcomponente world|doc faltan en este último, y # construya el tarball con ellas. findextradocs () { } # Añadir documentos extra a ${WORKDIR}/$1 addextradocs () { }

source: Adding <option>-j <replaceable>NUMBER</replaceable></option> flags to <_:buildtarget-1/> and <_:buildtarget-2/> targets in the <filename>scripts/build.subr</filename> script may speed up processing depending on the hardware used, however it is not necessary. Using these flags in other targets is not recommended, as it may cause the build to become unreliable.
es_es: Añadir el flag <option>-j <replaceable>NÚMERO</replaceable></option> a las secciones <_:buildtarget-1/> y <_:buildtarget-2/> en el script <filename>scripts/build.subr</filename> puede acelerar la compilación, dependiendo del hardware utilizado, sin embargo, no es necesario. Se desaconseja el uso de este flag en otras secciones, ya que puede hacer que la compilación no sea fiable.

source: # Build the world log "Building world" cd /usr/src &amp;&amp; make -j 2 ${COMPATFLAGS} buildworld 2&gt;&amp;1 # Distribute the world log "Distributing world" cd /usr/src/release &amp;&amp; make -j 2 obj &amp;&amp; make ${COMPATFLAGS} release.1 release.2 2&gt;&amp;1
es_es: # Compilando world log "Compilando world" cd /usr/src &amp;&amp; make -j 2 ${COMPATFLAGS} buildworld 2&gt;&amp;1 # Distribuyendo world log "Distribuyendo world" cd /usr/src/release &amp;&amp; make -j 2 obj &amp;&amp; make ${COMPATFLAGS} release.1 release.2 2&gt;&amp;1

source: Create an appropriate <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/network-dns.html">DNS</link> SRV record for the update server, and put others behind it with variable weights. Using this facility will provide update mirrors, however this tip is not necessary unless you wish to provide a redundant service.
es_es: Cree un registro <link xlink:href="@@URL_RELPREFIX@@/doc/es_ES.ISO8859-1/books/handbook/network-dns.html">DNS</link> SRV para el servidor de actualizaciones y coloque el resto de registros detrás, con diferentes niveles de importancia. El uso de esta función proporcionará réplicas de actualización, sin embargo, este consejo no es necesario a menos que desee proporcionar un servicio redundante.
