Repository: doc-br/translate
Catalog: articles/*/ipsec-must.po
Languages: fa, nb_no

# _
source: translator-credits
fa: جواد کوهی <javad@kouhi.org>، سال ۲۰۲۰
nb_no: Lars Skogstad - n3c@n3c.no

source: Independent Verification of IPsec Functionality in FreeBSD
fa: تصدیق عملکرد IPsec به طور مستقل در FreeBSD
nb_no: Uavhengig verifisering av IPsec-funksjonalitet i FreeBSD

source: <personname><firstname>David</firstname><surname>Honig</surname></personname><affiliation> <_:address-1/> </affiliation>
fa: <personname><firstname>دیوید</firstname><surname>هانیگ</surname></personname><affiliation> <_:address-1/> </affiliation>

source: FreeBSD is a registered trademark of the FreeBSD Foundation.
fa: FreeBSD یک نشان تجاری ثبت شده متعلق به FreeBSD Foundation است.
nb_no: FreeBSD er et registrert varemerke tilhørende FreeBSD Foundation.

source: Motif, OSF/1, and UNIX are registered trademarks and IT DialTone and The Open Group are trademarks of The Open Group in the United States and other countries.
fa: Motif، OSF/1 و UNIX نشان‌های تجاری ثبت شده و IT DialTone و The Open Group نشان‌های تجاری متعلق به کنسرسیوم The Open Group در ایالات متحده و دیگر کشورها هستند.
nb_no: Motif,OSF/1 og UNIX er registrerte varemerker og IT DialTone og The Open Group varemerke av The Open Group i USA eller andre land.

source: Many of the designations used by manufacturers and sellers to distinguish their products are claimed as trademarks. Where those designations appear in this document, and the FreeBSD Project was aware of the trademark claim, the designations have been followed by the <quote>™</quote> or the <quote>®</quote> symbol.
fa: بسیاری از عناوین مورد استفاده توسط تولیدکنندگان و فروشندگان برای مشخص کردن محصولاتشان به عنوان نشان‌های تجاری اظهار شده‌اند. در هر جای این سند که این عناوین ذکر شده باشند، در صورتی که پروژه FreeBSD از اظهارنامه آن نشان تجاری آگاه باشد، همراه عنوان علامت <quote>™</quote> یا <quote>®</quote> آمده است.
nb_no: Mange av betegnelsene som brukes av produsenter og selgere for å skille produktene deres, hevdes som varemerker. Der de betegnelsene vises i dette dokumentet, og FreeBSD-prosjektet var klar over varemerkekravet, har betegnelsene blitt fulgt av <quote>™</quote> eller <quote>®</quote> symbolet.

source: You installed IPsec and it seems to be working. How do you know? I describe a method for experimentally verifying that IPsec is working.
fa: IPsec را نصب کرده‌اید و به نظر می‌رسد که کار هم می‌کند. ولی از کجا می‌دانید؟ من روشی را در اینجا تشریح می‌کنم که با آن می‌توانید به طور آزمون‌گرانه تصدیق کنید که IPsec به درستی کار می‌کند.
nb_no: Du har installert IPsec og det ser ut til å fungere. Hvordan vet du at det fungerer som det skal? Jeg skal beskrive en eksperimentell metode som bekrefter at IPsec fungerer.

source: The Problem
fa: تعریف مشکل
nb_no: Problemet

source: First, lets assume you have <link linkend="ipsec-install"> installed <emphasis>IPsec</emphasis></link>. How do you know it is <link linkend="caveat">working</link>? Sure, your connection will not work if it is misconfigured, and it will work when you finally get it right. <citerefentry><refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> will list it. But can you independently confirm it?
fa: ابتدا، بیایید فرض کنیم که شما <link linkend="ipsec-install"><emphasis>IPsec</emphasis> را نصب کرده‌اید</link>. از کجا می‌دانید که به درستی <link linkend="caveat">کار می‌کند</link>؟ بله، درست است، اگر به درستی پیکربندی نشده بود اتصال شما کار نمی‌کرد، فقط وقتی آن را درست پیکربندی کرده باشید کار خواهد کرد. <citerefentry><refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> آن را فهرست خواهد کرد. ولی آیا به طور مستقل هم می‌توانید آن را تصدیق کنید؟
nb_no: Først, la oss anta at du har <link linkend="ipsec-install"> installert <emphasis>IPsec</emphasis></link>. Hvordan vet du at det <link linkend="caveat">fungerer</link>? Jada, forbindelsen din vil ikke fungere hvis den er feilkonfigurert, og den vil fungere når du endelig får det riktig. <citerefentry><refentrytitle>netstat</refentrytitle><manvolnum>1</manvolnum></citerefentry> vill liste det. Men kan du uavhengig bekrefte det?

source: The Solution
fa: راه حل
nb_no: Løsningen

source: First, some crypto-relevant info theory:
fa: ابتدا، کمی اطلاعات تئوری در رابطه با رمزنگاری:
nb_no: Først, noe krypto-relevant teori:

source: Encrypted data is uniformly distributed, i.e., has maximal entropy per symbol;
fa: داده‌های رمزنگاری‌شده به طور یکنواخت توزیع می‌شوند. به عبارت دیگر، به ازای هر نماد، آنتروپی بیشینه دارند؛
nb_no: Krypterte data er ensartet distribuert, dvs. har maksimal entropi per symbol;

source: Raw, uncompressed data is typically redundant, i.e., has sub-maximal entropy.
fa: داده‌های خام و فشرده‌ نشده عموما افزونگی دارند. به عبارت دیگر، آنتروپی فرو-بیشینه دارند.
nb_no: Rå, ukomprimerte data er typisk overflødige, dvs. har sub-maksimal entropi.

source: Suppose you could measure the entropy of the data to- and from- your network interface. Then you could see the difference between unencrypted data and encrypted data. This would be true even if some of the data in <quote>encrypted mode</quote> was not encrypted---as the outermost IP header must be if the packet is to be routable.
fa: فرض کنید که می‌توانستید آنتروپی داده‌های ارسالی به کارت شبکه و دریافتی از آن را اندازه‌گیری کنید. آنگاه می‌توانستید تفاوت بین داده‌های رمزنگاری‌شده و رمزنگاری‌نشده را ببینید. این گفته حتی وقتی که مقداری از داده‌ها در <quote>حالت رمزنگاری</quote> عملا رمزنگاری‌نشده باشند هم درست است. مثلا اگر قرار باشد بسته قابل مسیریابی باشد، آنگاه بیرونی‌ترین سرایند IP نباید رمزنگاری‌شده باشد.
nb_no: Anta at du kan måle entropien til dataene til og fra nettverksgrensesnittet ditt. Da kunne du se forskjellen mellom ikke-krypterte data og krypterte data. Dette vil være sant, selv om noen av dataene i <quote> kryptert modus </quote> ikke var kryptert --- som den ytterste IP-overskriften må være hvis pakken skal være rutbar.

source: Ueli Maurer's <quote>Universal Statistical Test for Random Bit Generators</quote>(<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"> <acronym>MUST</acronym></link>) quickly measures the entropy of a sample. It uses a compression-like algorithm. <link linkend="code">The code is given below</link> for a variant which measures successive (~quarter megabyte) chunks of a file.
fa: ابزار <quote>Universal Statistical Test for Random Bit Generators</quote>(<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"> <acronym>MUST</acronym></link>) یولی مائورر می‌تواند آنتروپی یک نمونه را به سرعت اندازه‌گیری کند. این ابزار از یک الگوریتم شبه-فشرده‌سازی استفاده می‌کند. کد گونه‌ای از این ابزار که قادر است به طور پیاپی (تقریبا یک چارک مگابایت) قطعات یک پرونده را اندازه‌گیری کند، <link linkend="code"> در زیر آورده شده است</link>.
nb_no: Ueli Maurers <quote> Universal Statistical Test for Random Bit Generators </quote>(<link xlink:href="https://web.archive.org/web/20011115002319/http://www.geocities.com/SiliconValley/Code/4704/universal.pdf"> <acronym>MUST</acronym></link>) måler raskt entropien til en prøve. Den bruker en kompresjonslignende algoritme. <link linkend="code"> Koden er gitt nedenfor </link> for en variant som måler suksessive (~ kvart megabyte) biter av en fil.

source: We also need a way to capture the raw network data. A program called <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry> lets you do this, if you have enabled the <emphasis>Berkeley Packet Filter</emphasis> interface in your <link linkend="kernel">kernel's config file</link>.
fa: ما همچنین به روشی نیاز داریم تا بتوانیم داده‌های خام شبکه را ضبط کنیم. برنامه‌ای به نام <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry> اجازه انجام چنین کاری را به ما می‌دهد. برای استفاده از آن نیاز است تا در <link linkend="kernel">پرونده پیکربندی هسته</link> <emphasis>Berkeley Packet Filter</emphasis> را فعال کرده باشید.
nb_no: We trenger også en metode for å fange rådata fra nettverket. Et program med navn <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry>lar deg gjøre dette, hvis du har aktivert <emphasis>Berkeley Packet Filter</emphasis> brukergrensesnittet i din <link linkend="kernel">kernel's konfigurasjons fil</link>.

source: The command:
fa: دستور:
nb_no: Kommandoen:

source: will capture 4000 raw packets to <replaceable>dumpfile.bin</replaceable>. Up to 10,000 bytes per packet will be captured in this example.
fa: ۴۰۰۰ بسته خام را ضبط کرده و در <replaceable>dumpfile.bin</replaceable> ذخیره می‌کند. در این مثال، تا ۱۰٬۰۰۰ بایت در هر بسته ضبط خواهد شد.
nb_no: Vil fange 4000 rå pakker til <replaceable>dumpfile.bin</replaceable>. Opp til 10,000 bytes pr pakke vil bli fanget i dette eksempelet.

source: The Experiment
fa: آزمایش
nb_no: Eksperimentet

source: Here is the experiment:
fa: آزمایش از این قرار است:
nb_no: Her er eksperimentet:

source: Open a window to an IPsec host and another window to an insecure host.
fa: یک پنجره به یک میزبانِ IPsec و پنجره‌ای دیگر به یک میزبان ناامن باز کنید.
nb_no: Åpne et vindu til en IPsec vert og et annet vindu til en usikker vert.

source: Now start <link linkend="tcpdump">capturing packets</link>.
fa: حالا شروع به <link linkend="tcpdump">ضبط بسته‌ها</link> نمایید.
nb_no: Start så <link linkend="tcpdump">fange pakker</link>.

source: In the <quote>secure</quote> window, run the <trademark class="registered">UNIX</trademark> command <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry>, which will stream the <literal>y</literal> character. After a while, stop this. Switch to the insecure window, and repeat. After a while, stop.
fa: حال در پنجره <quote>امن</quote>، دستور <trademark class="registered">یونیکسی</trademark> <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry> را اجرا کنید، که باعث خواهد شد کاراکتر <literal>y</literal> مثل یک جویبار روان شود. پس از مدتی، این دستور را متوقف کنید. به پنجره ناامن بروید و همین کار را تکرار کنید. پس از مدتی، آن را هم متوقف کنید.
nb_no: I det <quote>sikre</quote> vinduet, kjør <trademark class="registered">UNIX</trademark> command <citerefentry><refentrytitle>yes</refentrytitle><manvolnum>1</manvolnum></citerefentry>, som vil streame <literal>y</literal> tegnet. Stopp dette etter en stund. Bytt til det usikre vinduet, og gjenta. Etter en stund, stopp.

source: Now run <link linkend="code">MUST</link> on the captured packets. You should see something like the following. The important thing to note is that the secure connection has 93% (6.7) of the expected value (7.18), and the <quote>normal</quote> connection has 29% (2.1) of the expected value.
fa: حال <link linkend="code">MUST</link> را روی بسته‌های ضبط شده اجرا کنید. باید چیزی شبیه خروجی زیر را ببینید. نکته مهم این است که اتصال امن ۹۳٪ (۶.۷) از مقدار مورد انتظار (۷.۱۸) را دارد، و اتصال <quote>عادی</quote> تنها ۲۹٪ (۲.۱) از مقدار مورد انتظار را دارد.
nb_no: Kjør nå <link linkend="code">MUST</link> på de fangede pakker. Du bør se noe som det følgende. Det viktige å merke seg er at den sikre tilkoblingen har 93% (6,7) av den forventede verdien (7.18), og <quote>normal</quote> tilkoblingen har 29% (2.1) av den forventede verdien.

source: Caveat
fa: هشدار
nb_no: Forbeholdet

source: This experiment shows that IPsec <emphasis>does</emphasis> seem to be distributing the payload data <emphasis>uniformly</emphasis>, as encryption should. However, the experiment described here <emphasis>cannot</emphasis> detect many possible flaws in a system (none of which do I have any evidence for). These include poor key generation or exchange, data or keys being visible to others, use of weak algorithms, kernel subversion, etc. Study the source; know the code.
fa: این آزمایش نشان می‌دهد که IPsec ظاهرا دارد داده‌ها را <emphasis>به طور یکنواخت</emphasis> <emphasis>توزیع می‌کند</emphasis>، همانطور که از یک رمزنگاری انتظار می‌رود. با این حال، آزمایشی که در اینجا شرح آن رفت <emphasis>نمی‌تواند</emphasis> هیچگونه نقص احتمالی را در سامانه تشخیص دهد (که برای هیچکدام از آنها هیچ نشانه‌ای ندارم). این نقص‌ها می‌توانند چیزهایی مثل تولید کلید ضعیف یا تبادل نادرست کلیدها، در معرض نمایش بودن کلیدها یا داده‌ها برای بقیه، استفاده از الگوریتم ضعیف، تخریب هسته از درون و غیره باشند. کدمنبع را بخوانید و با آن آشنا شوید.
nb_no: Dette eksperimentet viser at IPsec <emphasis>does</emphasis> ser ut til å distribuere nyttelastdataene <emphasis>uniformert</emphasis>, som kryptering burde. Imidlertid <emphasis>kan ikke</emphasis> eksperimentet som er beskrevet her, oppdage mange mulige feil i et system (hvorav ingen har jeg bevis for). Disse inkluderer dårlig nøkkelgenerering eller utveksling, data eller nøkler er synlige for andre, bruk av svake algoritmer, kjerneundersøkelse, etc. Studer kilden; kjenner koden.

source: IPsec---Definition
fa: IPsec---تعریف
nb_no: IPsec---Definisjon

source: Internet Protocol security extensions to IPv4; required for IPv6. A protocol for negotiating encryption and authentication at the IP (host-to-host) level. SSL secures only one application socket; <application>SSH</application> secures only a login; <application>PGP</application> secures only a specified file or message. IPsec encrypts everything between two hosts.
fa: افزونه‌های امنیتی قرارداد اینترنت برای IPv4؛ که در IPv6 الزامی است، قراردادی است برای مذاکره کردن روش‌های رمزنگاری و احراز هویت در لایه IP (میزبان به میزبان). SSL تنها یک سوکت را ایمن می‌کند؛ <application>SSH</application> تنها یک ورود را ایمن می‌کند؛ <application>PGP</application> تنها یک پرونده یا پیغام را ایمن می‌کند. ولی IPsec همه چیز را بین دو میزبان ایمن می‌کند.
nb_no: Internet Protocol sikkerhetsutvidelser til IPv4; påkrevd for IPv6. En protokoll for forhandling av kryptering og autentisering på IP-nivå (vert-til-vert) -nivå. SSL sikrer bare én applikasjonsuttak; <application>SSH</application> sikrer bare innlogging; <application>PGP</application> sikrer bare en spesifisert fil eller melding. IPsec krypterer alt mellom to verter.

source: Installing IPsec
fa: نصب IPsec
nb_no: Installere IPsec

source: Most of the modern versions of FreeBSD have IPsec support in their base source. So you will need to include the <option>IPSEC</option> option in your kernel config and, after kernel rebuild and reinstall, configure IPsec connections using <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry> command.
fa: بیشتر نسخه‌های مدرن FreeBSD از IPsec در کدمنبع‌شان پشتیبانی می‌کنند. تنها نیاز است که شما گزینه <option>IPSEC</option> را در فایل پیکربندی هسته بگنجانید و پس از آنکه هسته را کامپایل و نصب کردید، با استفاده از دستور <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry> اتصالات IPsec را پیکربندی کنید.
nb_no: De fleste av de moderne versjonene av FreeBSD har IPsec-støtte i basekilden. Så du må inkludere alternativet <option>IPSEC</option> i kjernekonfigurasjonen din, og etter at kernen er gjenoppbygd og installert på nytt, konfigurerer du IPsec-tilkoblinger ved å bruke <citerefentry><refentrytitle>setkey</refentrytitle><manvolnum>8</manvolnum></citerefentry> kommandoen.

source: A comprehensive guide on running IPsec on FreeBSD is provided in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ipsec.html">FreeBSD Handbook</link>.
fa: یک راهنمای جامع درباره راه‌اندازی IPsec در FreeBSD در <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ipsec.html">کتاب راهنمای FreeBSD</link> آورده شده است.
nb_no: En omfattende guide for å kjøre IPsec på FreeBSD finnes i <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/ipsec.html">FreeBSD Handbook</link>.

source: This needs to be present in the kernel config file in order to capture network data with <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Be sure to run <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> after adding this, and rebuild and reinstall.
fa: نیاز است تا آن را در فایل پیکربندی هسته گنجانده باشید تا بتوان داده‌های شبکه را با <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry> ضبط کرد. مطمئن شوید که پس از اضافه کردن آن <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> را اجرا خواهید کرد، سپس هسته را مجددا کامپایل و نصب نمایید.
nb_no: Dette må være til stede i kjernekonfigurasjonsfilen for å fange nettverksdata med <citerefentry><refentrytitle>tcpdump</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Sørg for å kjøre <citerefentry><refentrytitle>config</refentrytitle><manvolnum>8</manvolnum></citerefentry> etter å ha lagt til dette, og gjenoppbygg og installer på nytt.

source: Maurer's Universal Statistical Test (for block size=8 bits)
fa: Maurer's Universal Statistical Test (برای بلاک‌هایی با اندازه ۸ بیتی)

source: You can find the same code at <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt"> this link</link>.
fa: همین کد را می‌توانید در <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt"> این نشانی</link> هم پیدا کنید.
nb_no: Du kan finne den samme koden her <link xlink:href="https://web.archive.org/web/20031204230654/http://www.geocities.com:80/SiliconValley/Code/4704/uliscanc.txt"> this link</link>.

source: MUST
nb_no: MÅ
