Repository: doc-br/translate
Catalog: articles/*/ldap-auth.po
Languages: es_es

source: It is a good idea, then, to store passwords in a more secure format, such as SSHA (salted SHA). This is done by whatever program you use to change users' passwords.
es_es: Por lo tanto, es buena idea almacenar las contraseñas en un formato más seguro, como SSHA (salted SHA). Esto lo hace cualquier programa que use para cambiar las contraseñas de los usuarios.

source: Useful Aids
es_es: Consideraciones útiles

source: There are a few other programs that might be useful, particularly if you have many users and do not want to configure everything manually.
es_es: Hay otros programas que pueden ser útiles, especialmente si tiene muchos usuarios y no desea configurarlo todo manualmente.

source: <package>security/pam_mkhomedir</package> is a PAM module that always succeeds; its purpose is to create home directories for users which do not have them. If you have dozens of client servers and hundreds of users, it is much easier to use this and set up skeleton directories than to prepare every home directory.
es_es: <package>security/pam_mkhomedir</package> es un módulo de PAM que siempre funciona; su propósito es crear directorios home para los usuarios que no los tienen. Si tiene docenas de servidores cliente y cientos de usuarios, es mucho más facil usarlo y configurar un directorio mínimo para cada directorio home.

source: <package>sysutils/cpu</package> is a <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>-like utility that can be used to manage users in the LDAP directory. You can call it directly, or wrap scripts around it. It can handle both TLS (with the <option>-x</option> flag) and SSL (directly).
es_es: <package>sysutils/cpu</package> es una utilidad similar a <citerefentry><refentrytitle>pw</refentrytitle><manvolnum>8</manvolnum></citerefentry>, que se puede utilizar para administrar usuarios en el directorio LDAP. Puede llamarlo directamente o ajustar los scripts para que lo utilicen. Puede manejar tanto TLS (con el flag <option>-x</option>) como SSL (directamente).

source: <package>sysutils/ldapvi</package> is a great utility for editing LDAP values in an LDIF-like syntax. The directory (or subsection of the directory) is presented in the editor chosen by the <envar>EDITOR</envar> environment variable. This makes it easy to enable large-scale changes in the directory without having to write a custom tool.
es_es: <package>sysutils/ldapvi</package> es una utilidad de gran ayuda para editar valores LDAP en una sintaxis similar a LDIF. El directorio (o subsección del directorio) se presenta en el editor elegido por la variable de entorno <envar>EDITOR</envar>. Esto facilita la realización de cambios de directorio a gran escala sin escribir una herramienta personalizada.

source: <package>security/openssh-portable</package> has the ability to contact an LDAP server to verify <application>SSH</application> keys. This is extremely nice if you have many servers and do not want to copy your public keys across all of them.
es_es: <package>security/openssh-portable</package> tiene la capacidad de contactar a un servidor LDAP para verificar las claves <application>SSH</application>. Esto es extremadamente útil si tiene muchos servidores y no desea copiar sus claves públicas en todos.

source: <application>OpenSSL</application> Certificates for LDAP
es_es: Certificados <application>OpenSSL</application> para LDAP

source: If you are hosting two or more LDAP servers, you will probably not want to use self-signed certificates, since each client will have to be configured to work with each certificate. While this is possible, it is not nearly as simple as creating your own certificate authority, and signing your servers' certificates with that.
es_es: Si aloja dos o más servidores LDAP, probablemente no quiera utilizar certificados autofirmados, ya que cada cliente deberá estar configurado para funcionar con cada certificado. Si bien esto es posible, no es tan simple como crear su propia autoridad de certificación y firmar los certificados de sus servidores con ella.

source: The steps here are presented as they are with very little attempt at explaining what is going on—further explanation can be found in <citerefentry><refentrytitle>openssl</refentrytitle><manvolnum>1</manvolnum></citerefentry> and its friends.
es_es: Las instrucciones aquí se presentan tal como son, con muy pocas intenciones de explicar lo que está sucediendo—puede encontrar más explicaciones en <citerefentry><refentrytitle>openssl</refentrytitle><manvolnum>1</manvolnum></citerefentry> y aplicaciones similares.

source: To create a certificate authority, we simply need a self-signed certificate and key. The steps for this again are
es_es: Para crear una autoridad de certificación, simplemente necesitamos un certificado autofirmado y una clave. De nuevo, las instrucciones son

source: Creating a Certificate
es_es: Crear un certificado

source: These will be your root CA key and certificate. You will probably want to encrypt the key and store it in a cool, dry place; anyone with access to it can masquerade as one of your LDAP servers.
es_es: Estos serán su clave CA y certificado root. Probablemente desee cifrar la clave y almacenarla en un lugar freso y seco; cualquier persona con acceso a ella puede hacerse pasar por uno de sus servidores LDAP.

source: Next, using the first two steps above create a key <filename>ldap-server-one.key</filename> and certificate signing request <filename>ldap-server-one.csr</filename>. Once you sign the signing request with <filename>root.key</filename>, you will be able to use <filename>ldap-server-one.*</filename> on your LDAP servers.
es_es: A continuación, utilizando los dos pasos anteriores, cree la clave <filename>ldap-server-one.key</filename> y la solicitud de firma de certificado <filename>ldap-server-one.csr</filename>. Una vez que firme la solicitud con la clave <filename>root.key</filename>, podrá usar <filename>ldap-server-one.*</filename> en sus servidores LDAP.

source: Do not forget to use the fully qualified domain name for the <quote>common name</quote> attribute when generating the certificate signing request; otherwise clients will reject a connection with you, and it can be very tricky to diagnose.
es_es: No olvide utilizar un fully qualified domain name (nombre de dominio altamente cualificado) para el atributo <quote>common name</quote> al generar la solicitud de firma del certificado; de lo contrario, los clientes rechazarán la conexión y puede que ser muy difícil de diagnosticar.

source: To sign the key, use <option>-CA</option> and <option>-CAkey</option> instead of <option>-signkey</option>:
es_es: Para firmar la clave, utilice <option>-CA</option> y <option>-CAkey</option> en lugar de <option>-signkey</option>:

source: Signing as a Certificate Authority
es_es: Firmar como autoridad de certificación

source: The resulting file will be the certificate that you can use on your LDAP servers.
es_es: El archivo resultante será el certificado que pueda utilizar en sus servidores LDAP.

source: Finally, for clients to trust all your servers, distribute <filename>root.crt</filename> (the <emphasis>certificate</emphasis>, not the key!) to each client, and specify it in the <literal>TLSCACertificateFile</literal> directive in <filename>ldap.conf</filename>.
es_es: Finalmente, para que los clientes confíen en todos sus servidores, distribuya el archivo <filename>root.crt</filename> (¡el <emphasis>certificado</emphasis>, no la clave!) a cada cliente y especifíquelo en la directiva <literal>TLSCACertificateFile</literal> en el archivo <filename>ldap.conf</filename>.
