Repository: doc-br/translate
Catalog: articles/*/ldap-auth.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: LDAP Authentication
es_es: Autenticación LDAP

source: $FreeBSD: head/en_US.ISO8859-1/articles/ldap-auth/article.xml 47080 2015-07-25 16:21:53Z bcr $
es_es: $FreeBSD$

source: This document is intended as a guide for the configuration of an LDAP server (principally an <application>OpenLDAP</application> server) for authentication on FreeBSD. This is useful for situations where many servers need the same user accounts, for example as a replacement for <application>NIS</application>.
es_es: Este documento pretende ser una guía para la configuración de un servidor LDAP (principalmente un servidor <application>OpenLDAP</application>) para la autenticación en FreeBSD. Esto es útil para situaciones en las que muchos servidores necesitan las mismas cuentas de usuario, por ejemplo, como reemplazo de <application>NIS</application>.

source: Preface
es_es: Prólogo

source: This document is intended to give the reader enough of an understanding of LDAP to configure an LDAP server. This document will attempt to provide an explanation of <package>net/nss_ldap</package> and <package>security/pam_ldap</package> for use with client machines services for use with the LDAP server.
es_es: Este documento está destinado a proporcionar al lector una comprensión suficiente de LDAP para configurar un servidor LDAP. Este documento intentará proporcionar una explicación de <package>net/nss_ldap</package> y <package>security/pam_ldap</package> para usarlos con los servicios de la máquina del cliente para su uso con el servidor LDAP.

source: When finished, the reader should be able to configure and deploy a FreeBSD server that can host an LDAP directory, and to configure and deploy a FreeBSD server which can authenticate against an LDAP directory.
es_es: Cuando termine, el lector debería poder configurar e implementar un servidor FreeBSD que pueda alojar un directorio LDAP, y configurar e implementar un servidor FreeBSD que pueda autenticarse en un directorio LDAP.

source: This article is not intended to be an exhaustive account of the security, robustness, or best practice considerations for configuring LDAP or the other services discussed herein. While the author takes care to do everything correctly, they do not address security issues beyond a general scope. This article should be considered to lay the theoretical groundwork only, and any actual implementation should be accompanied by careful requirement analysis.
es_es: Este artículo no pretende ser una explicación exhaustiva de las consideraciones de seguridad, robustez o mejores prácticas para configurar LDAP u otros de los servicios que se explicaran aquí. Aunque el autor tiene cuidado de hacer todo correctamente, no aborda los problemas de seguridad más allá del alcance general. Este artículo debe tenerse en cuenta para sentar las bases teóricas únicamente, y cualquier implementación real debe ir acompañado de un análisis cuidadoso de los requisitos.

source: Configuring LDAP
es_es: Configurando LDAP

source: LDAP stands for <quote>Lightweight Directory Access Protocol</quote> and is a subset of the X.500 Directory Access Protocol. Its most recent specifications are in <link xlink:href="http://www.ietf.org/rfc/rfc4510.txt">RFC4510</link> and friends. Essentially it is a database that expects to be read from more often than it is written to.
es_es: LDAP significa <quote>Lightweight Directory Access Protocol (Protocolo Ligero/Simplificado de Acceso a Directorios)</quote> y es un subconjunto del protocolo de acceso a directorios X.500. Sus últimas especificaciones están en <link xlink:href="http://www.ietf.org/rfc/rfc4510.txt">RFC4510</link> y amigos. En esencia, es una base de datos que espera ser leída con más frecuencia de la que se escribe.

source: The LDAP server <link xlink:href="http://www.openldap.org/">OpenLDAP</link> will be used in the examples in this document; while the principles here should be generally applicable to many different servers, most of the concrete administration is <application>OpenLDAP</application>-specific. There are several server versions in ports, for example <package>net/openldap24-server</package>. Client servers will need the corresponding <package>net/openldap24-client</package> libraries.
es_es: En los ejemplos de este documento se utilizará el servidor LDAP <link xlink:href="http://www.openldap.org/">OpenLDAP</link>; aunque los procedimientos deberían ser aplicables a los diferentes servidores, la mayor parte de la administración es específica de <application>OpenLDAP</application>. Hay varias versiones del servidor en la colección de ports, por ejemplo, <package>net/openldap24-server</package>. Los clientes necesitarán las librerias necesarias del paquete <package>net/openldap24-client</package>.

source: There are (basically) two areas of the LDAP service which need configuration. The first is setting up a server to receive connections properly, and the second is adding entries to the server's directory so that FreeBSD tools know how to interact with it.
es_es: Hay (básicamente) dos áreas del servicio LDAP que necesitan configuración. El primero es configurar un servidor para recibir conexiones correctamente, y el segundo es añadir entradas al directorio del servidor para que las herramientas de FreeBSD sepan como interactuar con él.

source: Setting Up the Server for Connections
es_es: Configurar el servidor para las conexiones

source: This section is specific to <application>OpenLDAP</application>. If you are using another server, you will need to consult that server's documentation.
es_es: Esta sección es específica de <application>OpenLDAP</application>. Si está utilizando otro servidor, deberá consultar la documentación de ese servidor.

source: Installing <application>OpenLDAP</application>
es_es: Instalar <application>OpenLDAP</application>

source: First, install <application>OpenLDAP</application>:
es_es: Primero, instale <application>OpenLDAP</application>:

source: This installs the <command>slapd</command> and <command>slurpd</command> binaries, along with the required <application>OpenLDAP</application> libraries.
es_es: Esto instala los binarios <command>slapd</command> y <command>slurpd</command>, junto con las librerias requeridas por <application>OpenLDAP</application>.

source: Configuring <application>OpenLDAP</application>
es_es: Configurar <application>OpenLDAP</application>

source: Next we must configure <application>OpenLDAP</application>.
es_es: A continuación, debemos configurar <application>OpenLDAP</application>.

source: You will want to require encryption in your connections to the LDAP server; otherwise your users' passwords will be transferred in plain text, which is considered insecure. The tools we will be using support two very similar kinds of encryption, SSL and TLS.
es_es: Es necesario que haga obligatorio el uso de cifrado en sus conexiones al servidor LDAP; de lo contrario, las contraseñas de sus usuarios se transferirán en texto plano, lo que se considera inseguro. Las herramientas que utilizaremos admiten dos tipos muy similares de encriptación, SSL y TLS.

source: TLS stands for <quote>Transportation Layer Security</quote>. Services that employ TLS tend to connect on the <emphasis>same</emphasis> ports as the same services without TLS; thus an SMTP server which supports TLS will listen for connections on port 25, and an LDAP server will listen on 389.
es_es: TLS significa <quote>Transportation Layer Security (seguridad de la capa de transporte)</quote>. Los servicios que emplean TLS tienden a conectarse en los <emphasis>mismos</emphasis> puertos que los mismos servicios sin TLS; por lo tanto, un servidor SMTP que admita TLS escuchará las conexiones en el puerto 25 y un servidor LDAP escuchará en el puerto 389.

source: SSL stands for <quote>Secure Sockets Layer</quote>, and services that implement SSL do <emphasis>not</emphasis> listen on the same ports as their non-SSL counterparts. Thus SMTPS listens on port 465 (not 25), HTTPS listens on 443, and LDAPS on 636.
es_es: SSL significa <quote>Secure Sockets Layer (capa de puertos seguros)</quote>, y los servicios que implementan SSL <emphasis>no</emphasis> escuchan en los mismos puertos que sus equivalentes que no son SSL. Por lo tanto, SMTPS escucha en el puerto 465 (y no 25), HTTPS escucha en el puerto 443 y LDAPS en el 636.

source: The reason SSL uses a different port than TLS is because a TLS connection begins as plain text, and switches to encrypted traffic after the <literal>STARTTLS</literal> directive. SSL connections are encrypted from the beginning. Other than that there are no substantial differences between the two.
es_es: La razón por la que SSL utiliza un puerto diferente a TLS es porque una conexión TLS empieza como texto plano y cambia al tráfico cifrado después de la directiva <literal>STARTTLS</literal>. Las conexiones SSL se cifran desde el principio. Aparte de eso, no hay diferencias sustanciales entre ambos.

source: We will adjust <application>OpenLDAP</application> to use TLS, as SSL is considered deprecated.
es_es: Configuraremos <application>OpenLDAP</application> para que utilice TLS, ya que SSL está obsoleto.

source: Once <application>OpenLDAP</application> is installed via ports, the following configuration parameters in <filename>/usr/local/etc/openldap/slapd.conf</filename> will enable TLS:
es_es: Una vez que <application>OpenLDAP</application> se ha instalado a través de la colección de ports, los siguientes parámetros de configuración en el archivo <filename>/usr/local/etc/openldap/slapd.conf</filename> habilitarán TLS:

source: Here, <literal>ssf=128</literal> tells <application>OpenLDAP</application> to require 128-bit encryption for all connections, both search and update. This parameter may be configured based on the security needs of your site, but rarely you need to weaken it, as most LDAP client libraries support strong encryption.
es_es: Aquí, <literal>ssf=128</literal> le dice a <application>OpenLDAP</application> que es obligatorio el uso de un cifrado de 128 bits para todas las conexiones, tanto de búsqueda como de actualización. Este parámetro puede configurarse en función de las necesidades de seguridad de su sitio, rara vez necesitará hacer la encriptación más débil, ya que la mayoría de las librerias de clientes LDAP admiten un cifrado seguro.

source: The <filename>cert.crt</filename>, <filename>cert.key</filename>, and <filename>cacert.crt</filename> files are necessary for clients to authenticate <emphasis>you</emphasis> as the valid LDAP server. If you simply want a server that runs, you can create a self-signed certificate with OpenSSL:
es_es: Los archivos <filename>cert.crt</filename>, <filename>cert.key</filename>, y <filename>cacert.crt</filename> son necesarios para que los clientes le identifiquen a <emphasis>usted</emphasis> como el servidor LDAP válido. Si simplemente desea un servidor que se esté ejecutando, puede crear un certificado autofirmado con OpenSSL:

source: Generating an RSA Key
es_es: Generar una clave RSA

source: At this point you should be prompted for some values. You may enter whatever values you like; however, it is important the <quote>Common Name</quote> value be the fully qualified domain name of the <application>OpenLDAP</application> server. In our case, and the examples here, the server is <replaceable>server.example.org</replaceable>. Incorrectly setting this value will cause clients to fail when making connections. This can the cause of great frustration, so ensure that you follow these steps closely.
es_es: En este punto, se le solicitarán algunos valores. Puede introducir los valores que desee; sin embargo, es important que el valor <quote>Common Name</quote> sea el nombre de dominio completo del servidor <application>OpenLDAP</application>. En nuestro caso, y en los ejemplos del artículo, el servidor es <replaceable>server.example.org</replaceable>. Una incorrecta configuración de este valor hará que los clientes fallen al hacer la conexión. Esto puede causar una gran frustración, así que asegúrese de seguir estos pasos cuidadosamente.

source: Finally, the certificate signing request needs to be signed:
es_es: Finalmente, el certificado debe firmarse:

source: Self-signing the Certificate
es_es: Autofirmar el certificado

source: This will create a self-signed certificate that can be used for the directives in <filename>slapd.conf</filename>, where <filename>cert.crt</filename> and <filename>cacert.crt</filename> are the same file. If you are going to use many <application>OpenLDAP</application> servers (for replication via <literal>slurpd</literal>) you will want to see <xref linkend="ssl-ca"/> to generate a CA key and use it to sign individual server certificates.
es_es: Esto creará un certificado autofirmado que puede ser usado en la configuración en el archivo <filename>slapd.conf</filename>, donde <filename>cert.crt</filename> y <filename>cacert.crt</filename> son el mismo archivo. Si piensa utilizar muchos servidores <application>OpenLDAP</application> (replicandolos a través de <literal>slurpd</literal>), querrá ver el <xref linkend="ssl-ca"/> para generar una clave de CA y usarla para firmar certificados de servidor individuales.

source: Once this is done, put the following in <filename>/etc/rc.conf</filename>:
es_es: Una vez hecho esto, ponga la siguiente línea en el archivo <filename>/etc/rc.conf</filename>:

source: Then run <userinput>/usr/local/etc/rc.d/slapd start</userinput>. This should start <application>OpenLDAP</application>. Confirm that it is listening on 389 with
es_es: Después ejecute <userinput>/usr/local/etc/rc.d/slapd start</userinput>. Esto debería iniciar <application>OpenLDAP</application>. Confirme que está escuchando en el puerto 389 con el comando

source: Configuring the Client
es_es: Configurar el cliente

source: Install the <package>net/openldap24-client</package> port for the <application>OpenLDAP</application> libraries. The client machines will always have <application>OpenLDAP</application> libraries since that is all <package>security/pam_ldap</package> and <package>net/nss_ldap</package> support, at least for the moment.
es_es: Instale el port <package>net/openldap24-client</package> para las librerias <application>OpenLDAP</application>. Los ordenadores cliente siempre tendrán las librerias <application>OpenLDAP</application>, ya que todo es compatible con <package>security/pam_ldap</package> y <package>net/nss_ldap</package> support, al menos por el momento.

source: The configuration file for the <application>OpenLDAP</application> libraries is <filename>/usr/local/etc/openldap/ldap.conf</filename>. Edit this file to contain the following values:
es_es: El archivo de configuración para las librerias <application>OpenLDAP</application> es <filename>/usr/local/etc/openldap/ldap.conf</filename>. Edite este archivo para añadirle los siguientes valores:

source: It is important that your clients have access to <filename>cacert.crt</filename>, otherwise they will not be able to connect.
es_es: Es importante que sus clientes tengan acceso a <filename>cacert.crt</filename>, de lo contrario no podrán conectarse.

source: There are two files called <filename>ldap.conf</filename>. The first is this file, which is for the <application>OpenLDAP</application> libraries and defines how to talk to the server. The second is <filename>/usr/local/etc/ldap.conf</filename>, and is for <application>pam_ldap</application>.
es_es: Hay dos archivos llamaados <filename>ldap.conf</filename>. El primero es este archivo, que es para las librerias <application>OpenLDAP</application> y define cómo hablar con el servidor. El segundo es <filename>/usr/local/etc/ldap.conf</filename> y es para <application>pam_ldap</application>.

source: At this point you should be able to run <userinput>ldapsearch -Z</userinput> on the client machine; <option>-Z</option> means <quote>use TLS</quote>. If you encounter an error, then something is configured wrong; most likely it is your certificates. Use <citerefentry><refentrytitle>openssl</refentrytitle><manvolnum>1</manvolnum></citerefentry>'s <command>s_client</command> and <command>s_server</command> to ensure you have them configured and signed properly.
es_es: En este punto, debería poder ejecutar el comando <userinput>ldapsearch -Z</userinput> en el ordenador cliente; <option>-Z</option> significa <quote>use TLS</quote>. Si se produce un error, entonces algo está mal configurado; lo más probable que sean sus certificados. Utilice los comandos <command>s_client</command> y <command>s_server</command> de <citerefentry><refentrytitle>openssl</refentrytitle><manvolnum>1</manvolnum></citerefentry> para asegurarse de tenerlos configurados y firmados correctamente.

source: Entries in the Database
es_es: Entradas en la base de datos

source: Authentication against an LDAP directory is generally accomplished by attempting to bind to the directory as the connecting user. This is done by establishing a <quote>simple</quote> bind on the directory with the user name supplied. If there is an entry with the <literal>uid</literal> equal to the user name and that entry's <literal>userPassword</literal> attribute matches the password supplied, then the bind is successful.
es_es: La autenticación en un directorio LDAP se logra generalmente al intentar vincularse al directorio como el usuario que se conecta. Esto se realiza mediante el establecimiento de un enlace <quote>simple</quote> en el directorio con el nombre de usuario proporcionado. Si hay uan entrada con el <literal>uid</literal> igual al nombre de usuario y el atributo <literal>userPassword</literal> de la entrada coincide con la contraseña proporcionada, el enlace tiene éxito.

source: The first thing we have to do is figure out is where in the directory our users will live.
es_es: Lo primero que tenemos que hacer es averiguar en qué parte del directorio estarán nuestros usuarios.

source: The base entry for our database is <literal>dc=example,dc=org</literal>. The default location for users that most clients seem to expect is something like <literal>ou=people,<replaceable>base</replaceable></literal>, so that is what will be used here. However keep in mind that this is configurable.
es_es: La entrada base para nuestra base de datos es <literal>dc=example,dc=org</literal>. La ubicación predeterminada para los usuarios que la mayoría de los clientes parecen esperar es algo así como <literal>ou=people,<replaceable>base</replaceable></literal>, así que eso es lo que se usará aquí. Sin embargo, tenga en cuenta que esto es configurable.

source: So the ldif entry for the <literal>people</literal> organizational unit will look like:
es_es: Por lo tanto, la entrada ldif para la unidad organizativa de <literal>people</literal> será similar a:

source: All users will be created as subentries of this organizational unit.
es_es: Todos los usuarios se crearán como subentradas de esta unidad organizativa.

source: Some thought might be given to the object class your users will belong to. Most tools by default will use <literal>people</literal>, which is fine if you simply want to provide entries against which to authenticate. However, if you are going to store user information in the LDAP database as well, you will probably want to use <literal>inetOrgPerson</literal>, which has many useful attributes. In either case, the relevant schemas need to be loaded in <filename>slapd.conf</filename>.
es_es: Se podría pensar en la clase de objeto a la que pertenecerán sus usuarios. Por defecto, la mayoría de las herramientas utilizarán <literal>people</literal>, lo cual está bien si simplemente desea proporcionar entradas para la autenticación. Sin embargo, si también va a almacenar información de usuario en la base de datos LDAP, probablemente quiera usar <literal>inetOrgPerson</literal>, el cual dispone de muchos atributos útiles. En cualquier caso, los esquemas relevantes deben introducirse en el archivo <filename>slapd.conf</filename>.

source: For this example we will use the <literal>person</literal> object class. If you are using <literal>inetOrgPerson</literal>, the steps are basically identical, except that the <literal>sn</literal> attribute is required.
es_es: Para este ejemplo, utilizaremos el objeto <literal>person</literal>. Si está utilizando <literal>inetOrgPerson</literal>, los pasos son, básicamente, idénticos, excepto que es necesario el atributo <literal>sn</literal>.

source: To add a user <literal>testuser</literal>, the ldif would be:
es_es: Para añadir el usuario <literal>testuser</literal>, el ldif sería:

source: I start my LDAP users' UIDs at 10000 to avoid collisions with system accounts; you can configure whatever number you wish here, as long as it is less than 65536.
es_es: Yo empiezo los UIDs de mis usuarios de LDAP en el 10000 para evitar conflictos con las cuentas del sistema; puede establecer el número que desee aquí, siempre que sea inferior a 65536.

source: We also need group entries. They are as configurable as user entries, but we will use the defaults below:
es_es: También necesitamos entradas grupales. Son tan configurables como las entradas de usuario, pero usaremos los valores predeterminados que se muestran a continuación:

source: To enter these into your database, you can use <command>slapadd</command> or <command>ldapadd</command> on a file containing these entries. Alternatively, you can use <package>sysutils/ldapvi</package>.
es_es: Para insertarlos en su base de datos, puede usar <command>slapadd</command> o <command>ldapadd</command> en un archivo que contenga estas entradas. De forma alternativa, puede utilizar <package>sysutils/ldapvi</package>.

source: The <command>ldapsearch</command> utility on the client machine should now return these entries. If it does, your database is properly configured to be used as an LDAP authentication server.
es_es: La utilidad <command>ldapsearch</command> en el ordenador del cliente debería devolver estas entradas. Si es así, la base de datos está configurada correctamente para ser utilizada como un servidor de autenticación LDAP.

source: Client Configuration
es_es: Configurar el cliente

source: The client should already have <application>OpenLDAP</application> libraries from <xref linkend="ldap-connect-client"/>, but if you are installing several client machines you will need to install <package>net/openldap24-client</package> on each of them.
es_es: El cliente ya debería tener las librerias <application>OpenLDAP</application> de la <xref linkend="ldap-connect-client"/>, pero si está realizando la instalación en varios ordenadores, necesitará instalar <package>net/openldap24-client</package> en cada una de ellos.

source: FreeBSD requires two ports to be installed to authenticate against an LDAP server, <package>security/pam_ldap</package> and <package>net/nss_ldap</package>.
es_es: FreeBSD requiere de la instalación de dos ports para autenticarse en un servidor LDAP, <package>security/pam_ldap</package> y <package>net/nss_ldap</package>.

source: Authentication
es_es: Autenticación

source: <package>security/pam_ldap</package> is configured via <filename>/usr/local/etc/ldap.conf</filename>.
es_es: <package>security/pam_ldap</package> se configura a través del archivo <filename>/usr/local/etc/ldap.conf</filename>.
