Repository: doc-br/translate
Catalog: articles/*/ldap-auth.po
Languages: es_es

source: This is a <emphasis>different file</emphasis> than the <application>OpenLDAP</application> library functions' configuration file, <filename>/usr/local/etc/openldap/ldap.conf</filename>; however, it takes many of the same options; in fact it is a superset of that file. For the rest of this section, references to <filename>ldap.conf</filename> will mean <filename>/usr/local/etc/ldap.conf</filename>.
es_es: Este es un <emphasis>archivo diferente</emphasis> al archivo de configuración de las funciones de la libreria <application>OpenLDAP</application>, <filename>/usr/local/etc/openldap/ldap.conf</filename>; sin embargo, utiliza muchas de las mismas opciones; en realidad, es un superconjunto de este archivo. Para el resto de esta sección, las referencias a <filename>ldap.conf</filename> significarán <filename>/usr/local/etc/ldap.conf</filename>.

source: Thus, we will want to copy all of our original configuration parameters from <filename>openldap/ldap.conf</filename> to the new <filename>ldap.conf</filename>. Once this is done, we want to tell <package>security/pam_ldap</package> what to look for on the directory server.
es_es: Por lo tanto, queremos copiar todos nuestros parámetros de configuración originales de <filename>openldap/ldap.conf</filename> al nuevo <filename>ldap.conf</filename>. Una vez hecho esto, le indicaremos a <package>security/pam_ldap</package> qué buscar en el servidor de directorio.

source: We are identifying our users with the <literal>uid</literal> attribute. To configure this (though it is the default), set the <literal>pam_login_attribute</literal> directive in <filename>ldap.conf</filename>:
es_es: Estamos identificando a nuestros usuarios con el atributo <literal>uid</literal>. Para configurar esto (aunque es el predeterminado), configure la directiva <literal>pam_login_attribute</literal> en <filename>ldap.conf</filename>:

source: Setting <literal>pam_login_attribute</literal>
es_es: Establecer <literal>pam_login_attribute</literal>

source: With this set, <package>security/pam_ldap</package> will search the entire LDAP directory under <literal>base</literal> for the value <literal>uid=<replaceable>username</replaceable></literal>. If it finds one and only one entry, it will attempt to bind as that user with the password it was given. If it binds correctly, then it will allow access. Otherwise it will fail.
es_es: Con esta configuración, <package>security/pam_ldap</package> buscará en el directorio LDAP completo en la <literal>base</literal> el valor <literal>uid=<replaceable>username</replaceable></literal>. Si encuentra una y solo una entrada, intentará vincularse como ese usuario con la contraseña que se le proporcionó. Si se vincula correctamente, permitirá el acceso. De lo contrario, fallará.

source: Users whose shell is not in <filename>/etc/shells</filename> will not be able to log in. This is particularly important when <application>Bash</application> is set as the user shell on the LDAP server. <application>Bash</application> is not included with a default installation of FreeBSD. When installed from a package or port, it is located at <filename>/usr/local/bin/bash</filename>. Verify that the path to the shell on the server is set correctly:
es_es: Los usuarios cuyo shell no esté en <filename>/etc/shells</filename> no podrán iniciar sesión. Esto es muy importante cuando se configura <application>Bash</application> como la shell de usuario en el servidor LDAP. <application>Bash</application> no está incluido en la instalación estándar de FreeBSD. Cuando se instala desde un paquete o port, se encuentra en el directorio <filename>/usr/local/bin/bash</filename>. Compruebe que la ruta a la shell en el servidor esté configurada correctamente:

source: There are two choices when the output shows <literal>/bin/bash</literal> in the last column. The first is to change the user's entry on the LDAP server to <filename>/usr/local/bin/bash</filename>. The second option is to create a symlink on the LDAP client computer so <application>Bash</application> is found at the correct location:
es_es: Hay dos opciones cuando la salida muestra <literal>/bin/bash</literal> en la última columna. La primera es cambiar la entrada del usuario en el servidor LDAP a <filename>/usr/local/bin/bash</filename>. La segunda opción es crear un enlace simbólico en el cliente LDAP para que <application>Bash</application> se encuentre en la ubicación correcta:

source: Make sure that <filename>/etc/shells</filename> contains entries for both <literal>/usr/local/bin/bash</literal> and <literal>/bin/bash</literal>. The user will then be able to log in to the system with <application>Bash</application> as their shell.
es_es: Asegúrese de que <filename>/etc/shells</filename> contenga entradas para <literal>/usr/local/bin/bash</literal> y <literal>/bin/bash</literal>. El usuario podrá iniciar sesión en el sistema con <application>Bash</application> como su shell.

source: PAM, which stands for <quote>Pluggable Authentication Modules</quote>, is the method by which FreeBSD authenticates most of its sessions. To tell FreeBSD we wish to use an LDAP server, we will have to add a line to the appropriate PAM file.
es_es: PAM, que significa <quote>Pluggable Authentication Modules</quote>, es el método por el cual FreeBSD autentica la mayoría de sus sesiones. Para decirle a FreeBSD que queremos usar un servidor LDAP, tenedremos que añadir una línea al archivo PAM apropiado.

source: Most of the time the appropriate PAM file is <filename>/etc/pam.d/sshd</filename>, if you want to use <application>SSH</application> (remember to set the relevant options in <filename>/etc/ssh/sshd_config</filename>, otherwise <application>SSH</application> will not use PAM).
es_es: La mayoría de las veces el archivo PAM apropiado es <filename>/etc/pam.d/sshd</filename>, si desea usar <application>SSH</application> (recuerde configurar las opciones importantes en <filename>/etc/ssh/sshd_config</filename>, de lo contrario, <application>SSH</application> no usará PAM).

source: To use PAM for authentication, add the line
es_es: Para usar PAM para la autenticación, añada la línea

source: Exactly where this line shows up in the file and which options appear in the fourth column determine the exact behavior of the authentication mechanism; see <citerefentry><refentrytitle>pam.d</refentrytitle><manvolnum>5</manvolnum></citerefentry>
es_es: El sitio donde aparezca esta línea en el archivo y qué opciones tenga en la cuarta columna determina el comportamiento exacto del mecanismo de autenticación, vea <citerefentry><refentrytitle>pam.d</refentrytitle><manvolnum>5</manvolnum></citerefentry>

source: With this configuration you should be able to authenticate a user against an LDAP directory. <application>PAM</application> will perform a bind with your credentials, and if successful will tell <application>SSH</application> to allow access.
es_es: Con esta configuración, debería poder autenticar a un usuario en un directorio LDAP. <application>PAM</application> realizará un enlace con sus credenciales y, si tiene éxito, le indicará a <application>SSH</application> que permita el acceso.

source: However it is not a good idea to allow <emphasis>every</emphasis> user in the directory into <emphasis>every</emphasis> client machine. With the current configuration, all that a user needs to log into a machine is an LDAP entry. Fortunately there are a few ways to restrict user access.
es_es: Sin embargo, no es buena idea permitir que <emphasis>cada</emphasis> usuario del directorio pueda acceder a <emphasis>todos</emphasis> los ordenadores clientes. Con la configuración actual, todo lo que necesita un usuario para iniciar sesión en una máquina es una entrada LDAP. Afortunadamente, hay alfunas formas de restringir el acceso de los usuarios.

source: <filename>ldap.conf</filename> supports a <literal>pam_groupdn</literal> directive; every account that connects to this machine needs to be a member of the group specified here. For example, if you have
es_es: <filename>ldap.conf</filename> admite la directiva <literal>pam_groupdn</literal>; cada cuenta que se conecta a este ordenador debe ser miembro del grupo especificado aquí. Por ejemplo, si tiene

source: in <filename>ldap.conf</filename>, then only members of that group will be able to log in. There are a few things to bear in mind, however.
es_es: en <filename>ldap.conf</filename>, solo los miembros de este grupo podrán iniciar sesión. Sin embargo. hay algunas cosas a tener en cuenta.

source: Members of this group are specified in one or more <literal>memberUid</literal> attributes, and each attribute must have the full distinguished name of the member. So <literal>memberUid: someuser</literal> will not work; it must be:
es_es: Los miembros de este grupo se especifican en uno o más atributos <literal>memberUid</literal>, y cada atributo debe tener el nombre completo del miembro. Entonces <literal>memberUid: someuser</literal> no funcionará; debería ser:

source: Additionally, this directive is not checked in PAM during authentication, it is checked during account management, so you will need a second line in your PAM files under <literal>account</literal>. This will require, in turn, <emphasis>every</emphasis> user to be listed in the group, which is not necessarily what we want. To avoid blocking users that are not in LDAP, you should enable the <literal>ignore_unknown_user</literal> attribute. Finally, you should set the <literal>ignore_authinfo_unavail</literal> option so that you are not locked out of every computer when the LDAP server is unavailable.
es_es: Además, esta directiva no se verifica en PAM durante la autenticación, se verifica durante la administración de la cuenta, por lo que necesitará añadir más configuraciones en sus archivos de PAM en la sección de <literal>account</literal>. Esto, a su vez, requerirá que <emphasis>cada</emphasis> usuario se incluya en el grupo, lo cual no es necesariamente lo que queremos. Para evitar bloquear usuarios que no están en LDAP, debe habilitar el atributo <literal>ignore_unknown_user</literal>. Finalmente, debe configurar la opción <literal>ignore_authinfo_unavail</literal> para que el usuario no quede bloqueado en todos los ordenadores cuando el servidor LDAP no esté disponible.

source: Your <filename>pam.d/sshd</filename> might then end up looking like this:
es_es: Su archivo <filename>pam.d/sshd</filename> debería quedar de la siguiente forma:

source: Sample <filename>pam.d/sshd</filename>
es_es: Ejemplo de <filename>pam.d/sshd</filename>

source: Since we are adding these lines specifically to <filename>pam.d/sshd</filename>, this will only have an effect on <application>SSH</application> sessions. LDAP users will be unable to log in at the console. To change this behavior, examine the other files in <filename>/etc/pam.d</filename> and modify them accordingly.
es_es: Como estamos añadiendo estas líneas específicamente a <filename>pam.d/sshd</filename>, esto solo tendrá efecto en las sesiones <application>SSH</application>. Los usuarios de LDAP no podrán iniciar sesión por consola. Para cambiar este comportamiento, examine los otros archivos en <filename>/etc/pam.d</filename> y modifíquelos como corresponda.

source: <application>NSS</application> is the service that maps attributes to names. So, for example, if a file is owned by user <literal>1001</literal>, an application will query <application>NSS</application> for the name of <literal>1001</literal>, and it might get <literal>bob</literal> or <literal>ted</literal> or whatever the user's name is.
es_es: <application>NSS</application> es el servicio que asigna atributos a nombres. Entonces, por ejemplo, si un archivo es propiedad del usuario <literal>1001</literal>, una aplicación le consultará a <application>NSS</application> por el nombre de <literal>1001</literal>, y podría obtener <literal>bob</literal> o <literal>ted</literal> o cual sea el nombre del usuario.

source: Now that our user information is kept in LDAP, we need to tell <application>NSS</application> to look there when queried.
es_es: Ahora que nuestra información de usuario se mantiene en LDAP, debemos decirle a <application>NSS</application> que busque allí cuando se le consulte.

source: The <package>net/nss_ldap</package> port does this. It uses the same configuration file as <package>security/pam_ldap</package>, and should not need any extra parameters once it is installed. Instead, what is left is simply to edit <filename>/etc/nsswitch.conf</filename> to take advantage of the directory. Simply replace the following lines:
es_es: El port <package>net/nss_ldap</package> hace esto. Utiliza el mismo archivo de configuración que <package>security/pam_ldap</package>, y no debería necesitar ningún parámetro adicional después de su instalación. En cambio, solo quedaría editar el archivo <filename>/etc/nsswitch.conf</filename> para aprovechar el directorio. Simplemente cambie las siguientes líneas:

source: with
es_es: por

source: This will allow you to map usernames to UIDs and UIDs to usernames.
es_es: Esto le permitirá asignar nombres de usuario a UIDs y UIDs a nombres de usuario.

source: Congratulations! You should now have working LDAP authentication.
es_es: ¡Felicidades! Ahora debería tener la autenticación de LDAP en funcionamiento.

source: Caveats
es_es: Advertencias

source: Unfortunately, as of the time this was written FreeBSD did not support changing user passwords with <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Because of this, most administrators are left to implement a solution themselves. I provide some examples here. Note that if you write your own password change script, there are some security issues you should be made aware of; see <xref linkend="security-passwd"/>
es_es: Desafortunadamente, al momento de escribir esto, FreeBSD no soporta el cambio de contraseñas de usuario con <citerefentry><refentrytitle>passwd</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Por lo tanto, la mayoría de los administradores deben implementar una solución ellos mismos. Proporciono algunos ejemplos aquí. Tenga en cuenta que si escribe su propio script para cambiar la contraseña, debe tener en cuenta algunos problemas de seguridad; consulte la <xref linkend="security-passwd"/>

source: Shell Script for Changing Passwords
es_es: Shell Script para cambiar contraseñas

source: This script does hardly any error checking, but more important it is very cavalier about how it stores your passwords. If you do anything like this, at least adjust the <literal>security.bsd.see_other_uids</literal> sysctl value:
es_es: Este script apenas verifica errores, pero, lo más importante, es el poco cuidado con el que almacena sus contraseñas. Si hace algo como esto, establezca al menos el calor de <literal>security.bsd.see_other_uids</literal>:

source: A more flexible (and probably more secure) approach can be used by writing a custom program, or even a web interface. The following is part of a <application>Ruby</application> library that can change LDAP passwords. It sees use both on the command line, and on the web.
es_es: Se puede utilizar un enfoque más flexible (y probablemente más seguro) escribiendo un programa personalizado o incluso una interfaz web. Lo siguiente es parte de una libreria de <application>Ruby</application> que puede cambiar las contraseñas LDAP. Se puede usar tanto por línea de comandos y en la web.

source: Ruby Script for Changing Passwords
es_es: Script en Ruby para cambiar las contraseñas

source: Although not guaranteed to be free of security holes (the password is kept in memory, for example) this is cleaner and more flexible than a simple <command>sh</command> script.
es_es: Aunque no se garantiza que esté a salvo de agujeros de seguridad (la contraseña se guarda en memoria, por ejemplo), esto es más limpio y más flexible que un simple script <command>sh</command>.

source: Security Considerations
es_es: Consideraciones de seguridad

source: Now that your machines (and possibly other services) are authenticating against your LDAP server, this server needs to be protected at least as well as <filename>/etc/master.passwd</filename> would be on a regular server, and possibly even more so since a broken or cracked LDAP server would break every client service.
es_es: Ahora que sus ordenadores (y posiblemente otros servicios) se están autenticando contra su servidor LDAP, este servidor debe estar protegido, así como <filename>/etc/master.passwd</filename> estaría en un servidor normal, y posiblemente aún más desde un servidor LDAP corrupto rompería todos los servicios del cliente.

source: Remember, this section is not exhaustive. You should continually review your configuration and procedures for improvements.
es_es: Recuerde, esta sección no es exhaustiva. Debe revisar continuamente su configuración y procedimientos de mejora.

source: Setting Attributes Read-only
es_es: Establecer atributos de solo lectura

source: Several attributes in LDAP should be read-only. If left writable by the user, for example, a user could change his <literal>uidNumber</literal> attribute to <literal>0</literal> and get <systemitem class="username">root</systemitem> access!
es_es: Hay varios atributos en LDAP que deben ser de solo lectura. Si el usuario pudiera tener acceso de escritura, por ejemplo, ¡un usuario podría cambiar su atributo <literal>uidNumber</literal> a <literal>0</literal> y obtener permisos de <systemitem class="username">root</systemitem>!

source: To begin with, the <literal>userPassword</literal> attribute should not be world-readable. By default, anyone who can connect to the LDAP server can read this attribute. To disable this, put the following in <filename>slapd.conf</filename>:
es_es: Para empezar, el atributo <literal>userPassword</literal> no debe ser legible por todo el mundo. Por defecto, cualquiera que pueda conectarse al servidor LDAP puede leer este atributo. Para deshabilitar esto, coloque la siguiente configuración en el archivo <filename>slapd.conf</filename>:

source: Hide Passwords
es_es: Ocultar contraseñas

source: This will disallow reading of the <literal>userPassword</literal> attribute, while still allowing users to change their own passwords.
es_es: Esto deshabilitará la posibilidad de leer el atributo <literal>userPassword</literal> y al mismo tiempo permitirá a los usuarios cambiar sus propias contraseñas.

source: Additionally, you'll want to keep users from changing some of their own attributes. By default, users can change any attribute (except for those which the LDAP schemas themselves deny changes), such as <literal>uidNumber</literal>. To close this hole, modify the above to
es_es: Además, querrá evitar que los usuarios cambien algunos de sus propios atributos. De forma predeterminada, los usuarios pueden cambiar cualquier atributo (excepto aquellos en los que los esquemas LDAP mismos niegan cambios), como <literal>uidNumber</literal>. Para cerrar este agujero, modifique lo anterior a

source: Read-only Attributes
es_es: Atributos de solo lectura

source: This will stop users from being able to masquerade as other users.
es_es: Esto evitará que los usuarios puedan hacerse pasar por otros usuarios.

source: <systemitem class="username">root</systemitem> Account Definition
es_es: Definición de la cuenta <systemitem class="username">root</systemitem>

source: Often the <systemitem class="username">root</systemitem> or manager account for the LDAP service will be defined in the configuration file. <application>OpenLDAP</application> supports this, for example, and it works, but it can lead to trouble if <filename>slapd.conf</filename> is compromised. It may be better to use this only to bootstrap yourself into LDAP, and then define a <systemitem class="username">root</systemitem> account there.
es_es: A menudo, la cuenta de administrador o <systemitem class="username">root</systemitem> para el servicio LDAP se definirá en el archivo de configuración. <application>OpenLDAP</application> soporta esto, por ejemplo, y funciona, pero puede generar problemas si <filename>slapd.conf</filename> se ve comprometido. Puede ser mejor usar esto solo para iniciarse en LDAP y luego definir una cuenta <systemitem class="username">root</systemitem> ahí.

source: Even better is to define accounts that have limited permissions, and omit a <systemitem class="username">root</systemitem> account entirely. For example, users that can add or remove user accounts are added to one group, but they cannot themselves change the membership of this group. Such a security policy would help mitigate the effects of a leaked password.
es_es: Lo mejor es definir cuentas con permisos limitados y omitir por completo una cuenta <systemitem class="username">root</systemitem>. Por ejemplo, los usuarios que puedan añadir o eliminar cuentas de usuario se añadiran a un grupo, pero ellos mismos no pueden cambiar la pertenencia de este grupo. Dicha política de seguridad ayudará a mitigar los efectos de una contraseña filtrada.

source: Creating a Management Group
es_es: Crear un grupo de mantenimiendo

source: Say you want your IT department to be able to change home directories for users, but you do not want all of them to be able to add or remove users. The way to do this is to add a group for these admins:
es_es: Supongamos que desea que su departamento de TI pueda cambiar los directorios home de los usuarios, pero no quiere que todos puedan añadir o eliminar usuarios. La forma de hacerlo es agregar un grupo para estos administradores:

source: And then change the permissions attributes in <filename>slapd.conf</filename>:
es_es: Y luego cambie los atributos de los permisos en <filename>slapd.conf</filename>:

source: ACLs for a Home Directory Management Group
es_es: ACLs para el grupo de administración del directorio home

source: Now <systemitem class="username">tuser</systemitem> and <systemitem class="username">user2</systemitem> can change other users' home directories.
es_es: Ahora <systemitem class="username">tuser</systemitem> y <systemitem class="username">user2</systemitem> pueden cambiar los directorios home de otros usuarios.

source: In this example we have given a subset of administrative power to certain users without giving them power in other domains. The idea is that soon no single user account has the power of a <systemitem class="username">root</systemitem> account, but every power root had is had by at least one user. The <systemitem class="username">root</systemitem> account then becomes unnecessary and can be removed.
es_es: En este ejemplo, hemos otorgado un subconjunto de poderes administrativos a ciertos usuarios sin darles poder en otros dominios. La idea es que ninguna cuenta de usuario individual tenga el poder de una cuenta <systemitem class="username">root</systemitem>, pero cada usuario root tiene al menos un usuario. La cuenta <systemitem class="username">root</systemitem> es innecesaria y puede eliminarse.

source: Password Storage
es_es: Almacenamiento de contraseña

source: By default <application>OpenLDAP</application> will store the value of the <literal>userPassword</literal> attribute as it stores any other data: in the clear. Most of the time it is base 64 encoded, which provides enough protection to keep an honest administrator from knowing your password, but little else.
es_es: Por defecto, <application>OpenLDAP</application> almacenará el valor del <literal>userPassword</literal> de la misma forma que almacena cualquier otro dato: en texto plano. La mayoría de las veces, está codificado en base 64, lo que proporciona protección suficiente para evitar que un administrador honesto sepa su contraseña, pero poco más.
