Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: <literal>CLONE_FILES</literal> - share open files
es_es: <literal>CLONE_FILES</literal> - compartir archivos abiertos

source: <literal>CLONE_SIGHAND</literal> - share signal handlers and blocked signals
es_es: <literal>CLONE_SIGHAND</literal> - compartir manejadores de señales y señales bloqueadas

source: <literal>CLONE_PARENT</literal> - share parent
es_es: <literal>CLONE_PARENT</literal> - Compartir padre

source: <literal>CLONE_THREAD</literal> - be thread (further explanation below)
es_es: <literal>CLONE_THREAD</literal> - ser hilo (más explicación a continuación)

source: <literal>CLONE_NEWNS</literal> - new namespace
es_es: <literal>CLONE_NEWNS</literal> - nuevo espacio de nombres

source: <literal>CLONE_SYSVSEM</literal> - share SysV undo structures
es_es: <literal>CLONE_SYSVSEM</literal> - compartir estructuras de deshacer SysV

source: <literal>CLONE_SETTLS</literal> - setup TLS at supplied address
es_es: <literal>CLONE_SETTLS</literal> - configurar TLS en la dirección proporcionada

source: <literal>CLONE_PARENT_SETTID</literal> - set TID in the parent
es_es: <literal>CLONE_PARENT_SETTID</literal> - Establecer TID en el padre

source: <literal>CLONE_CHILD_CLEARTID</literal> - clear TID in the child
es_es: <literal>CLONE_CHILD_CLEARTID</literal> - TID claro en el niño

source: <literal>CLONE_CHILD_SETTID</literal> - set TID in the child
es_es: <literal>CLONE_CHILD_SETTID</literal> - Establecer TID en el niño

source: <literal>CLONE_PARENT</literal> sets the real parent to the parent of the caller. This is useful for threads because if thread A creates thread B we want thread B to be parented to the parent of the whole thread group. <literal>CLONE_THREAD</literal> does exactly the same thing as <literal>CLONE_PARENT</literal>, <literal>CLONE_VM</literal> and <literal>CLONE_SIGHAND</literal>, rewrites PID to be the same as PID of the caller, sets exit signal to be none and enters the thread group. <literal>CLONE_SETTLS</literal> sets up GDT entries for TLS handling. The <literal>CLONE_*_*TID</literal> set of flags sets/clears user supplied address to TID or 0.
es_es: <literal>CLONE_PARENT</literal> establece el padre real en el padre de la persona que llama. Esto es útil para subprocesos porque si el subproceso A crea el subproceso B, queremos que el subproceso B sea parental al padre de todo el grupo de subprocesos. <literal>CLONE_THREAD</literal> hace exactamente lo mismo que <literal>CLONE_PARENT</literal>, <literal>CLONE_VM</literal> y <literal>CLONE_SIGHAND</literal>, reescribe el PID para que sea el mismo que el PID de la persona que llama, configura la señal de salida como ninguna y entra en el grupo de hilos. <literal>CLONE_SETTLS</literal> configura entradas GDT para el manejo de TLS. los <literal>CLONE_*_*TID</literal> conjunto de banderas establece/borra la dirección proporcionada por el usuario a TID o 0.

source: As you can see the <literal>CLONE_THREAD</literal> does most of the work and does not seem to fit the scheme very well. The original intention is unclear (even for authors, according to comments in the code) but I think originally there was one threading flag, which was then parcelled among many other flags but this separation was never fully finished. It is also unclear what this partition is good for as glibc does not use that so only hand-written use of the clone permits a programmer to access this features.
es_es: Como puede ver el <literal>CLONE_THREAD</literal> hace la mayor parte del trabajo y no parece encajar muy bien en el esquema. La intención original no está clara (incluso para los autores, según los comentarios en el código), pero creo que originalmente había una bandera de subprocesamiento, que luego se dividió entre muchas otras banderas, pero esta separación nunca se terminó por completo. Tampoco está claro para qué sirve esta partición, ya que glibc no la usa, por lo que solo el uso escrito a mano del clon permite al programador acceder a estas funciones.

source: For non-threaded programs the PID and TID are the same. For threaded programs the first thread PID and TID are the same and every created thread shares the same PID and gets assigned a unique TID (because <literal>CLONE_THREAD</literal> is passed in) also parent is shared for all processes forming this threaded program.
es_es: Para los programas sin subprocesos, el PID y el TID son los mismos. Para los programas con subprocesos, el PID y el TID del primer subproceso son iguales y cada subproceso creado comparte el mismo PID y se le asigna un TID único (porque <literal>CLONE_THREAD</literal> se pasa) también el padre se comparte para todos los procesos que forman este programa enhebrado.

source: The code that implements <citerefentry><refentrytitle>pthread_create</refentrytitle><manvolnum>3</manvolnum></citerefentry> in NPTL defines the clone flags like this:
es_es: El código que implementa <citerefentry><refentrytitle>pthread_create</refentrytitle><manvolnum>3</manvolnum></citerefentry> en NPTL define las banderas de clonación como esta:

source: The <literal>CLONE_SIGNAL</literal> is defined like
es_es: El <literal>CLONE_SIGNAL</literal> se define como

source: the last 0 means no signal is sent when any of the threads exits.
es_es: el último 0 significa que no se envía ninguna señal cuando alguno de los hilos sale.

source: What is emulation
es_es: Que es la emulacion

source: According to a dictionary definition, emulation is the ability of a program or device to imitate another program or device. This is achieved by providing the same reaction to a given stimulus as the emulated object. In practice, the software world mostly sees three types of emulation - a program used to emulate a machine (QEMU, various game console emulators etc.), software emulation of a hardware facility (OpenGL emulators, floating point units emulation etc.) and operating system emulation (either in kernel of the operating system or as a userspace program).
es_es: Según una definición de diccionario, la emulación es la capacidad de un programa o dispositivo para imitar otro programa o dispositivo. Esto se logra proporcionando la misma reacción a un estímulo dado que el objeto emulado. En la práctica, el mundo del software ve principalmente tres tipos de emulación: un programa utilizado para emular una máquina (QEMU, varios emuladores de consola de juegos, etc.), emulación de software de una instalación de hardware (emuladores OpenGL, emulación de unidades de punto flotante, etc.) y operación emulación del sistema (ya sea en el núcleo del sistema operativo o como un programa de espacio de usuario).

source: Emulation is usually used in a place, where using the original component is not feasible nor possible at all. For example someone might want to use a program developed for a different operating system than they use. Then emulation comes in handy. Sometimes there is no other way but to use emulation - e.g. when the hardware device you try to use does not exist (yet/anymore) then there is no other way but emulation. This happens often when porting an operating system to a new (non-existent) platform. Sometimes it is just cheaper to emulate.
es_es: La emulación se usa generalmente en un lugar donde usar el componente original no es factible ni posible en absoluto. Por ejemplo, alguien podría querer usar un programa desarrollado para un sistema operativo diferente al que usa. Entonces la emulación es útil. A veces no hay otra forma que usar la emulación, por ejemplo, cuando el dispositivo de hardware que intenta utilizar no existe (todavía / más), no hay otra forma que la emulación. Esto sucede a menudo cuando se traslada un sistema operativo a una plataforma nueva (inexistente). A veces es más barato emular.

source: Looking from an implementation point of view, there are two main approaches to the implementation of emulation. You can either emulate the whole thing - accepting possible inputs of the original object, maintaining inner state and emitting correct output based on the state and/or input. This kind of emulation does not require any special conditions and basically can be implemented anywhere for any device/program. The drawback is that implementing such emulation is quite difficult, time-consuming and error-prone. In some cases we can use a simpler approach. Imagine you want to emulate a printer that prints from left to right on a printer that prints from right to left. It is obvious that there is no need for a complex emulation layer but simply reversing of the printed text is sufficient. Sometimes the emulating environment is very similar to the emulated one so just a thin layer of some translation is necessary to provide fully working emulation! As you can see this is much less demanding to implement, so less time-consuming and error-prone than the previous approach. But the necessary condition is that the two environments must be similar enough. The third approach combines the two previous. Most of the time the objects do not provide the same capabilities so in a case of emulating the more powerful one on the less powerful we have to emulate the missing features with full emulation described above.
es_es: Desde el punto de vista de la implementación, hay dos enfoques principales para la implementación de la emulación. Puede emular todo, aceptando posibles entradas del objeto original, manteniendo el estado interno y emitiendo la salida correcta según el estado y / o la entrada. Este tipo de emulación no requiere condiciones especiales y básicamente se puede implementar en cualquier lugar para cualquier dispositivo / programa. El inconveniente es que implementar tal emulación es bastante difícil, requiere mucho tiempo y es propenso a errores. En algunos casos, podemos utilizar un enfoque más simple. Imagine que desea emular una impresora que imprime de izquierda a derecha en una impresora que imprime de derecha a izquierda. Es obvio que no hay necesidad de una capa de emulación compleja, pero basta con invertir el texto impreso. A veces, el entorno de emulación es muy similar al emulado, por lo que solo se necesita una capa fina de traducción para proporcionar una emulación completamente funcional. Como puede ver, esto es mucho menos exigente de implementar, por lo que consume menos tiempo y es propenso a errores que el enfoque anterior. Pero la condición necesaria es que los dos entornos sean lo suficientemente similares. El tercer enfoque combina los dos anteriores. La mayoría de las veces los objetos no brindan las mismas capacidades, por lo que en el caso de emular el más poderoso en el menos poderoso, tenemos que emular las características faltantes con la emulación completa descrita anteriormente.

source: This master thesis deals with emulation of <trademark class="registered">UNIX</trademark> on <trademark class="registered">UNIX</trademark>, which is exactly the case, where only a thin layer of translation is sufficient to provide full emulation. The <trademark class="registered">UNIX</trademark> API consists of a set of syscalls, which are usually self contained and do not affect some global kernel state.
es_es: Esta tesis de maestría trata sobre la emulación de <trademark class="registered">UNIX</trademark> en <trademark class="registered">UNIX</trademark>, que es exactamente el caso, donde solo una fina capa de traducción es suficiente para proporcionar una emulación completa. los <trademark class="registered">UNIX</trademark> La API consta de un conjunto de llamadas al sistema, que normalmente son independientes y no afectan al estado global del kernel.

source: There are a few syscalls that affect inner state but this can be dealt with by providing some structures that maintain the extra state.
es_es: Hay algunas llamadas al sistema que afectan el estado interno, pero esto se puede solucionar proporcionando algunas estructuras que mantienen el estado adicional.

source: No emulation is perfect and emulations tend to lack some parts but this usually does not cause any serious drawbacks. Imagine a game console emulator that emulates everything but music output. No doubt that the games are playable and one can use the emulator. It might not be that comfortable as the original game console but its an acceptable compromise between price and comfort.
es_es: Ninguna emulación es perfecta y las emulaciones tienden a carecer de algunas partes, pero esto no suele causar inconvenientes graves. Imagina un emulador de consola de juegos que emula todo menos la salida de música. No hay duda de que los juegos son jugables y se puede usar el emulador. Puede que no sea tan cómodo como la consola de juegos original, pero es un compromiso aceptable entre precio y comodidad.

source: The same goes with the <trademark class="registered">UNIX</trademark> API. Most programs can live with a very limited set of syscalls working. Those syscalls tend to be the oldest ones (<citerefentry><refentrytitle>read</refentrytitle><manvolnum>2</manvolnum></citerefentry>/<citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry>, <citerefentry><refentrytitle>fork</refentrytitle><manvolnum>2</manvolnum></citerefentry> family, <citerefentry><refentrytitle>signal</refentrytitle><manvolnum>3</manvolnum></citerefentry> handling, <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>socket</refentrytitle><manvolnum>2</manvolnum></citerefentry> API) hence it is easy to emulate because their semantics is shared among all <trademark class="registered">UNIX</trademark>es, which exist todays.
es_es: Lo mismo ocurre con el <trademark class="registered">UNIX</trademark> API. La mayoría de los programas pueden vivir con un conjunto muy limitado de llamadas al sistema funcionando. Esas llamadas al sistema tienden a ser las más antiguas (<citerefentry><refentrytitle>leer</refentrytitle><manvolnum>2</manvolnum></citerefentry>/<citerefentry><refentrytitle>write</refentrytitle><manvolnum>2</manvolnum></citerefentry>, <citerefentry><refentrytitle>fork</refentrytitle><manvolnum>2</manvolnum></citerefentry> family, <citerefentry><refentrytitle>señal</refentrytitle><manvolnum>3</manvolnum></citerefentry> handling, <citerefentry><refentrytitle>salida</refentrytitle><manvolnum>3</manvolnum></citerefentry>, <citerefentry><refentrytitle>socket</refentrytitle><manvolnum>2</manvolnum></citerefentry> API), por lo que es fácil de emular porque su semántica se comparte entre todos <trademark class="registered">UNIX</trademark>es, que existen hoy.

source: Emulation
es_es: Emulación

source: How emulation works in FreeBSD
es_es: Cómo funciona la emulación en FreeBSD

source: As stated earlier, FreeBSD supports running binaries from several other <trademark class="registered">UNIX</trademark>es. This works because FreeBSD has an abstraction called the execution class loader. This wedges into the <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall, so when <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> is about to execute a binary it examines its type.
es_es: Como se dijo anteriormente, FreeBSD admite la ejecución de binarios de varios otros <trademark class="registered">UNIX</trademark>es. esto funciona porque FreeBSD tiene una abstracción llamada cargador de clases de ejecución. Esto encaja en el<citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry>syscall, así que cuando <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> está a punto de ejecutar un binario examina su tipo.

source: There are basically two types of binaries in FreeBSD. Shell-like text scripts which are identified by <literal>#!</literal> as their first two characters and normal (typically <firstterm>ELF</firstterm>) binaries, which are a representation of a compiled executable object. The vast majority (one could say all of them) of binaries in FreeBSD are from type ELF. ELF files contain a header, which specifies the OS ABI for this ELF file. By reading this information, the operating system can accurately determine what type of binary the given file is.
es_es: Básicamente, existen dos tipos de binarios en FreeBSD. Scripts de texto tipo shell que se identifican por <literal>#!</literal> como sus dos primeros personajes y normal (typically <firstterm>ELF</firstterm>) binarios, que son una representación de un objeto ejecutable compilado. La gran mayoría (se podría decir que todos) de los binarios en FreeBSD son del tipo ELF. Los archivos ELF contienen un encabezado, que especifica la ABI del sistema operativo para este archivo ELF. Al leer esta información, el sistema operativo puede determinar con precisión qué tipo de binario es el archivo dado.

source: Every OS ABI must be registered in the FreeBSD kernel. This applies to the FreeBSD native OS ABI, as well. So when <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> executes a binary it iterates through the list of registered APIs and when it finds the right one it starts to use the information contained in the OS ABI description (its syscall table, <literal>errno</literal> translation table, etc.). So every time the process calls a syscall, it uses its own set of syscalls instead of some global one. This effectively provides a very elegant and easy way of supporting execution of various binary formats.
es_es: Cada OS ABI debe estar registrado en el kernel de FreeBSD. Esto también se aplica a la ABI del sistema operativo nativo de FreeBSD. Así que cuando <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> ejecuta un binario, itera a través de la lista de API registradas y cuando encuentra la correcta, comienza a usar la información contenida en la descripción de la ABI del sistema operativo (su tabla syscall,<literal>errno</literal> tabla de traducción, etc.). Entonces, cada vez que el proceso llama a una llamada al sistema, utiliza su propio conjunto de llamadas al sistema en lugar de una global. Esto proporciona efectivamente una forma muy elegante y fácil de soportar la ejecución de varios formatos binarios.

source: The nature of emulation of different OSes (and also some other subsystems) led developers to invite a handler event mechanism. There are various places in the kernel, where a list of event handlers are called. Every subsystem can register an event handler and they are called accordingly. For example, when a process exits there is a handler called that possibly cleans up whatever the subsystem needs to be cleaned.
es_es: La naturaleza de la emulación de diferentes sistemas operativos (y también algunos otros subsistemas) llevó a los desarrolladores a invitar a un mecanismo de eventos de controlador. Hay varios lugares en el kernel, donde se llama a una lista de controladores de eventos. Cada subsistema puede registrar un controlador de eventos y se los llama en consecuencia. Por ejemplo, cuando un proceso sale, se llama a un controlador que posiblemente limpia lo que sea que el subsistema necesite limpiarse.

source: Those simple facilities provide basically everything that is needed for the emulation infrastructure and in fact these are basically the only things necessary to implement the <trademark class="registered">Linux</trademark> emulation layer.
es_es: Esas sencillas instalaciones proporcionan básicamente todo lo que se necesita para la infraestructura de emulación y, de hecho, son básicamente las únicas cosas necesarias para implementar el <trademark class="registered">Linux</trademark> capa de emulación.

source: Common primitives in the FreeBSD kernel
es_es: Primitivas comunes en el kernel de FreeBSD

source: Emulation layers need some support from the operating system. I am going to describe some of the supported primitives in the FreeBSD operating system.
es_es: Las capas de emulación necesitan soporte del sistema operativo. Voy a describir algunas de las primitivas soportadas en el sistema operativo FreeBSD.

source: Locking primitives
es_es: Bloqueo de primitivos

source: Contributed by: Attilio Rao <email>attilio@FreeBSD.org</email>
es_es: Contribuido por: Attilio Rao <email>attilio@FreeBSD.org</email>

source: The FreeBSD synchronization primitive set is based on the idea to supply a rather huge number of different primitives in a way that the better one can be used for every particular, appropriate situation.
es_es: El conjunto de primitivas de sincronización de FreeBSD se basa en la idea de suministrar un número bastante grande de primitivas diferentes de manera que se pueda utilizar la mejor para cada situación particular y apropiada.

source: To a high level point of view you can consider three kinds of synchronization primitives in the FreeBSD kernel:
es_es: Desde un punto de vista de alto nivel, puede considerar tres tipos de primitivas de sincronización en el kernel de FreeBSD:

source: atomic operations and memory barriers
es_es: operaciones atómicas y barreras de memoria

source: locks
es_es: Cerraduras

source: scheduling barriers
es_es: barreras de programación

source: Below there are descriptions for the 3 families. For every lock, you should really check the linked manpage (where possible) for more detailed explanations.
es_es: A continuación hay descripciones de las 3 familias. Para cada bloqueo, debería consultar la página de manual vinculada (cuando sea posible) para obtener explicaciones más detalladas.

source: Atomic operations and memory barriers
es_es: Operaciones atómicas y barreras de memoria
