Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: Whenever a <trademark class="registered">Linux</trademark> process running in the emulation layer traps the trap itself is handled transparently with the only exception of the trap translation. <trademark class="registered">Linux</trademark> and FreeBSD differs in opinion on what a trap is so this is dealt with here. The code is actually very short:
es_es: Siempre que un <trademark class="registered">Linux</trademark> proceso que se ejecuta en la capa de emulación trampas la trampa en sí se maneja de forma transparente con la única excepción de la traducción de trampas. <trademark class="registered">Linux</trademark> y FreeBSD difiere de opinión sobre lo que es una trampa, así que esto se trata aquí. El código es realmente muy corto:

source: Stack fixup
es_es: Reparación de pila

source: The RTLD run-time link-editor expects so called AUX tags on stack during an <function>execve</function> so a fixup must be done to ensure this. Of course, every RTLD system is different so the emulation layer must provide its own stack fixup routine to do this. So does Linuxulator. The <function>elf_linux_fixup</function> simply copies out AUX tags to the stack and adjusts the stack of the user space process to point right after those tags. So RTLD works in a smart way.
es_es: El editor de enlaces en tiempo de ejecución de RTLD espera las llamadas etiquetas AUX en la pila durante una <function>execve</function>por lo que se debe realizar una reparación para garantizar esto. Por supuesto, cada sistema RTLD es diferente, por lo que la capa de emulación debe proporcionar su propia rutina de reparación de la pila para hacer esto. Linuxulator también. los <function>elf_linux_fixup</function> simplemente copia las etiquetas AUX a la pila y ajusta la pila del proceso de espacio de usuario para que apunte justo después de esas etiquetas. Entonces RTLD funciona de manera inteligente.

source: A.OUT support
es_es: soporte A.OUT

source: The <trademark class="registered">Linux</trademark> emulation layer on i386 also supports <trademark class="registered">Linux</trademark> A.OUT binaries. Pretty much everything described in the previous sections must be implemented for A.OUT support (beside traps translation and signals sending). The support for A.OUT binaries is no longer maintained, especially the 2.6 emulation does not work with it but this does not cause any problem, as the linux-base in ports probably do not support A.OUT binaries at all. This support will probably be removed in future. Most of the stuff necessary for loading <trademark class="registered">Linux</trademark> A.OUT binaries is in <filename>imgact_linux.c</filename> file.
es_es: La <trademark class="registered">Linux</trademark> La capa de emulación en i386 también admite <trademark class="registered">Linux</trademark>A.OUT binarios. Prácticamente todo lo descrito en las secciones anteriores debe implementarse para la compatibilidad con A.OUT (además de la traducción de trampas y el envío de señales). El soporte para los binarios A.OUT ya no se mantiene, especialmente la emulación 2.6 no funciona con él, pero esto no causa ningún problema, ya que la base de linux en los puertos probablemente no soporte los binarios A.OUT en absoluto. Este soporte probablemente se eliminará en el futuro. La mayoría de las cosas necesarias para cargar<trademark class="registered">Linux</trademark> A.OUT binarios está en <filename>imgact_linux.c</filename> archivo.

source: <trademark class="registered">Linux</trademark> emulation layer -MI part
es_es: <trademark class="registered">Linux</trademark> capa de emulación - parte MI

source: This section talks about machine independent part of the Linuxulator. It covers the emulation infrastructure needed for <trademark class="registered">Linux</trademark> 2.6 emulation, the thread local storage (TLS) implementation (on i386) and futexes. Then we talk briefly about some syscalls.
es_es: Esta sección habla de la parte independiente de la máquina del Linuxulator. Cubre la infraestructura de emulación necesaria para <trademark class="registered">Linux</trademark> 2.6 emulación, la implementación del almacenamiento local de subprocesos (TLS) (en i386) y futexes. Luego hablamos brevemente sobre algunas llamadas al sistema.

source: Description of NPTL
es_es: Descripción de NPTEL

source: One of the major areas of progress in development of <trademark class="registered">Linux</trademark> 2.6 was threading. Prior to 2.6, the <trademark class="registered">Linux</trademark> threading support was implemented in the <application>linuxthreads</application> library. The library was a partial implementation of <trademark class="registered">POSIX</trademark> threading. The threading was implemented using separate processes for each thread using the <function>clone</function> syscall to let them share the address space (and other things). The main weaknesses of this approach was that every thread had a different PID, signal handling was broken (from the pthreads perspective), etc. Also the performance was not very good (use of <literal>SIGUSR</literal> signals for threads synchronization, kernel resource consumption, etc.) so to overcome these problems a new threading system was developed and named NPTL.
es_es: Una de las principales áreas de progreso en el desarrollo de <trademark class="registered">Linux</trademark> 2.6 estaba enhebrando. Antes de 2.6, el <trademark class="registered">Linux</trademark> El soporte de subprocesos se implementó en el <application>linuxthreads</application> biblioteca. La biblioteca fue una implementación parcial de <trademark class="registered">POSIX</trademark> enhebrado. El subproceso se implementó usando procesos separados para cada subproceso usando el <function>clone</function> syscall para permitirles compartir el espacio de direcciones (y otras cosas). La principal debilidad de este enfoque era que cada hilo tenía un PID diferente, el manejo de la señal estaba roto (desde la perspectiva de los pthreads), etc. Además, el rendimiento no era muy bueno (uso de <literal>SIGUSR</literal> señales para sincronización de subprocesos, consumo de recursos del kernel, etc.), por lo que para superar estos problemas se desarrolló un nuevo sistema de subprocesos denominado NPTL.

source: The NPTL library focused on two things but a third thing came along so it is usually considered a part of NPTL. Those two things were embedding of threads into a process structure and futexes. The additional third thing was TLS, which is not directly required by NPTL but the whole NPTL userland library depends on it. Those improvements yielded in much improved performance and standards conformance. NPTL is a standard threading library in <trademark class="registered">Linux</trademark> systems these days.
es_es: La biblioteca NPTL se centró en dos cosas, pero apareció una tercera, por lo que generalmente se considera parte de NPTL. Esas dos cosas fueron la incrustación de subprocesos en una estructura de proceso y funciones. La tercera cosa adicional fue TLS, que no es requerido directamente por NPTL, pero toda la biblioteca de usuario de NPTL depende de ello. Esas mejoras dieron como resultado un rendimiento y una conformidad con los estándares mucho mejores. NPTL es una biblioteca de subprocesos estándar en <trademark class="registered">Linux</trademark> sistemas en estos días.

source: The FreeBSD Linuxulator implementation approaches the NPTL in three main areas. The TLS, futexes and PID mangling, which is meant to simulate the <trademark class="registered">Linux</trademark> threads. Further sections describe each of these areas.
es_es: La implementación de FreeBSD Linuxulator se acerca a la NPTL en tres áreas principales. TLS, futexes y PID mangling, que está destinado a simular el <trademark class="registered">Linux</trademark> hilos. Más secciones describen cada una de estas áreas.

source: <trademark class="registered">Linux</trademark> 2.6 emulation infrastructure
es_es: <trademark class="registered">Linux</trademark> 2.6 infraestructura de emulación

source: These sections deal with the way <trademark class="registered">Linux</trademark> threads are managed and how we simulate that in FreeBSD.
es_es: Estas secciones tratan sobre la forma <trademark class="registered">Linux</trademark> se administran los hilos y cómo lo simulamos en FreeBSD.

source: Runtime determining of 2.6 emulation
es_es: Determinación del tiempo de ejecución de la emulación 2.6

source: The <trademark class="registered">Linux</trademark> emulation layer in FreeBSD supports runtime setting of the emulated version. This is done via <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>, namely <literal>compat.linux.osrelease</literal>. Setting this <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> affects runtime behavior of the emulation layer. When set to 2.6.x it sets the value of <literal>linux_use_linux26</literal> while setting to something else keeps it unset. This variable (plus per-prison variables of the very same kind) determines whether 2.6 infrastructure (mainly PID mangling) is used in the code or not. The version setting is done system-wide and this affects all <trademark class="registered">Linux</trademark> processes. The <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry> should not be changed when running any <trademark class="registered">Linux</trademark> binary as it might harm things.
es_es: En <trademark class="registered">Linux</trademark>La capa de emulación en FreeBSD admite la configuración de tiempo de ejecución de la versión emulada. Esto se hace a través de <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>, a saber <literal>compat.linux.osrelease</literal>. configurando esto <citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>afecta el comportamiento en tiempo de ejecución de la capa de emulación. Cuando se establece en 2.6.x, establece el valor de <literal>linux_use_linux26</literal> mientras que el ajuste a otra cosa lo mantiene desarmado. Esta variable (más las variables por prisión del mismo tipo) determina si la infraestructura 2.6 (principalmente manipulación de PID) se usa en el código o no. La configuración de la versión se realiza en todo el sistema y esto afecta a todos<trademark class="registered">Linux</trademark> procesos. los<citerefentry><refentrytitle>sysctl</refentrytitle><manvolnum>8</manvolnum></citerefentry>no debe cambiarse al ejecutar cualquier <trademark class="registered">Linux</trademark>binario, ya que podría dañar las cosas.

source: <trademark class="registered">Linux</trademark> processes and thread identifiers
es_es: <trademark class="registered">Linux</trademark> identificadores de procesos e hilos

source: The semantics of <trademark class="registered">Linux</trademark> threading are a little confusing and uses entirely different nomenclature to FreeBSD. A process in <trademark class="registered">Linux</trademark> consists of a <literal>struct task</literal> embedding two identifier fields - PID and TGID. PID is <emphasis>not</emphasis> a process ID but it is a thread ID. The TGID identifies a thread group in other words a process. For single-threaded process the PID equals the TGID.
es_es: La semántica de <trademark class="registered">Linux</trademark> Los subprocesos son un poco confusos y utilizan una nomenclatura completamente diferente a la de FreeBSD. Un proceso en <trademark class="registered">Linux</trademark> consiste en un <literal>estructura de la tarea</literal> incrustando dos campos identificadores: PID y TGID. PID es <emphasis>no</emphasis> un ID de proceso pero es un ID de hilo. El TGID identifica un grupo de subprocesos, en otras palabras, un proceso. Para procesos de un solo subproceso, el PID es igual al TGID.

source: The thread in NPTL is just an ordinary process that happens to have TGID not equal to PID and have a group leader not equal to itself (and shared VM etc. of course). Everything else happens in the same way as to an ordinary process. There is no separation of a shared status to some external structure like in FreeBSD. This creates some duplication of information and possible data inconsistency. The <trademark class="registered">Linux</trademark> kernel seems to use task -&gt; group information in some places and task information elsewhere and it is really not very consistent and looks error-prone.
es_es: El hilo en NPTL es solo un proceso ordinario que tiene TGID no igual a PID y tiene un líder de grupo que no es igual a él (y VM compartida, etc., por supuesto). Todo lo demás sucede de la misma manera que en un proceso ordinario. No hay separación de un estado compartido a alguna estructura externa como en FreeBSD. Esto crea cierta duplicación de información y una posible inconsistencia de datos. los <trademark class="registered">Linux</trademark> el kernel parece utilizar task -&gt;; información de grupo en algunos lugares e información de tareas en otros lugares y en realidad no es muy consistente y parece propensa a errores.

source: Every NPTL thread is created by a call to the <function>clone</function> syscall with a specific set of flags (more in the next subsection). The NPTL implements strict 1:1 threading.
es_es: cada hilo NPTL se crea mediante una llamada ala <function>clone</function> syscall con un conjunto específico de indicadores (más en la siguiente subsección). La NPTL implementa un subproceso estricto 1: 1.

source: In FreeBSD we emulate NPTL threads with ordinary FreeBSD processes that share VM space, etc. and the PID gymnastic is just mimicked in the emulation specific structure attached to the process. The structure attached to the process looks like:
es_es: En FreeBSD emulamos hilos NPTL con procesos FreeBSD ordinarios que comparten espacio VM, etc. y la gimnasia PID simplemente se imita en la estructura específica de emulación adjunta al proceso. La estructura adjunta al proceso se ve así:

source: The PID is used to identify the FreeBSD process that attaches this structure. The <function>child_se_tid</function> and <function>child_clear_tid</function> are used for TID address copyout when a process exits and is created. The <varname>shared</varname> pointer points to a structure shared among threads. The <varname>pdeath_signal</varname> variable identifies the parent death signal and the <varname>threads</varname> pointer is used to link this structure to the list of threads. The <literal>linux_emuldata_shared</literal> structure looks like:
es_es: El PID se usa para identificar el proceso FreeBSD que adjunta esta estructura. los <function>child_se_tid</function> y <function>child_clear_tid</function> se utilizan para la copia de direcciones TID cuando un proceso sale y se crea. los <varname>shared</varname> puntero apunta a una estructura compartida entre subprocesos. los <varname>pdeath_signal</varname> La variable identifica la señal de muerte del padre y la <varname>threads</varname>El puntero se utiliza para vincular esta estructura a la lista de subprocesos. los <literal>linux_emuldata_shared</literal> estructura se parece a:

source: The <varname>refs</varname> is a reference counter being used to determine when we can free the structure to avoid memory leaks. The <varname>group_pid</varname> is to identify PID ( = TGID) of the whole process ( = thread group). The <varname>threads</varname> pointer is the head of the list of threads in the process.
es_es: La <varname>refs</varname> es un contador de referencia que se utiliza para determinar cuándo podemos liberar la estructura para evitar pérdidas de memoria. los <varname>group_pid</varname> es identificar PID (= TGID) de todo el proceso (= grupo de subprocesos). los <varname>threads</varname> puntero es el encabezado de la lista de subprocesos en el proceso.

source: The <literal>linux_emuldata</literal> structure can be obtained from the process using <function>em_find</function>. The prototype of the function is:
es_es: El <literal>linux_emuldata</literal> La estructura se puede obtener del proceso utilizando <function>em_find</function>. el prototipo de la función es:

source: Here, <varname>proc</varname> is the process we want the emuldata structure from and the locked parameter determines whether we want to lock or not. The accepted values are <literal>EMUL_DOLOCK</literal> and <literal>EMUL_DOUNLOCK</literal>. More about locking later.
es_es: Aqui, <varname>proc</varname> es el proceso del que queremos la estructura emuldata y el parámetro bloqueado determina si queremos bloquear o no. Los valores aceptados son<literal>EMUL_DOLOCK</literal> y <literal>EMUL_DOUNLOCK</literal>. Más sobre bloquear más tarde.

source: PID mangling
es_es: Destrucción de PID

source: The above affects mainly getpid, getppid, gettid syscalls. Where we use PID/TGID respectively. In copyout of TIDs in <function>child_clear_tid</function> and <function>child_set_tid</function> we copy out FreeBSD PID.
es_es: Lo anterior afecta principalmente a las llamadas al sistema getpid, getppid, gettid. Donde usamos PID / TGID respectivamente. En copia de TID en <function>child_clear_tid</function> y<function>child_set_tid</function> copiamos FreeBSD PID.

source: Clone syscall
es_es: Clonar syscall

source: The <function>clone</function> syscall is the way threads are created in <trademark class="registered">Linux</trademark>. The syscall prototype looks like this:
es_es: La <function>clone</function> syscall es la forma en que se crean los hilos en <trademark class="registered">Linux</trademark>. El prototipo de syscall se ve así:

source: The <varname>flags</varname> parameter tells the syscall how exactly the processes should be cloned. As described above, <trademark class="registered">Linux</trademark> can create processes sharing various things independently, for example two processes can share file descriptors but not VM, etc. Last byte of the <varname>flags</varname> parameter is the exit signal of the newly created process. The <varname>stack</varname> parameter if non-<literal>NULL</literal> tells, where the thread stack is and if it is <literal>NULL</literal> we are supposed to copy-on-write the calling process stack (i.e. do what normal <citerefentry><refentrytitle>fork</refentrytitle><manvolnum>2</manvolnum></citerefentry> routine does). The <varname>parent_tidptr</varname> parameter is used as an address for copying out process PID (i.e. thread id) once the process is sufficiently instantiated but is not runnable yet. The <varname>dummy</varname> parameter is here because of the very strange calling convention of this syscall on i386. It uses the registers directly and does not let the compiler do it what results in the need of a dummy syscall. The <varname>child_tidptr</varname> parameter is used as an address for copying out PID once the process has finished forking and when the process exits.
es_es: El <varname>flags</varname> El parámetro le dice al syscall cómo exactamente se deben clonar los procesos. Como se describió anteriormente, <trademark class="registered">Linux</trademark> puede crear procesos compartiendo varias cosas de forma independiente, por ejemplo, dos procesos pueden compartir descriptores de archivo pero no VM, etc. Último byte del <varname>flags</varname> El parámetro es la señal de salida del proceso recién creado. los <varname>stack</varname> parameter if non-<literal>NULL</literal> dice dónde está la pila de subprocesos y si está <literal>NULL</literal> se supone que debemos copiar al escribir la pila del proceso de llamada (es decir, hacer lo normal <citerefentry><refentrytitle>fork</refentrytitle><manvolnum>2</manvolnum></citerefentry> lo hace la rutina). los <varname>parent_tidptr</varname> El parámetro se usa como una dirección para copiar el PID del proceso (es decir, el ID del hilo) una vez que el proceso está suficientemente instanciado pero aún no se puede ejecutar. los <varname>tonto</varname> El parámetro está aquí debido a la muy extraña convención de llamada de esta llamada al sistema en i386. Utiliza los registros directamente y no deja que el compilador lo haga, lo que resulta en la necesidad de una llamada al sistema ficticia. los <varname>child_tidptr</varname> El parámetro se utiliza como dirección para copiar PID una vez que el proceso ha terminado de bifurcarse y cuando el proceso finaliza.
