Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: <trademark class="registered">Linux</trademark> implements 1:1 threading, i.e. it has to use in-kernel synchronization primitives. As stated earlier, well written threaded programs have little lock contention. So a typical sequence could be performed as two atomic increase/decrease mutex reference counter, which is very fast, as presented by the following example:
es_es: <trademark class="registered">Linux</trademark> implementa subprocesos 1: 1, es decir, tiene que usar primitivas de sincronización en el kernel. Como se indicó anteriormente, los programas con subprocesos bien escritos tienen poca contención de bloqueo. Entonces, una secuencia típica podría realizarse como dos contadores de referencia mutex de aumento/disminución atómicos, que es muy rápido, como se presenta en el siguiente ejemplo:

source: 1:1 threading forces us to perform two syscalls for those mutex calls, which is very slow.
es_es: El subproceso 1: 1 nos obliga a realizar dos llamadas al sistema para esas llamadas mutex, lo cual es muy lento.

source: The solution <trademark class="registered">Linux</trademark> 2.6 implements is called futexes. Futexes implement the check for contention in userspace and call kernel primitives only in a case of contention. Thus the typical case takes place without any kernel intervention. This yields reasonably fast and flexible synchronization primitives implementation.
es_es: La solución <trademark class="registered">Linux</trademark> 2.6 implementos se llama futexes. Los futexes implementan la verificación de contención en el espacio de usuario y llaman a las primitivas del núcleo solo en caso de contención. Por tanto, el caso típico tiene lugar sin ninguna intervención del núcleo. Esto produce una implementación de primitivas de sincronización razonablemente rápida y flexible.

source: The futex syscall looks like this:
es_es: La llamada al sistema futex se ve así:

source: In this example <varname>uaddr</varname> is an address of the mutex in userspace, <varname>op</varname> is an operation we are about to perform and the other parameters have per-operation meaning.
es_es: En este ejemplo <varname>uaddr</varname>es una dirección del mutex en el espacio de usuario, <varname>op</varname> es una operación que estamos a punto de realizar y los demás parámetros tienen un significado por operación.

source: Futexes implement the following operations:
es_es: Los Futexes implementan las siguientes operaciones:

source: This operation verifies that on address <varname>uaddr</varname> the value <varname>val</varname> is written. If not, <literal>EWOULDBLOCK</literal> is returned, otherwise the thread is queued on the futex and gets suspended. If the argument <varname>timeout</varname> is non-zero it specifies the maximum time for the sleeping, otherwise the sleeping is infinite.
es_es: Esta operación verifica que en la dirección <varname>uaddr</varname> el valor <varname>val</varname> está escrito. Si no, <literal>EWOULDBLOCK</literal> se devuelve, de lo contrario, el hilo se pone en cola en el futex y se suspende. Si el argumento <varname>timeout</varname> es distinto de cero, especifica el tiempo máximo para dormir; de lo contrario, el sueño es infinito.

source: This operation takes a futex at <varname>uaddr</varname> and wakes up <varname>val</varname> first futexes queued on this futex.
es_es: Esta operación toma un futex en <varname>uaddr</varname> y se despierta <varname>val</varname> Primeros futexes en cola en este futex.

source: This operations associates a file descriptor with a given futex.
es_es: Esta operación asocia un descriptor de archivo con un futex dado.

source: This operation takes <varname>val</varname> threads queued on futex at <varname>uaddr</varname>, wakes them up, and takes <varname>val2</varname> next threads and requeues them on futex at <varname>uaddr2</varname>.
es_es: Esta operación toma <varname>val</varname> hilos en cola en futex en <varname>uaddr</varname>, Los despierta y toma<varname>val2</varname> siguientes hilos y los coloca en futex en <varname>uaddr2</varname>.

source: This operation does the same as <literal>FUTEX_REQUEUE</literal> but it checks that <varname>val3</varname> equals to <varname>val</varname> first.
es_es: Esta operación hace lo mismo que <literal>FUTEX_REQUEUE</literal>pero comprueba que <varname>val3</varname> igual a <varname>val</varname> primero.

source: This operation performs an atomic operation on <varname>val3</varname> (which contains coded some other value) and <varname>uaddr</varname>. Then it wakes up <varname>val</varname> threads on futex at <varname>uaddr</varname> and if the atomic operation returned a positive number it wakes up <varname>val2</varname> threads on futex at <varname>uaddr2</varname>.
es_es: Esta operación realiza una operación atómica en <varname>val3</varname> (que contiene algún otro valor codificado) y<varname>uaddr</varname>. Entonces se despierta <varname>val</varname> hilos en futex en <varname>uaddr</varname> y si la operación atómica devolvió un número positivo, se despierta <varname>val2</varname> hilos en futex en<varname>uaddr2</varname>.

source: The operations implemented in <literal>FUTEX_WAKE_OP</literal>:
es_es: Las operaciones implementadas en <literal>FUTEX_WAKE_OP</literal>:

source: There is no <varname>val2</varname> parameter in the futex prototype. The <varname>val2</varname> is taken from the <varname>struct timespec *timeout</varname> parameter for operations <literal>FUTEX_REQUEUE</literal>, <literal>FUTEX_CMP_REQUEUE</literal> and <literal>FUTEX_WAKE_OP</literal>.
es_es: No hay <varname>val2</varname> parámetro en el prototipo futex. los <varname>val2</varname> es tomado de la <varname>struct timespec *timeout</varname> parámetro para operaciones <literal>FUTEX_REQUEUE</literal>, <literal>FUTEX_CMP_REQUEUE</literal> y <literal>FUTEX_WAKE_OP</literal>.

source: Futex emulation in FreeBSD
es_es: Emulación Futex en FreeBSD

source: The futex emulation in FreeBSD is taken from NetBSD and further extended by us. It is placed in <filename>linux_futex.c</filename> and <filename>linux_futex.h</filename> files. The <literal>futex</literal> structure looks like:
es_es: La emulación futex en FreeBSD se toma de NetBSD y nosotros la ampliamos. Se coloca en <filename>linux_futex.c</filename> and <filename>linux_futex.h</filename> archivos. la <literal>futex</literal> estructura se parece a:

source: And the structure <literal>waiting_proc</literal> is:
es_es: Y la estructura <literal>waiting_proc</literal> es:

source: A futex is obtained using the <function>futex_get</function> function, which searches a linear list of futexes and returns the found one or creates a new futex. When releasing a futex from the use we call the <function>futex_put</function> function, which decreases a reference counter of the futex and if the refcount reaches zero it is released.
es_es: Un futex se obtiene utilizando el <function>futex_get</function>función, que busca en una lista lineal de futexes y devuelve el encontrado o crea un nuevo futex. Al liberar un futex del uso, lo llamamos <function>futex_put</function> función, que disminuye un contador de referencia del futex y si el refcount llega a cero se libera.

source: When a futex queues a thread for sleeping it creates a <literal>working_proc</literal> structure and puts this structure to the list inside the futex structure then it just performs a <citerefentry><refentrytitle>tsleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> to suspend the thread. The sleep can be timed out. After <citerefentry><refentrytitle>tsleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> returns (the thread was woken up or it timed out) the <literal>working_proc</literal> structure is removed from the list and is destroyed. All this is done in the <function>futex_sleep</function> function. If we got woken up from <function>futex_wake</function> we have <varname>wp_new_futex</varname> set so we sleep on it. This way the actual requeueing is done in this function.
es_es: Cuando un futex pone en cola un hilo para dormir, crea un <literal>working_proc</literal> estructura y coloca esta estructura en la lista dentro de la estructura futex, entonces solo realiza una <citerefentry><refentrytitle>tsleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> suspender el hilo. El tiempo de sueño se puede agotar. Después <citerefentry><refentrytitle>tsleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> devuelve (el hilo se despertó o se agotó el tiempo de espera) el <literal>working_proc</literal> La estructura se elimina de la lista y se destruye. Todo esto se hace en el <function>futex_sleep</function>función. Si nos despertaran de <function>futex_wake</function> Nosotros tenemos <varname>wp_new_futex</varname> establecido para que podamos dormir en él. De esta manera, la puesta en cola real se realiza en esta función..

source: Waking up a thread sleeping on a futex is performed in the <function>futex_wake</function> function. First in this function we mimic the strange <trademark class="registered">Linux</trademark> behavior, where it wakes up N threads for all operations, the only exception is that the REQUEUE operations are performed on N+1 threads. But this usually does not make any difference as we are waking up all threads. Next in the function in the loop we wake up n threads, after this we check if there is a new futex for requeueing. If so, we requeue up to n2 threads on the new futex. This cooperates with <function>futex_sleep</function>.
es_es: Despertar un hilo durmiendo en un futex se realiza en el <function>futex_wake</function> función. Primero en esta función imitamos el extraño <trademark class="registered">Linux</trademark> comportamiento, donde despierta N subprocesos para todas las operaciones, la única excepción es que las operaciones REQUEUE se realizan en N + 1 subprocesos. Pero esto generalmente no hace ninguna diferencia ya que estamos despertando todos los hilos. A continuación, en la función en el bucle, activamos n subprocesos, después de esto, verificamos si hay un nuevo futex para poner en cola. Si es así, ponemos en cola hasta n2 subprocesos en el nuevo futex. Esto coopera con <function>futex_sleep</function>.

source: The <literal>FUTEX_WAKE_OP</literal> operation is quite complicated. First we obtain two futexes at addresses <varname>uaddr</varname> and <varname>uaddr2</varname> then we perform the atomic operation using <varname>val3</varname> and <varname>uaddr2</varname>. Then <varname>val</varname> waiters on the first futex is woken up and if the atomic operation condition holds we wake up <varname>val2</varname> (i.e. <varname>timeout</varname>) waiter on the second futex.
es_es: La <literal>FUTEX_WAKE_OP</literal> El funcionamiento es bastante complicado. Primero obtenemos dos futexes en direcciones<varname>uaddr</varname> and <varname>uaddr2</varname> luego realizamos la operación atómica usando <varname>val3</varname> and <varname>uaddr2</varname>. Then <varname>val</varname> los camareros en el primer futex se despiertan y si la condición de operación atómica se mantiene, nos despertamos <varname>val2</varname> (es decir. <varname>timeout</varname>) camarero en el segundo futex.

source: futex atomic operation
es_es: operación atómica futex

source: The atomic operation takes two parameters <varname>encoded_op</varname> and <varname>uaddr</varname>. The encoded operation encodes the operation itself, comparing value, operation argument, and comparing argument. The pseudocode for the operation is like this one:
es_es: La operación atómica toma dos parámetros <varname>encoded_op</varname> y <varname>uaddr</varname>. La operación codificada codifica la operación en sí, comparando valor, argumento de operación y argumento de comparación. El pseudocódigo para la operación es como este:

source: And this is done atomically. First a copying in of the number at <varname>uaddr</varname> is performed and the operation is done. The code handles page faults and if no page fault occurs <varname>oldval</varname> is compared to <varname>cmparg</varname> argument with cmp comparator.
es_es: Y esto se hace de forma atómica. Primero una copia del número en <varname>uaddr</varname> se realiza y se hace la operación. El código maneja fallas de página y si no ocurre ninguna falla de página <varname>oldval</varname> se compara con <varname>cmparg</varname> argumento con comparador cmp.

source: Futex locking
es_es: Bloqueo futex

source: Futex implementation uses two lock lists protecting <function>sx_lock</function> and global locks (either Giant or another <function>sx_lock</function>). Every operation is performed locked from the start to the very end.
es_es: La implementación de Futex utiliza dos listas de bloqueo que protegen<function>sx_lock</function> y cerraduras globales (ya sea gigante u otra <function>sx_lock</function>). Cada operación se realiza bloqueada desde el principio hasta el final.

source: Various syscalls implementation
es_es: Implementación de varias llamadas al sistema

source: In this section I am going to describe some smaller syscalls that are worth mentioning because their implementation is not obvious or those syscalls are interesting from other point of view.
es_es: En esta sección voy a describir algunas llamadas al sistema más pequeñas que vale la pena mencionar porque su implementación no es obvia o esas llamadas al sistema son interesantes desde otro punto de vista.

source: *at family of syscalls
es_es: *en familia de llamadas al sistema

source: During development of <trademark class="registered">Linux</trademark> 2.6.16 kernel, the *at syscalls were added. Those syscalls (<function>openat</function> for example) work exactly like their at-less counterparts with the slight exception of the <varname>dirfd</varname> parameter. This parameter changes where the given file, on which the syscall is to be performed, is. When the <varname>filename</varname> parameter is absolute <varname>dirfd</varname> is ignored but when the path to the file is relative, it comes to the play. The <varname>dirfd</varname> parameter is a directory relative to which the relative pathname is checked. The <varname>dirfd</varname> parameter is a file descriptor of some directory or <literal>AT_FDCWD</literal>. So for example the <function>openat</function> syscall can be like this:
es_es: Durante el desarrollo de <trademark class="registered">Linux</trademark>2.6.16 kernel, se agregaron las llamadas al sistema * at. Esas llamadas al sistema (<function>openat</function>por ejemplo) funcionan exactamente como sus contrapartes at-less con la ligera excepción de <varname>dirfd</varname> parámetro. Este parámetro cambia donde está el archivo dado, en el que se va a realizar la llamada al sistema. Cuando el <varname>filename</varname> el parámetro es absoluto <varname>dirfd</varname> se ignora pero cuando la ruta al archivo es relativa, se trata de la obra. los <varname>dirfd</varname> El parámetro es un directorio relativo al que se comprueba la ruta relativa. los <varname>dirfd</varname> parámetro es un descriptor de archivo de algún directorio o <literal>AT_FDCWD</literal>. Entonces, por ejemplo, el <function>openat</function> syscall puede ser así:

source: This infrastructure is necessary to avoid races when opening files outside the working directory. Imagine that a process consists of two threads, thread A and thread B. Thread A issues <literal>open(./tmp/foo/bah., flags, mode)</literal> and before returning it gets preempted and thread B runs. Thread B does not care about the needs of thread A and renames or removes <filename>/tmp/foo/</filename>. We got a race. To avoid this we can open <filename>/tmp/foo</filename> and use it as <varname>dirfd</varname> for <function>openat</function> syscall. This also enables user to implement per-thread working directories.
es_es: Esta infraestructura es necesaria para evitar carreras al abrir archivos fuera del directorio de trabajo. Imagine que un proceso consta de dos subprocesos, el subproceso A y el subproceso B. Problemas del subproceso A <literal>abrir(./tmp/foo/bah., flags, mode)</literal> y antes de regresar se reemplaza y se ejecuta el hilo B. El hilo B no se preocupa por las necesidades del hilo A y cambia el nombre o elimina<filename>/tmp/foo/</filename>. Tenemos una carrera. Para evitar esto podemos abrir <filename>/tmp/foo</filename> and use it as <varname>dirfd</varname>para <function>openat</function>syscall. Esto también permite al usuario implementar directorios de trabajo por subproceso.

source: <trademark class="registered">Linux</trademark> family of *at syscalls contains: <function>linux_openat</function>, <function>linux_mkdirat</function>, <function>linux_mknodat</function>, <function>linux_fchownat</function>, <function>linux_futimesat</function>, <function>linux_fstatat64</function>, <function>linux_unlinkat</function>, <function>linux_renameat</function>, <function>linux_linkat</function>, <function>linux_symlinkat</function>, <function>linux_readlinkat</function>, <function>linux_fchmodat</function> and <function>linux_faccessat</function>. All these are implemented using the modified <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> routine and simple wrapping layer.
es_es: <trademark class="registered">Linux</trademark> familia de *at syscalls contiene: <function>linux_openat</function>, <function>linux_mkdirat</function>, <function>linux_mknodat</function>, <function>linux_fchownat</function>, <function>linux_futimesat</function>, <function>linux_fstatat64</function>, <function>linux_unlinkat</function>, <function>linux_renameat</function>, <function>linux_linkat</function>, <function>linux_symlinkat</function>, <function>linux_readlinkat</function>, <function>linux_fchmodat</function> and <function>linux_faccessat</function>. Todos estos se implementan utilizando el modificado <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> capa de envoltura rutinaria y simple.

source: Implementation
es_es: Implementación

source: The implementation is done by altering the <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> routine (described above) to take additional parameter <varname>dirfd</varname> in its <literal>nameidata</literal> structure, which specifies the starting point of the pathname lookup instead of using the current working directory every time. The resolution of <varname>dirfd</varname> from file descriptor number to a vnode is done in native *at syscalls. When <varname>dirfd</varname> is <literal>AT_FDCWD</literal> the <varname>dvp</varname> entry in <literal>nameidata</literal> structure is <literal>NULL</literal> but when <varname>dirfd</varname> is a different number we obtain a file for this file descriptor, check whether this file is valid and if there is vnode attached to it then we get a vnode. Then we check this vnode for being a directory. In the actual <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> routine we simply substitute the <varname>dvp</varname> vnode for <varname>dp</varname> variable in the <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> function, which determines the starting point. The <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> is not used directly but via a trace of different functions on various levels. For example the <function>openat</function> goes like this:
es_es: La implementación se realiza alterando el <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> rutina (descrita arriba) para tomar un parámetro adicional <varname>dirfd</varname> en su <literal>nameidata</literal>estructura, que especifica el punto de inicio de la búsqueda de nombre de ruta en lugar de utilizar el directorio de trabajo actual cada vez. La resolución de <varname>dirfd</varname> desde el número de descriptor de archivo hasta un vnode se realiza en nativo *en syscalls. Cuando <varname>dirfd</varname> is <literal>AT_FDCWD</literal> el <varname>dvp</varname> entrada en <literal>nameidata</literal> la estructura es <literal>NULL</literal> pero cuando <varname>dirfd</varname> es un número diferente, obtenemos un archivo para este descriptor de archivo, verificamos si este archivo es válido y si hay un vnode adjunto, obtenemos un vnode. Luego verificamos que este vnode sea un directorio. En el actual <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> rutina simplemente sustituimos el <varname>dvp</varname> vnode para <varname>dp</varname> variable en el <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> función, que determina el punto de partida. los <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> no se utiliza directamente, sino a través de un rastro de diferentes funciones en varios niveles. Por ejemplo el <function>openat</function> va así:

source: For this reason <function>kern_open</function> and <function>vn_open</function> must be altered to incorporate the additional <varname>dirfd</varname> parameter. No compat layer is created for those because there are not many users of this and the users can be easily converted. This general implementation enables FreeBSD to implement their own *at syscalls. This is being discussed right now.
es_es: Por esta razón <function>kern_open</function> y <function>vn_open</function> debe modificarse para incorporar el adicional <varname>dirfd</varname> parámetro. No se crea una capa de compatibilidad para aquellos porque no hay muchos usuarios de esta y los usuarios se pueden convertir fácilmente. Esta implementación general permite a FreeBSD implementar su propio *en llamadas al sistema. Esto se está discutiendo ahora mismo.
