Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: <trademark class="registered">Linux</trademark>-emulation of <trademark class="registered">Linux</trademark> operating system on FreeBSD
es_es: <trademark class="registered">Linux</trademark>emulación de<trademark class="registered">Linux</trademark>sistema operativo en FreeBSD

source: NDIS-emulation of Windows networking drivers interface
es_es: Emulación NDIS de la interfaz de controladores de red de Windows

source: NetBSD-emulation of NetBSD operating system
es_es: Emulación NetBSD del sistema operativo NetBSD

source: PECoff-support for PECoff FreeBSD executables
es_es: Soporte PECoff para ejecutables PECoff FreeBSD

source: SVR4-emulation of System V revision 4 <trademark class="registered">UNIX</trademark>
es_es: Emulación SVR4 de System V revisión 4<trademark class="registered">UNIX</trademark>

source: Actively developed emulations are the <trademark class="registered">Linux</trademark> layer and various FreeBSD-on-FreeBSD layers. Others are not supposed to work properly nor be usable these days.
es_es: Las emulaciones desarrolladas activamente son las<trademark class="registered">Linux</trademark>layer y varias capas FreeBSD-on-FreeBSD. Se supone que otros no funcionan correctamente ni se pueden utilizar en estos días.

source: FreeBSD is traditional flavor of <trademark class="registered">UNIX</trademark> in the sense of dividing the run of processes into two halves: kernel space and user space run. There are two types of process entry to the kernel: a syscall and a trap. There is only one way to return. In the subsequent sections we will describe the three gates to/from the kernel. The whole description applies to the i386 architecture as the Linuxulator only exists there but the concept is similar on other architectures. The information was taken from [1] and the source code.
es_es: FreeBSD es el sabor tradicional de<trademark class="registered">UNIX</trademark>en el sentido de dividir la ejecución de procesos en dos mitades: espacio de kernel y ejecución de espacio de usuario. Hay dos tipos de entrada de proceso al kernel: una llamada al sistema y una trampa. Solo hay una forma de regresar. En las secciones siguientes describiremos las tres puertas hacia / desde el kernel. La descripción completa se aplica a la arquitectura i386 ya que el Linuxulator solo existe allí, pero el concepto es similar en otras arquitecturas. La información se tomó de [1] y el código fuente.

source: System entries
es_es: Entradas del sistema

source: FreeBSD has an abstraction called an execution class loader, which is a wedge into the <citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall. This employs a structure <literal>sysentvec</literal>, which describes an executable ABI. It contains things like errno translation table, signal translation table, various functions to serve syscall needs (stack fixup, coredumping, etc.). Every ABI the FreeBSD kernel wants to support must define this structure, as it is used later in the syscall processing code and at some other places. System entries are handled by trap handlers, where we can access both the kernel-space and the user-space at once.
es_es: FreeBSD tiene una abstracción llamada cargador de clases de ejecución, que es una cuña en el<citerefentry><refentrytitle>execve</refentrytitle><manvolnum>2</manvolnum></citerefentry>syscall. Esto emplea una estructura<literal>sysentvec</literal>que describe una ABI ejecutable. Contiene cosas como tabla de traducción de errno, tabla de traducción de señales, varias funciones para satisfacer las necesidades de llamadas al sistema (reparación de pila, volcado de núcleos, etc.). Cada ABI que el kernel de FreeBSD desee admitir debe definir esta estructura, ya que se usa más adelante en el código de procesamiento de llamadas al sistema y en otros lugares. Las entradas del sistema son manejadas por controladores de trampas, donde podemos acceder tanto al espacio del núcleo como al espacio del usuario a la vez.

source: Syscalls
es_es: llamadas al sistema

source: Syscalls on FreeBSD are issued by executing interrupt <literal>0x80</literal> with register <varname>%eax</varname> set to a desired syscall number with arguments passed on the stack.
es_es: Las llamadas al sistema en FreeBSD se emiten ejecutando interrupt<literal>0x80</literal>con registro<varname>%eax</varname>establecido en un número de llamada al sistema deseado con argumentos pasados en la pila.

source: When a process issues an interrupt <literal>0x80</literal>, the <literal>int0x80</literal> syscall trap handler is issued (defined in <filename>sys/i386/i386/exception.s</filename>), which prepares arguments (i.e. copies them on to the stack) for a call to a C function <citerefentry><refentrytitle>syscall</refentrytitle><manvolnum>2</manvolnum></citerefentry> (defined in <filename>sys/i386/i386/trap.c</filename>), which processes the passed in trapframe. The processing consists of preparing the syscall (depending on the <literal>sysvec</literal> entry), determining if the syscall is 32-bit or 64-bit one (changes size of the parameters), then the parameters are copied, including the syscall. Next, the actual syscall function is executed with processing of the return code (special cases for <literal>ERESTART</literal> and <literal>EJUSTRETURN</literal> errors). Finally an <literal>userret()</literal> is scheduled, switching the process back to the users-pace. The parameters to the actual syscall handler are passed in the form of <literal>struct thread *td</literal>, <literal>struct syscall args *</literal> arguments where the second parameter is a pointer to the copied in structure of parameters.
es_es: Cuando un proceso emite una interrupción <literal>0x80</literal>, el <literal>int0x80</literal>Se emite el controlador de capturas syscall (definido en <filename>sys/i386/i386/exception.s</filename>), que prepara argumentos (es decir, los copia en la pila) para una llamada a una función C <citerefentry><refentrytitle>syscall</refentrytitle><manvolnum>2</manvolnum></citerefentry> (definido en <filename>sys/i386/i386/trap.c</filename>), que procesa el pasado en trampilla. El procesamiento consiste en preparar el syscall (dependiendo del <literal>sysvec</literal> entrada), Al determinar si la llamada al sistema es de 32 bits o de 64 bits (cambia el tamaño de los parámetros), los parámetros se copian, incluida la llamada al sistema. A continuación, la función syscall real se ejecuta con el procesamiento del código de retorno (casos especiales para <literal>ERESTART</literal> y <literal>EJUSTRETURN</literal> errores). Finalmente un <literal>userret()</literal> está programado, cambiando el proceso de nuevo al ritmo de los usuarios. Los parámetros del controlador de llamada al sistema real se pasan en forma de<literal>struct thread *td</literal>, <literal>struct syscall args *</literal> argumentos donde el segundo parámetro es un puntero a la estructura de parámetros copiada.

source: Traps
es_es: trampas

source: Handling of traps in FreeBSD is similar to the handling of syscalls. Whenever a trap occurs, an assembler handler is called. It is chosen between alltraps, alltraps with regs pushed or calltrap depending on the type of the trap. This handler prepares arguments for a call to a C function <literal>trap()</literal> (defined in <filename>sys/i386/i386/trap.c</filename>), which then processes the occurred trap. After the processing it might send a signal to the process and/or exit to userland using <literal>userret()</literal>.
es_es: El manejo de trampas en FreeBSD es similar al manejo de llamadas al sistema. Siempre que ocurre una trampa, se llama a un manejador de ensamblador. Se elige entre todas las trampas, todas las trampas con regs presionadas o trampa de llamadas dependiendo del tipo de trampa. Este controlador prepara argumentos para una llamada a una función C<literal>trap()</literal>(definido en<filename>sys/i386/i386/trap.c</filename>, que luego procesa la trampa ocurrida. Después del procesamiento, puede enviar una señal al proceso y / o salir al área de usuario usando<literal>userret()</literal>.

source: Exits
es_es: Salida

source: Exits from kernel to userspace happen using the assembler routine <literal>doreti</literal> regardless of whether the kernel was entered via a trap or via a syscall. This restores the program status from the stack and returns to the userspace.
es_es: Las salidas del kernel al espacio de usuario ocurren usando la rutina del ensamblador<literal>doreti</literal>independientemente de si se ingresó al kernel mediante una trampa o mediante una llamada al sistema. Esto restaura el estado del programa de la pila y vuelve al espacio de usuario.

source: <trademark class="registered">UNIX</trademark> primitives
es_es: <trademark class="registered">UNIX</trademark>primitivos

source: FreeBSD operating system adheres to the traditional <trademark class="registered">UNIX</trademark> scheme, where every process has a unique identification number, the so called <firstterm>PID</firstterm> (Process ID). PID numbers are allocated either linearly or randomly ranging from <literal>0</literal> to <literal>PID_MAX</literal>. The allocation of PID numbers is done using linear searching of PID space. Every thread in a process receives the same PID number as result of the <citerefentry><refentrytitle>getpid</refentrytitle><manvolnum>2</manvolnum></citerefentry> call.
es_es: El sistema operativo FreeBSD se adhiere al tradicional <trademark class="registered">UNIX</trademark> esquema, donde cada proceso tiene un número de identificación único, el llamado <firstterm>PID</firstterm> (Identificacion de proceso). Los números PID se asignan de forma lineal o aleatoria desde <literal>0</literal> a <literal>PID_MAX</literal>. La asignación de números PID se realiza mediante una búsqueda lineal del espacio PID. Cada hilo en un proceso recibe el mismo número PID como resultado de la <citerefentry><refentrytitle>getpid</refentrytitle><manvolnum>2</manvolnum></citerefentry> llamada.

source: As stated previously there are two implementations of threading in FreeBSD. The M:N library divides the work between kernel space and userspace. Thread is an entity that gets scheduled in the kernel but it can represent various number of userspace threads. M userspace threads get mapped to N kernel threads thus saving resources while keeping the ability to exploit multiprocessor parallelism. Further information about the implementation can be obtained from the man page or [1]. The 1:1 library directly maps a userland thread to a kernel thread thus greatly simplifying the scheme. None of these designs implement a fairness mechanism (such a mechanism was implemented but it was removed recently because it caused serious slowdown and made the code more difficult to deal with).
es_es: Como se indicó anteriormente, hay dos implementaciones de subprocesamiento en FreeBSD. La biblioteca M: N divide el trabajo entre el espacio del kernel y el espacio de usuario. Thread es una entidad que se programa en el kernel, pero puede representar varios subprocesos del espacio de usuario. Los subprocesos del espacio de usuario M se asignan a los subprocesos del núcleo N, lo que ahorra recursos y mantiene la capacidad de explotar el paralelismo de multiprocesador. Se puede obtener más información sobre la implementación en la página del manual o en [1]. La biblioteca 1: 1 mapea directamente un subproceso de usuario a un subproceso del kernel, lo que simplifica enormemente el esquema. Ninguno de estos diseños implementa un mecanismo de equidad (se implementó un mecanismo de este tipo, pero se eliminó recientemente porque causaba una grave desaceleración y hacía que el código fuera más difícil de manejar).

source: What is <trademark class="registered">Linux</trademark>
es_es: Que es <trademark class="registered">Linux</trademark>

source: <trademark class="registered">Linux</trademark> is a <trademark class="registered">UNIX</trademark>-like kernel originally developed by Linus Torvalds, and now being contributed to by a massive crowd of programmers all around the world. From its mere beginnings to today, with wide support from companies such as IBM or Google, <trademark class="registered">Linux</trademark> is being associated with its fast development pace, full hardware support and benevolent dictator model of organization.
es_es: <trademark class="registered">Linux</trademark> es una <trademark class="registered">UNIX</trademark>como el kernel desarrollado originalmente por Linus Torvalds, y al que ahora contribuyen una multitud masiva de programadores de todo el mundo. Desde sus meros inicios hasta hoy, con un amplio apoyo de empresas como IBM o Google, <trademark class="registered">Linux</trademark>se asocia con su rápido ritmo de desarrollo, soporte completo de hardware y modelo de organización de dictador benevolente.

source: <trademark class="registered">Linux</trademark> development started in 1991 as a hobbyist project at University of Helsinki in Finland. Since then it has obtained all the features of a modern <trademark class="registered">UNIX</trademark>-like OS: multiprocessing, multiuser support, virtual memory, networking, basically everything is there. There are also highly advanced features like virtualization etc.
es_es: <trademark class="registered">Linux</trademark>El desarrollo comenzó en 1991 como un proyecto de aficionados en la Universidad de Helsinki en Finlandia. Desde entonces ha obtenido todas las características de un moderno<trademark class="registered">UNIX</trademark>como SO: multiprocesamiento, soporte multiusuario, memoria virtual, redes, básicamente todo está ahí. También hay funciones muy avanzadas como virtualización, etc.

source: As of 2006 <trademark class="registered">Linux</trademark> seems to be the most widely used open source operating system with support from independent software vendors like Oracle, RealNetworks, Adobe, etc. Most of the commercial software distributed for <trademark class="registered">Linux</trademark> can only be obtained in a binary form so recompilation for other operating systems is impossible.
es_es: Desde 2006 <trademark class="registered">Linux</trademark>parece ser el sistema operativo de código abierto más utilizado con el apoyo de proveedores de software independientes como Oracle, RealNetworks, Adobe, etc. La mayor parte del software comercial distribuido para<trademark class="registered">Linux</trademark>solo se puede obtener en forma binaria, por lo que la recopilación para otros sistemas operativos es imposible.

source: Most of the <trademark class="registered">Linux</trademark> development happens in a <application>Git</application> version control system. <application>Git</application> is a distributed system so there is no central source of the <trademark class="registered">Linux</trademark> code, but some branches are considered prominent and official. The version number scheme implemented by <trademark class="registered">Linux</trademark> consists of four numbers A.B.C.D. Currently development happens in 2.6.C.D, where C represents major version, where new features are added or changed while D is a minor version for bugfixes only.
es_es: La mayoría de los <trademark class="registered">Linux</trademark> el desarrollo ocurre en un <application>Git</application> sistema de control de versiones.<application>Git</application> es un sistema distribuido, por lo que no hay una fuente central de <trademark class="registered">Linux</trademark>código, pero algunas ramas se consideran prominentes y oficiales. El esquema de número de versión implementado por <trademark class="registered">Linux</trademark> consta de cuatro números A.B.C.D. Actualmente, el desarrollo ocurre en 2.6.C.D, donde C representa la versión principal, donde se agregan o cambian nuevas características, mientras que D es una versión secundaria solo para corrección de errores.

source: More information can be obtained from [3].
es_es: Se puede obtener más información en [3].

source: <trademark class="registered">Linux</trademark> follows the traditional <trademark class="registered">UNIX</trademark> scheme of dividing the run of a process in two halves: the kernel and user space. The kernel can be entered in two ways: via a trap or via a syscall. The return is handled only in one way. The further description applies to <trademark class="registered">Linux</trademark> 2.6 on the <trademark>i386</trademark> architecture. This information was taken from [2].
es_es: <trademark class="registered">Linux</trademark>Sigue lo tradicional<trademark class="registered">UNIX</trademark> esquema de dividir la ejecución de un proceso en dos mitades: el kernel y el espacio de usuario. El kernel se puede ingresar de dos maneras: a través de una trampa o mediante una llamada al sistema. La devolución se gestiona de una sola forma. La descripción adicional se aplica a<trademark class="registered">Linux</trademark> 2.6 sobre el<trademark>i386</trademark> arquitectura. Esta información se tomó de [2].

source: Syscalls in <trademark class="registered">Linux</trademark> are performed (in userspace) using <literal>syscallX</literal> macros where X substitutes a number representing the number of parameters of the given syscall. This macro translates to a code that loads <varname>%eax</varname> register with a number of the syscall and executes interrupt <literal>0x80</literal>. After this syscall return is called, which translates negative return values to positive <literal>errno</literal> values and sets <literal>res</literal> to <literal>-1</literal> in case of an error. Whenever the interrupt <literal>0x80</literal> is called the process enters the kernel in system call trap handler. This routine saves all registers on the stack and calls the selected syscall entry. Note that the <trademark class="registered">Linux</trademark> calling convention expects parameters to the syscall to be passed via registers as shown here:
es_es: Syscalls en <trademark class="registered">Linux</trademark> se realizan (en el espacio de usuario) usando <literal>syscallX</literal> macros donde X sustituye a un número que representa el número de parámetros de la llamada al sistema dada. Esta macro se traduce en un código que se carga <varname>%eax</varname> registrarse con un número de syscall y ejecutar interrumpir <literal>0x80</literal>. Después de que se llame a este retorno de llamada al sistema, que traduce los valores de retorno negativos en positivos<literal>errno</literal> valores y conjuntos <literal>res</literal> a <literal>-1</literal> en caso de un error. Siempre que la interrupción <literal>0x80</literal>se llama el proceso ingresa al kernel en el controlador de trampas de llamadas del sistema. Esta rutina guarda todos los registros en la pila y llama a la entrada de llamada al sistema seleccionada. Tenga en cuenta que el <trademark class="registered">Linux</trademark> la convención de llamada espera que los parámetros a la llamada al sistema se pasen a través de registros como se muestra aquí:

source: parameter -&gt; <varname>%ebx</varname>
es_es: parámetro -&gt; <varname>%ebx</varname>

source: parameter -&gt; <varname>%ecx</varname>
es_es: parámetro -&gt; <varname>%ecx</varname>

source: parameter -&gt; <varname>%edx</varname>
es_es: parámetro -&gt; <varname>%edx</varname>

source: parameter -&gt; <varname>%esi</varname>
es_es: parámetro -&gt; <varname>%esi</varname>

source: parameter -&gt; <varname>%edi</varname>
es_es: parámetro -&gt; <varname>%edi</varname>

source: parameter -&gt; <varname>%ebp</varname>
es_es: parámetro -&gt; <varname>%ebp</varname>

source: There are some exceptions to this, where <trademark class="registered">Linux</trademark> uses different calling convention (most notably the <literal>clone</literal> syscall).
es_es: Hay algunas excepciones a esto, donde <trademark class="registered">Linux</trademark> utiliza una convención de llamada diferente (más notablemente la <literal>clone</literal> syscall).

source: The trap handlers are introduced in <filename>arch/i386/kernel/traps.c</filename> and most of these handlers live in <filename>arch/i386/kernel/entry.S</filename>, where handling of the traps happens.
es_es: Los manipuladores de trampas se introducen en <filename>arch/i386/kernel/traps.c</filename>y la mayoría de estos manipuladores viven en <filename>arch/i386/kernel/entry.S</filename>, donde ocurre el manejo de las trampas.

source: Return from the syscall is managed by syscall <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>3</manvolnum></citerefentry>, which checks for the process having unfinished work, then checks whether we used user-supplied selectors. If this happens stack fixing is applied and finally the registers are restored from the stack and the process returns to the userspace.
es_es: El retorno del syscall es administrado por syscall <citerefentry><refentrytitle>exit</refentrytitle><manvolnum>3</manvolnum></citerefentry>, que verifica si el proceso tiene trabajo sin terminar, luego verifica si usamos selectores proporcionados por el usuario. Si esto sucede, se aplica la corrección de la pila y finalmente se restauran los registros de la pila y el proceso vuelve al espacio de usuario.

source: In the 2.6 version, the <trademark class="registered">Linux</trademark> operating system redefined some of the traditional <trademark class="registered">UNIX</trademark> primitives, notably PID, TID and thread. PID is defined not to be unique for every process, so for some processes (threads) <citerefentry><refentrytitle>getppid</refentrytitle><manvolnum>2</manvolnum></citerefentry> returns the same value. Unique identification of process is provided by TID. This is because <firstterm>NPTL</firstterm> (New <trademark class="registered">POSIX</trademark> Thread Library) defines threads to be normal processes (so called 1:1 threading). Spawning a new process in <trademark class="registered">Linux</trademark> 2.6 happens using the <literal>clone</literal> syscall (fork variants are reimplemented using it). This clone syscall defines a set of flags that affect behavior of the cloning process regarding thread implementation. The semantic is a bit fuzzy as there is no single flag telling the syscall to create a thread.
es_es: En la versión 2.6, el <trademark class="registered">Linux</trademark> sistema operativo redefinió algunos de los tradicionales <trademark class="registered">UNIX</trademark> primitivas, en particular PID, TID e hilo. PID se define para no ser único para cada proceso, por lo que para algunos procesos (subprocesos) <citerefentry><refentrytitle>getppid</refentrytitle><manvolnum>2</manvolnum></citerefentry> devuelve el mismo valor. TID proporciona la identificación única del proceso. Esto es porque <firstterm>NPTL</firstterm> (New <trademark class="registered">POSIX</trademark> Thread Library) define los subprocesos como procesos normales (llamados subprocesos 1: 1). Generando un nuevo proceso en <trademark class="registered">Linux</trademark> 2.6 sucede usando el <literal>clone</literal> syscall (las variantes de la bifurcación se vuelven a implementar usándolo). Esta llamada al sistema de clonación define un conjunto de indicadores que afectan el comportamiento del proceso de clonación con respecto a la implementación del hilo. La semántica es un poco difusa ya que no hay una sola bandera que le diga al syscall que cree un hilo.

source: Implemented clone flags are:
es_es: Las banderas de clonación implementadas son:

source: <literal>CLONE_VM</literal> - processes share their memory space
es_es: <literal>CLONE_VM</literal> - los procesos comparten su espacio de memoria

source: <literal>CLONE_FS</literal> - share umask, cwd and namespace
es_es: <literal>CLONE_FS</literal> - compartir umask, cwd y espacio de nombres
