Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: Atomic operations are implemented through a set of functions performing simple arithmetics on memory operands in an atomic way with respect to external events (interrupts, preemption, etc.). Atomic operations can guarantee atomicity just on small data types (in the magnitude order of the <literal>.long.</literal> architecture C data type), so should be rarely used directly in the end-level code, if not only for very simple operations (like flag setting in a bitmap, for example). In fact, it is rather simple and common to write down a wrong semantic based on just atomic operations (usually referred as lock-less). The FreeBSD kernel offers a way to perform atomic operations in conjunction with a memory barrier. The memory barriers will guarantee that an atomic operation will happen following some specified ordering with respect to other memory accesses. For example, if we need that an atomic operation happen just after all other pending writes (in terms of instructions reordering buffers activities) are completed, we need to explicitly use a memory barrier in conjunction to this atomic operation. So it is simple to understand why memory barriers play a key role for higher-level locks building (just as refcounts, mutexes, etc.). For a detailed explanatory on atomic operations, please refer to <citerefentry><refentrytitle>atomic</refentrytitle><manvolnum>9</manvolnum></citerefentry>. It is far, however, noting that atomic operations (and memory barriers as well) should ideally only be used for building front-ending locks (as mutexes).
es_es: Las operaciones atómicas se implementan a través de un conjunto de funciones que realizan aritmética simple sobre operandos de memoria de forma atómica con respecto a eventos externos (interrupciones, apropiación, etc.). Las operaciones atómicas pueden garantizar la atomicidad solo en tipos de datos pequeños (en el orden de magnitud del <literal>.long.</literal>tipo de datos de arquitectura C), por lo que rara vez se debe usar directamente en el código de nivel final, si no solo para operaciones muy simples (como la configuración de banderas en un mapa de bits, por ejemplo). De hecho, es bastante simple y común escribir una semántica incorrecta basada solo en operaciones atómicas (generalmente referidas como sin bloqueo). El kernel de FreeBSD ofrece una forma de realizar operaciones atómicas junto con una barrera de memoria. Las barreras de memoria garantizarán que ocurra una operación atómica siguiendo un orden específico con respecto a otros accesos a la memoria. Por ejemplo, si necesitamos que ocurra una operación atómica justo después de que se completen todas las demás escrituras pendientes (en términos de instrucciones que reordenan las actividades de búfer), necesitamos usar explícitamente una barrera de memoria junto con esta operación atómica. Por lo tanto, es sencillo entender por qué las barreras de memoria juegan un papel clave para la construcción de bloqueos de nivel superior (como refcounts, mutexes, etc.). Para obtener una explicación detallada sobre las operaciones atómicas, consulte <citerefentry><refentrytitle>atomic</refentrytitle><manvolnum>9</manvolnum></citerefentry>. Sin embargo, está lejos de señalar que las operaciones atómicas (y las barreras de memoria también) deberían idealmente usarse solo para construir bloqueos frontales (como mutex).

source: Refcounts
es_es: Recuentos

source: Refcounts are interfaces for handling reference counters. They are implemented through atomic operations and are intended to be used just for cases, where the reference counter is the only one thing to be protected, so even something like a spin-mutex is deprecated. Using the refcount interface for structures, where a mutex is already used is often wrong since we should probably close the reference counter in some already protected paths. A manpage discussing refcount does not exist currently, just check <filename>sys/refcount.h</filename> for an overview of the existing API.
es_es: Los refcounts son interfaces para manejar contadores de referencia. Se implementan a través de operaciones atómicas y están destinadas a usarse solo en casos, donde el contador de referencia es lo único que debe protegerse, por lo que incluso algo como un spin-mutex está en desuso. El uso de la interfaz refcount para estructuras, donde ya se usa un mutex, a menudo es incorrecto, ya que probablemente deberíamos cerrar el contador de referencia en algunas rutas ya protegidas. Actualmente no existe una página de manual que discuta refcount, solo verifique <filename>sys/refcount.h</filename> para obtener una descripción general de la API existente.

source: Locks
es_es: Cerraduras

source: FreeBSD kernel has huge classes of locks. Every lock is defined by some peculiar properties, but probably the most important is the event linked to contesting holders (or in other terms, the behavior of threads unable to acquire the lock). FreeBSD's locking scheme presents three different behaviors for contenders:
es_es: El kernel de FreeBSD tiene enormes clases de bloqueos. Cada bloqueo está definido por algunas propiedades peculiares, pero probablemente la más importante es el evento vinculado a los titulares de la competencia (o en otros términos, el comportamiento de los hilos que no pueden adquirir el bloqueo). El esquema de bloqueo de FreeBSD presenta tres comportamientos diferentes para los contendientes:

source: spinning
es_es: hilado

source: blocking
es_es: bloqueo

source: sleeping
es_es: dormir

source: numbers are not casual
es_es: los números no son casuales

source: Spinning locks
es_es: Cerraduras giratorias

source: Spin locks let waiters to spin until they cannot acquire the lock. An important matter do deal with is when a thread contests on a spin lock if it is not descheduled. Since the FreeBSD kernel is preemptive, this exposes spin lock at the risk of deadlocks that can be solved just disabling interrupts while they are acquired. For this and other reasons (like lack of priority propagation support, poorness in load balancing schemes between CPUs, etc.), spin locks are intended to protect very small paths of code, or ideally not to be used at all if not explicitly requested (explained later).
es_es: Las cerraduras giratorias permiten a los camareros girar hasta que no pueden adquirir la cerradura. Un asunto importante con el que se trata es cuando un hilo compite en un bloqueo de giro si no está programado. Dado que el kernel de FreeBSD es preventivo, esto expone el bloqueo de giro al riesgo de interbloqueos que pueden resolverse simplemente deshabilitando las interrupciones mientras se adquieren. Por esta y otras razones (como la falta de soporte de propagación de prioridad, deficiencias en los esquemas de equilibrio de carga entre las CPU, etc.), los bloqueos de giro están destinados a proteger rutas de código muy pequeñas o, idealmente, no deben usarse en absoluto si no se solicitan explícitamente ( explicado más adelante).

source: Blocking
es_es: Bloqueo

source: Block locks let waiters to be descheduled and blocked until the lock owner does not drop it and wakes up one or more contenders. In order to avoid starvation issues, blocking locks do priority propagation from the waiters to the owner. Block locks must be implemented through the turnstile interface and are intended to be the most used kind of locks in the kernel, if no particular conditions are met.
es_es: Las cerraduras de bloque permiten que los camareros sean desprogramados y bloqueados hasta que el propietario de la cerradura no la deje caer y despierte a uno o más contendientes. Para evitar problemas de inanición, las cerraduras de bloqueo se propagan prioritariamente de los camareros al propietario. Los bloqueos de bloqueo deben implementarse a través de la interfaz del torniquete y están destinados a ser el tipo de bloqueo más utilizado en el núcleo, si no se cumplen condiciones particulares.

source: Sleeping
es_es: Dormir

source: Sleep locks let waiters to be descheduled and fall asleep until the lock holder does not drop it and wakes up one or more waiters. Since sleep locks are intended to protect large paths of code and to cater asynchronous events, they do not do any form of priority propagation. They must be implemented through the <citerefentry><refentrytitle>sleepqueue</refentrytitle><manvolnum>9</manvolnum></citerefentry> interface.
es_es: Las cerraduras para dormir permiten que los camareros se desagreguen y se duerman hasta que el soporte de la cerradura no se caiga y despierte a uno o más camareros. Dado que los bloqueos de suspensión están destinados a proteger grandes rutas de código y atender eventos asincrónicos, no realizan ningún tipo de propagación de prioridad. Deben implementarse a través del <citerefentry><refentrytitle>sleepqueue</refentrytitle><manvolnum>9</manvolnum></citerefentry> interfaz.

source: The order used to acquire locks is very important, not only for the possibility to deadlock due at lock order reversals, but even because lock acquisition should follow specific rules linked to locks natures. If you give a look at the table above, the practical rule is that if a thread holds a lock of level n (where the level is the number listed close to the kind of lock) it is not allowed to acquire a lock of superior levels, since this would break the specified semantic for a path. For example, if a thread holds a block lock (level 2), it is allowed to acquire a spin lock (level 1) but not a sleep lock (level 3), since block locks are intended to protect smaller paths than sleep lock (these rules are not about atomic operations or scheduling barriers, however).
es_es: El orden utilizado para adquirir cerraduras es muy importante, no solo por la posibilidad de interbloqueo debido a las inversiones de orden de cerradura, sino incluso porque la adquisición de cerraduras debe seguir reglas específicas vinculadas a la naturaleza de las cerraduras. Si echa un vistazo a la tabla de arriba, la regla práctica es que si un hilo tiene un candado de nivel n (donde el nivel es el número listado cerca del tipo de candado) no está permitido adquirir un candado de niveles superiores , ya que esto rompería la semántica especificada para una ruta. Por ejemplo, si un hilo tiene un bloqueo de bloqueo (nivel 2), se le permite adquirir un bloqueo de giro (nivel 1) pero no un bloqueo de suspensión (nivel 3), ya que los bloqueos de bloqueo están destinados a proteger rutas más pequeñas que el bloqueo de suspensión ( Sin embargo, estas reglas no se refieren a operaciones atómicas o barreras de programación).

source: This is a list of lock with their respective behaviors:
es_es: Esta es una lista de bloqueo con sus respectivos comportamientos:

source: sleep family - sleeping - <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> pause tsleep msleep msleep spin msleep rw msleep sx
es_es: dormir familia - dormir - <citerefentry><refentrytitle>sleep</refentrytitle><manvolnum>9</manvolnum></citerefentry> pause tsleep msleep msleep spin msleep rw msleep sx

source: rwlock - blocking - <citerefentry><refentrytitle>rwlock</refentrytitle><manvolnum>9</manvolnum></citerefentry>
es_es: rwlock - bloqueo - <citerefentry><refentrytitle>rwlock</refentrytitle><manvolnum>9</manvolnum></citerefentry>

source: Among these locks only mutexes, sxlocks, rwlocks and lockmgrs are intended to handle recursion, but currently recursion is only supported by mutexes and lockmgrs.
es_es: Entre estos bloqueos, solo los mutex, sxlocks, rwlocks y lockmgrs están destinados a manejar la recursividad, pero actualmente la recursividad solo es compatible con mutexes y lockmgrs.

source: Scheduling barriers
es_es: Barreras de programación

source: Scheduling barriers are intended to be used in order to drive scheduling of threading. They consist mainly of three different stubs:
es_es: Las barreras de programación están destinadas a utilizarse para impulsar la programación del enhebrado. Consisten principalmente en tres stubs diferentes:

source: critical sections (and preemption)
es_es: secciones críticas (y preferencia)

source: Generally, these should be used only in a particular context and even if they can often replace locks, they should be avoided because they do not let the diagnose of simple eventual problems with locking debugging tools (as <citerefentry><refentrytitle>witness</refentrytitle><manvolnum>4</manvolnum></citerefentry>).
es_es: Generalmente, estos deben usarse solo en un contexto particular e incluso si a menudo pueden reemplazar bloqueos, deben evitarse porque no permiten el diagnóstico de problemas eventuales simples con herramientas de depuración de bloqueo (como <citerefentry><refentrytitle>testigo</refentrytitle><manvolnum>4</manvolnum></citerefentry>).

source: Critical sections
es_es: Secciones críticas

source: The FreeBSD kernel has been made preemptive basically to deal with interrupt threads. In fact, in order to avoid high interrupt latency, time-sharing priority threads can be preempted by interrupt threads (in this way, they do not need to wait to be scheduled as the normal path previews). Preemption, however, introduces new racing points that need to be handled, as well. Often, in order to deal with preemption, the simplest thing to do is to completely disable it. A critical section defines a piece of code (borderlined by the pair of functions <citerefentry><refentrytitle>critical_enter</refentrytitle><manvolnum>9</manvolnum></citerefentry> and <citerefentry><refentrytitle>critical_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>, where preemption is guaranteed to not happen (until the protected code is fully executed). This can often replace a lock effectively but should be used carefully in order to not lose the whole advantage that preemption brings.
es_es: El kernel de FreeBSD se ha hecho preventivo básicamente para tratar con hilos de interrupción. De hecho, para evitar una latencia de interrupción alta, los subprocesos de prioridad de tiempo compartido pueden ser reemplazados por subprocesos de interrupción (de esta manera, no necesitan esperar para ser programados como vistas previas de la ruta normal). La preferencia, sin embargo, introduce nuevos puntos de carrera que también deben manejarse. A menudo, para hacer frente a la preferencia, lo más sencillo es desactivarla por completo. Una sección crítica define un fragmento de código (delimitado por el par de funciones <citerefentry><refentrytitle>critical_enter</refentrytitle><manvolnum>9</manvolnum></citerefentry> y <citerefentry><refentrytitle>critical_exit</refentrytitle><manvolnum>9</manvolnum></citerefentry>, donde se garantiza que la preferencia no ocurrirá (hasta que el código protegido se ejecute por completo). Esto a menudo puede reemplazar un candado de manera efectiva, pero debe usarse con cuidado para no perder toda la ventaja que brinda la preferencia.

source: Another way to deal with preemption is the <function>sched_pin()</function> interface. If a piece of code is closed in the <function>sched_pin()</function> and <function>sched_unpin()</function> pair of functions it is guaranteed that the respective thread, even if it can be preempted, it will always be executed on the same CPU. Pinning is very effective in the particular case when we have to access at per-cpu datas and we assume other threads will not change those data. The latter condition will determine a critical section as a too strong condition for our code.
es_es: Otra forma de lidiar con la preferencia es <function>sched_pin()</function> interfaz. Si un fragmento de código está cerrado en el <function>sched_pin()</function> y <function>sched_unpin()</function> par de funciones, se garantiza que el subproceso respectivo, incluso si puede ser reemplazado, siempre se ejecutará en la misma CPU. La fijación es muy eficaz en el caso particular cuando tenemos que acceder a datos por CPU y asumimos que otros hilos no cambiarán esos datos. La última condición determinará una sección crítica como una condición demasiado fuerte para nuestro código.

source: <function>sched_bind</function> is an API used in order to bind a thread to a particular CPU for all the time it executes the code, until a <function>sched_unbind</function> function call does not unbind it. This feature has a key role in situations where you cannot trust the current state of CPUs (for example, at very early stages of boot), as you want to avoid your thread to migrate on inactive CPUs. Since <function>sched_bind</function> and <function>sched_unbind</function> manipulate internal scheduler structures, they need to be enclosed in <function>sched_lock</function> acquisition/releasing when used.
es_es: <function>sched_bind</function> es una API que se utiliza para vincular un hilo a una CPU en particular durante todo el tiempo que ejecuta el código, hasta que <function>sched_unbind</function>la llamada a la función no la desvincula. Esta función tiene un papel clave en situaciones en las que no puede confiar en el estado actual de las CPU (por ejemplo, en las primeras etapas del arranque), ya que desea evitar que su hilo migre en CPU inactivas. Ya que <function>sched_bind</function> y<function>sched_unbind</function> manipular las estructuras internas del programador, es necesario incluirlas en <function>sched_lock</function> adquisición/liberación cuando se usa.

source: Proc structure
es_es: Estructura de proceso

source: Various emulation layers sometimes require some additional per-process data. It can manage separate structures (a list, a tree etc.) containing these data for every process but this tends to be slow and memory consuming. To solve this problem the FreeBSD <literal>proc</literal> structure contains <literal>p_emuldata</literal>, which is a void pointer to some emulation layer specific data. This <literal>proc</literal> entry is protected by the proc mutex.
es_es: Varias capas de emulación a veces requieren algunos datos adicionales por proceso. Puede administrar estructuras separadas (una lista, un árbol, etc.) que contienen estos datos para cada proceso, pero esto tiende a ser lento y consume memoria. Para solucionar este problema el FreeBSD <literal>proc</literal> estructura contiene <literal>p_emuldata</literal>,que es un puntero vacío a algunos datos específicos de la capa de emulación. Esta <literal>proc</literal> La entrada está protegida por proc mutex.

source: The FreeBSD <literal>proc</literal> structure contains a <literal>p_sysent</literal> entry that identifies, which ABI this process is running. In fact, it is a pointer to the <literal>sysentvec</literal> described above. So by comparing this pointer to the address where the <literal>sysentvec</literal> structure for the given ABI is stored we can effectively determine whether the process belongs to our emulation layer. The code typically looks like:
es_es: El FreeBSD <literal>proc</literal> structure contains a <literal>p_sysent</literal>entrada que identifica qué ABI está ejecutando este proceso. De hecho, es un puntero al <literal>sysentvec</literal> descrito arriba. Entonces, al comparar este puntero con la dirección donde el <literal>sysentvec</literal> Si se almacena la estructura para la ABI dada, podemos determinar efectivamente si el proceso pertenece a nuestra capa de emulación. El código normalmente se ve así:

source: As you can see, we effectively use the <literal>__predict_true</literal> modifier to collapse the most common case (FreeBSD process) to a simple return operation thus preserving high performance. This code should be turned into a macro because currently it is not very flexible, i.e. we do not support <trademark class="registered">Linux</trademark>64 emulation nor A.OUT <trademark class="registered">Linux</trademark> processes on i386.
es_es: Como puede ver, utilizamos eficazmente la <literal>__predict_true</literal> modificador para colapsar el caso más común (proceso FreeBSD) a una operación de retorno simple preservando así el alto rendimiento. Este código debería convertirse en una macro porque actualmente no es muy flexible, es decir, no admitimos <trademark class="registered">Linux</trademark>64 emulación ni A.OUT<trademark class="registered">Linux</trademark> procesos en i386.

source: The FreeBSD VFS subsystem is very complex but the <trademark class="registered">Linux</trademark> emulation layer uses just a small subset via a well defined API. It can either operate on vnodes or file handlers. Vnode represents a virtual vnode, i.e. representation of a node in VFS. Another representation is a file handler, which represents an opened file from the perspective of a process. A file handler can represent a socket or an ordinary file. A file handler contains a pointer to its vnode. More then one file handler can point to the same vnode.
es_es: el subsistema FreeBSD VFS es muy complejo pero es <trademark class="registered">Linux</trademark> La capa de emulación utiliza solo un pequeño subconjunto a través de una API bien definida. Puede operar en vnodes o controladores de archivos. Vnode representa un vnode virtual, es decir, la representación de un nodo en VFS. Otra representación es un controlador de archivos, que representa un archivo abierto desde la perspectiva de un proceso. Un manejador de archivos puede representar un socket o un archivo ordinario. Un controlador de archivos contiene un puntero a su vnode. Más de un controlador de archivos puede apuntar al mismo vnode.

source: The <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> routine is a central entry point to pathname lookup and translation. It traverses the path point by point from the starting point to the end point using lookup function, which is internal to VFS. The <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> syscall can cope with symlinks, absolute and relative paths. When a path is looked up using <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> it is inputed to the name cache. This behavior can be suppressed. This routine is used all over the kernel and its performance is very critical.
es_es: La <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> La rutina es un punto de entrada central para la búsqueda y traducción de nombres de rutas. Atraviesa la ruta punto por punto desde el punto de inicio hasta el punto final utilizando la función de búsqueda, que es interna de VFS. los <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> syscall puede hacer frente a enlaces simbólicos, rutas absolutas y relativas. Cuando se busca un camino usando <citerefentry><refentrytitle>namei</refentrytitle><manvolnum>9</manvolnum></citerefentry> se ingresa en la caché de nombres. Este comportamiento se puede suprimir. Esta rutina se utiliza en todo el kernel y su rendimiento es muy crítico.
