Repository: doc-br/translate
Catalog: articles/*/linux-emulation.po
Languages: es_es

source: The <citerefentry><refentrytitle>vn_fullpath</refentrytitle><manvolnum>9</manvolnum></citerefentry> function takes the best effort to traverse VFS name cache and returns a path for a given (locked) vnode. This process is unreliable but works just fine for the most common cases. The unreliability is because it relies on VFS cache (it does not traverse the on medium structures), it does not work with hardlinks, etc. This routine is used in several places in the Linuxulator.
es_es: La <citerefentry><refentrytitle>vn_fullpath</refentrytitle><manvolnum>9</manvolnum></citerefentry> La función hace el mejor esfuerzo para atravesar la caché de nombres de VFS y devuelve una ruta para un vnode dado (bloqueado). Este proceso no es confiable pero funciona bien para los casos más comunes. La falta de confiabilidad se debe a que se basa en la caché VFS (no atraviesa las estructuras medias), no funciona con enlaces duros, etc. Esta rutina se usa en varios lugares del Linuxulator.

source: Vnode operations
es_es: Operaciones de vnode

source: <function>fgetvp</function> - given a thread and a file descriptor number it returns the associated vnode
es_es: <function>fgetvp</function> - dado un hilo y un número de descriptor de archivo, devuelve el vnode asociado

source: <citerefentry><refentrytitle>vn_lock</refentrytitle><manvolnum>9</manvolnum></citerefentry> - locks a vnode
es_es: <citerefentry><refentrytitle>vn_lock</refentrytitle><manvolnum>9</manvolnum></citerefentry> - bloquea un vnode

source: <function>vn_unlock</function> - unlocks a vnode
es_es: <function>vn_unlock</function> - desbloquea un vnode

source: <citerefentry><refentrytitle>VOP_READDIR</refentrytitle><manvolnum>9</manvolnum></citerefentry> - reads a directory referenced by a vnode
es_es: <citerefentry><refentrytitle>VOP_READDIR</refentrytitle><manvolnum>9</manvolnum></citerefentry> - lee un directorio al que hace referencia un vnode

source: <citerefentry><refentrytitle>VOP_GETATTR</refentrytitle><manvolnum>9</manvolnum></citerefentry> - gets attributes of a file or a directory referenced by a vnode
es_es: <citerefentry><refentrytitle>VOP_GETATTR</refentrytitle><manvolnum>9</manvolnum></citerefentry> - obtiene atributos de un archivo o directorio al que hace referencia un vnode

source: <citerefentry><refentrytitle>VOP_LOOKUP</refentrytitle><manvolnum>9</manvolnum></citerefentry> - looks up a path to a given directory
es_es: <citerefentry><refentrytitle>VOP_LOOKUP</refentrytitle><manvolnum>9</manvolnum></citerefentry> - busca una ruta a un directorio determinado

source: <citerefentry><refentrytitle>VOP_OPEN</refentrytitle><manvolnum>9</manvolnum></citerefentry> - opens a file referenced by a vnode
es_es: <citerefentry><refentrytitle>VOP_OPEN</refentrytitle><manvolnum>9</manvolnum></citerefentry> - abre un archivo referenciado por un vnode

source: <citerefentry><refentrytitle>VOP_CLOSE</refentrytitle><manvolnum>9</manvolnum></citerefentry> - closes a file referenced by a vnode
es_es: <citerefentry><refentrytitle>VOP_CLOSE</refentrytitle><manvolnum>9</manvolnum></citerefentry> - cierra un archivo al que hace referencia un vnode

source: <citerefentry><refentrytitle>vput</refentrytitle><manvolnum>9</manvolnum></citerefentry> - decrements the use count for a vnode and unlocks it
es_es: <citerefentry><refentrytitle>vput</refentrytitle><manvolnum>9</manvolnum></citerefentry> - disminuye el recuento de uso de un vnode y lo desbloquea

source: <citerefentry><refentrytitle>vrele</refentrytitle><manvolnum>9</manvolnum></citerefentry> - decrements the use count for a vnode
es_es: <citerefentry><refentrytitle>vrele</refentrytitle><manvolnum>9</manvolnum></citerefentry> - disminuye el recuento de uso de un vnode

source: <citerefentry><refentrytitle>vref</refentrytitle><manvolnum>9</manvolnum></citerefentry> - increments the use count for a vnode
es_es: <citerefentry><refentrytitle>vref</refentrytitle><manvolnum>9</manvolnum></citerefentry> - incrementa el recuento de uso de un vnode

source: File handler operations
es_es: Operaciones del controlador de archivos

source: <function>fget</function> - given a thread and a file descriptor number it returns associated file handler and references it
es_es: <function>fget</function> - dado un hilo y un número de descriptor de archivo, devuelve el controlador de archivo asociado y lo hace referencia

source: <function>fdrop</function> - drops a reference to a file handler
es_es: <function>fdrop</function> - suelta una referencia a un controlador de archivos

source: <function>fhold</function> - references a file handler
es_es: <function>fhold</function> - hace referencia a un controlador de archivos

source: <trademark class="registered">Linux</trademark> emulation layer -MD part
es_es: <trademark class="registered">Linux</trademark> capa de emulación-parte MD

source: This section deals with implementation of <trademark class="registered">Linux</trademark> emulation layer in FreeBSD operating system. It first describes the machine dependent part talking about how and where interaction between userland and kernel is implemented. It talks about syscalls, signals, ptrace, traps, stack fixup. This part discusses i386 but it is written generally so other architectures should not differ very much. The next part is the machine independent part of the Linuxulator. This section only covers i386 and ELF handling. A.OUT is obsolete and untested.
es_es: Esta sección trata de la implementación de <trademark class="registered">Linux</trademark> capa de emulación en el sistema operativo FreeBSD. Primero describe la parte dependiente de la máquina hablando de cómo y dónde se implementa la interacción entre el área de usuario y el kernel. Habla de llamadas al sistema, señales, ptrace, trampas, reparación de pila. Esta parte trata sobre i386, pero está escrito en general, por lo que otras arquitecturas no deberían diferir mucho. La siguiente parte es la parte independiente de la máquina del Linuxulator. Esta sección solo cubre el manejo de i386 y ELF. A.OUT es obsoleto y no se ha probado.

source: Syscall handling
es_es: Manejo de llamadas al sistema

source: Syscall handling is mostly written in <filename>linux_sysvec.c</filename>, which covers most of the routines pointed out in the <literal>sysentvec</literal> structure. When a <trademark class="registered">Linux</trademark> process running on FreeBSD issues a syscall, the general syscall routine calls linux prepsyscall routine for the <trademark class="registered">Linux</trademark> ABI.
es_es: El manejo de syscall está escrito principalmente en <filename>linux_sysvec.c</filename>, que cubre la mayoría de las rutinas señaladas en la <literal>sysentvec</literal> estructura. Cuando una <trademark class="registered">Linux</trademark> proceso que se ejecuta en FreeBSD emite una llamada al sistema, la rutina general de llamada al sistema llama a la rutina prepsyscall de linux para <trademark class="registered">Linux</trademark> ABI.

source: <trademark class="registered">Linux</trademark> passes arguments to syscalls via registers (that is why it is limited to 6 parameters on i386) while FreeBSD uses the stack. The <trademark class="registered">Linux</trademark> prepsyscall routine must copy parameters from registers to the stack. The order of the registers is: <varname>%ebx</varname>, <varname>%ecx</varname>, <varname>%edx</varname>, <varname>%esi</varname>, <varname>%edi</varname>, <varname>%ebp</varname>. The catch is that this is true for only <emphasis>most</emphasis> of the syscalls. Some (most notably <function>clone</function>) uses a different order but it is luckily easy to fix by inserting a dummy parameter in the <function>linux_clone</function> prototype.
es_es: <trademark class="registered">Linux</trademark>pasa argumentos a las llamadas al sistema a través de registros (es por eso que está limitado a 6 parámetros en i386) mientras que FreeBSD usa la pila. los <trademark class="registered">Linux</trademark> La rutina prepsyscall debe copiar los parámetros de los registros a la pila. El orden de los registros es: <varname>%ebx</varname>, <varname>%ecx</varname>, <varname>%edx</varname>, <varname>%esi</varname>, <varname>%edi</varname>, <varname>%ebp</varname>. El problema es que esto es cierto solo para <emphasis>most</emphasis> de las llamadas al sistema. Algunos (más notablemente <function>clone</function>) usa un orden diferente pero afortunadamente es fácil de arreglar insertando un parámetro ficticio en el <function>linux_clone</function> prototipo.

source: Syscall writing
es_es: Escritura de syscall

source: Every syscall implemented in the Linuxulator must have its prototype with various flags in <filename>syscalls.master</filename>. The form of the file is:
es_es: Cada syscall implementada en Linuxulator debe tener su prototipo con varios indicadores en <filename>syscalls.master</filename>. La forma del archivo es:

source: The first column represents the syscall number. The second column is for auditing support. The third column represents the syscall type. It is either <literal>STD</literal>, <literal>OBSOL</literal>, <literal>NOPROTO</literal> and <literal>UNIMPL</literal>. <literal>STD</literal> is a standard syscall with full prototype and implementation. <literal>OBSOL</literal> is obsolete and defines just the prototype. <literal>NOPROTO</literal> means that the syscall is implemented elsewhere so do not prepend ABI prefix, etc. <literal>UNIMPL</literal> means that the syscall will be substituted with the <function>nosys</function> syscall (a syscall just printing out a message about the syscall not being implemented and returning <literal>ENOSYS</literal>).
es_es: La primera columna representa el número de llamada al sistema. La segunda columna es para el soporte de auditoría. La tercera columna representa el tipo de llamada al sistema. Es bien <literal>STD</literal>, <literal>OBSOL</literal>, <literal>NOPROTO</literal> y <literal>UNIMPL</literal>. <literal>STD</literal> es una llamada al sistema estándar con prototipo completo e implementación. <literal>OBSOL</literal> es Obsoleto y define solo el prototipo.. <literal>NOPROTO</literal> significa que la llamada al sistema se implementa en otro lugar, así que no anteponga el prefijo ABI, etc. <literal>UNIMPL</literal> Significa que el syscall será sustituido por el <function>nosys</function> syscall (una syscall que simplemente imprime un mensaje sobre la no implementación del syscall y que regresa <literal>ENOSYS</literal>).

source: From <filename>syscalls.master</filename> a script generates three files: <filename>linux_syscall.h</filename>, <filename>linux_proto.h</filename> and <filename>linux_sysent.c</filename>. The <filename>linux_syscall.h</filename> contains definitions of syscall names and their numerical value, e.g.:
es_es: Desde <filename>syscalls.master</filename> un script genera tres archivos: <filename>linux_syscall.h</filename>, <filename>linux_proto.h</filename> y <filename>linux_sysent.c</filename>. El <filename>linux_syscall.h</filename> contiene definiciones de nombres de llamadas al sistema y su valor numérico, por ejemplo:

source: The <filename>linux_proto.h</filename> contains structure definitions of arguments to every syscall, e.g.:
es_es: El <filename>linux_proto.h</filename> contiene definiciones de estructura de argumentos para cada llamada al sistema, por ejemplo:

source: And finally, <filename>linux_sysent.c</filename> contains structure describing the system entry table, used to actually dispatch a syscall, e.g.:
es_es: Y finalmente, <filename>linux_sysent.c</filename> contiene una estructura que describe la tabla de entrada del sistema, utilizada para enviar una llamada al sistema, por ejemplo:

source: As you can see <function>linux_fork</function> is implemented in Linuxulator itself so the definition is of <literal>STD</literal> type and has no argument, which is exhibited by the dummy argument structure. On the other hand <function>close</function> is just an alias for real FreeBSD <citerefentry><refentrytitle>close</refentrytitle><manvolnum>2</manvolnum></citerefentry> so it has no linux arguments structure associated and in the system entry table it is not prefixed with linux as it calls the real <citerefentry><refentrytitle>close</refentrytitle><manvolnum>2</manvolnum></citerefentry> in the kernel.
es_es: Como puedes ver <function>linux_fork</function> se implementa en el propio Linuxulator, por lo que la definición es de <literal>STD</literal> type y no tiene argumento, que es exhibido por la estructura de argumento ficticia. Por otra parte <function>close</function> es solo un alias de FreeBSD real <citerefentry><refentrytitle>cierre</refentrytitle><manvolnum>2</manvolnum></citerefentry> por lo que no tiene una estructura de argumentos linux asociada y en la tabla de entrada del sistema no tiene el prefijo linux, ya que llama al real <citerefentry><refentrytitle>cierre</refentrytitle><manvolnum>2</manvolnum></citerefentry> en el kernel.

source: Dummy syscalls
es_es: Llamadas al sistema ficticias

source: The <trademark class="registered">Linux</trademark> emulation layer is not complete, as some syscalls are not implemented properly and some are not implemented at all. The emulation layer employs a facility to mark unimplemented syscalls with the <literal>DUMMY</literal> macro. These dummy definitions reside in <filename>linux_dummy.c</filename> in a form of <literal>DUMMY(syscall);</literal>, which is then translated to various syscall auxiliary files and the implementation consists of printing a message saying that this syscall is not implemented. The <literal>UNIMPL</literal> prototype is not used because we want to be able to identify the name of the syscall that was called in order to know what syscalls are more important to implement.
es_es: El <trademark class="registered">Linux</trademark> La capa de emulación no está completa, ya que algunas llamadas al sistema no se implementan correctamente y otras no se implementan en absoluto. La capa de emulación emplea una función para marcar llamadas al sistema no implementadas con el<literal>DUMMY</literal> macro. Estas definiciones ficticias residen en <filename>linux_dummy.c</filename>en forma de <literal>DUMMY(syscall);</literal>, que luego se traduce a varios archivos auxiliares de syscall y la implementación consiste en imprimir un mensaje diciendo que este syscall no está implementado. los <literal>UNIMPL</literal> prototype no se utiliza porque queremos poder identificar el nombre de la llamada al sistema que se llamó para saber qué llamadas al sistema son más importantes de implementar.

source: Signal handling
es_es: Manejo de señales

source: Signal handling is done generally in the FreeBSD kernel for all binary compatibilities with a call to a compat-dependent layer. <trademark class="registered">Linux</trademark> compatibility layer defines <function>linux_sendsig</function> routine for this purpose.
es_es: El manejo de señales se realiza generalmente en el kernel de FreeBSD para todas las compatibilidades binarias con una llamada a una capa dependiente de la compatibilidad. <trademark class="registered">Linux</trademark> la capa de compatibilidad define <function>linux_sendsig</function> rutina para este propósito.

source: This routine first checks whether the signal has been installed with a <literal>SA_SIGINFO</literal> in which case it calls <function>linux_rt_sendsig</function> routine instead. Furthermore, it allocates (or reuses an already existing) signal handle context, then it builds a list of arguments for the signal handler. It translates the signal number based on the signal translation table, assigns a handler, translates sigset. Then it saves context for the <function>sigreturn</function> routine (various registers, translated trap number and signal mask). Finally, it copies out the signal context to the userspace and prepares context for the actual signal handler to run.
es_es: Esta rutina comprueba primero si la señal se ha instalado con un <literal>SA_SIGINFO</literal> en cuyo caso llama <function>linux_rt_sendsig</function> rutina en su lugar. Además, asigna (o reutiliza un contexto de manejador de señal ya existente), luego crea una lista de argumentos para el manejador de señal. Traduce el número de señal basado en la tabla de traducción de señales, asigna un manejador, traduce sigset. Luego guarda contexto para el <function>sigreturn</function> rutina (varios registros, número de trampa traducido y máscara de señal). Finalmente, copia el contexto de la señal al espacio de usuario y prepara el contexto para que se ejecute el manejador de señal real.

source: This routine is similar to <function>linux_sendsig</function> just the signal context preparation is different. It adds <literal>siginfo</literal>, <literal>ucontext</literal>, and some <trademark class="registered">POSIX</trademark> parts. It might be worth considering whether those two functions could not be merged with a benefit of less code duplication and possibly even faster execution.
es_es: Esta rutina es similar a <function>linux_sendsig</function> solo la preparación del contexto de la señal es diferente. Agregando <literal>siginfo</literal>, <literal>ucontext</literal>, y algo <trademark class="registered">POSIX</trademark> partes. Podría valer la pena considerar si esas dos funciones no se pueden combinar con el beneficio de una menor duplicación de código y posiblemente una ejecución aún más rápida.

source: This syscall is used for return from the signal handler. It does some security checks and restores the original process context. It also unmasks the signal in process signal mask.
es_es: Esta llamada al sistema se utiliza para la devolución del controlador de señales. Realiza algunas comprobaciones de seguridad y restaura el contexto del proceso original. También desenmascara la señal en la máscara de señal de proceso.

source: Many <trademark class="registered">UNIX</trademark> derivates implement the <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall in order to allow various tracking and debugging features. This facility enables the tracing process to obtain various information about the traced process, like register dumps, any memory from the process address space, etc. and also to trace the process like in stepping an instruction or between system entries (syscalls and traps). <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> also lets you set various information in the traced process (registers etc.). <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> is a <trademark class="registered">UNIX</trademark>-wide standard implemented in most <trademark class="registered">UNIX</trademark>es around the world.
es_es: Muchos <trademark class="registered">UNIX</trademark> derivados implementan el <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall para permitir varias funciones de seguimiento y depuración. Esta función permite que el proceso de rastreo obtenga diversa información sobre el proceso rastreado, como volcados de registros, cualquier memoria del espacio de direcciones del proceso, etc. y también rastrear el proceso como en el paso de una instrucción o entre entradas del sistema (syscalls y trampas). <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry>también le permite configurar diversa información en el proceso de seguimiento (registros, etc.). <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> es a <trademark class="registered">UNIX</trademark>-amplio estándar implementado en la mayoría <trademark class="registered">UNIX</trademark>es alrededor del mundo.

source: <trademark class="registered">Linux</trademark> emulation in FreeBSD implements the <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> facility in <filename>linux_ptrace.c</filename>. The routines for converting registers between <trademark class="registered">Linux</trademark> and FreeBSD and the actual <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall emulation syscall. The syscall is a long switch block that implements its counterpart in FreeBSD for every <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> command. The <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> commands are mostly equal between <trademark class="registered">Linux</trademark> and FreeBSD so usually just a small modification is needed. For example, <literal>PT_GETREGS</literal> in <trademark class="registered">Linux</trademark> operates on direct data while FreeBSD uses a pointer to the data so after performing a (native) <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall, a copyout must be done to preserve <trademark class="registered">Linux</trademark> semantics.
es_es: <trademark class="registered">Linux</trademark> emulación en FreeBSD implementa la <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> instalación en <filename>linux_ptrace.c</filename>. Las rutinas para convertir registros entre <trademark class="registered">Linux</trademark> Y FreeBSD y el actual <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall emulación syscall. El syscall es un bloque de conmutadores largo que implementa su contraparte en FreeBSD para cada<citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> mando. los <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> los comandos son en su mayoría iguales entre <trademark class="registered">Linux</trademark> y FreeBSD, por lo que normalmente solo se necesita una pequeña modificación. Por ejemplo, <literal>PT_GETREGS</literal> en <trademark class="registered">Linux</trademark> opera con datos directos, mientras que FreeBSD usa un puntero a los datos, por lo que después de realizar un (nativo) <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> syscall, se debe realizar una copia para conservar <trademark class="registered">Linux</trademark> semántica.

source: The <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> implementation in Linuxulator has some known weaknesses. There have been panics seen when using <command>strace</command> (which is a <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> consumer) in the Linuxulator environment. Also <literal>PT_SYSCALL</literal> is not implemented.
es_es: La <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> La implementación en Linuxulator tiene algunas debilidades conocidas. Ha habido pánico al usar <command>strace</command> (el cual es un <citerefentry><refentrytitle>ptrace</refentrytitle><manvolnum>2</manvolnum></citerefentry> consumidor) en el entorno Linuxulator. también <literal>PT_SYSCALL</literal> no está implementado.
