Repository: doc-br/translate
Catalog: articles/*/new-users.po
Languages: es_es

source: Now that you have installed <command>tcsh</command>, you can adjust your prompt. You can find the details in the manual page for <command>tcsh</command>, but here is a line to put in your <filename>.tcshrc</filename> that will tell you how many commands you have typed, what time it is, and what directory you are in. It also produces a <literal>&gt;</literal> if you are an ordinary user and a <literal>#</literal> if you are <systemitem class="username">root</systemitem>, but tsch will do that in any case:
es_es: Ahora que ha instalado <command>tcsh</command>, puede configurar su prompt. Puede encontrar los detalles en la página del manual de <command>tcsh</command>, pero aquí tiene una línea que añadir en su archivo <filename>.tcshrc</filename> que le dirá cuántos comandos ha escrito, qué hora es y en qué directorio se encuentra. También le indicará con el literal <literal>&gt;</literal> si es un usuario normal y con el literal <literal>#</literal> si es el usuario <systemitem class="username">root</systemitem>, aunque tsch lo hará siempre:

source: This should go in the same place as the existing set prompt line if there is one, or under "if($?prompt) then" if not. Comment out the old line; you can always switch back to it if you prefer it. Do not forget the spaces and quotes. You can get the <filename>.tcshrc</filename> reread by typing <command>source .tcshrc</command>.
es_es: Debería de ir en el mismo lugar que la línea del prompt actual, si existiera, o debajo de "if($?prompt) then" si no existiera. Comente la línea antigua; siempre podrá volver a usar el método antiguo si lo prefiere. No olvide los espacios y las comillas. Puede forzar la relectura del archivo <filename>.tcshrc</filename> ejecutando <command>source .tcshrc</command>.

source: You can get a listing of other environmental variables that have been set by typing <command>env</command> at the prompt. The result will show you your default editor, pager, and terminal type, among possibly many others. A useful command if you log in from a remote location and cannot run a program because the terminal is not capable is <command>setenv TERM vt100</command>.
es_es: Puede obtener un listado de las otras variables de entorno que han sido configuradas ejecutando <command>env</command> en el prompt. El resultado mostrará su editor predeterminado, paginador y tipo de terminal, entre muchas otras. Un comando útil si inicia sesión desde una ubicación remota y no puede ejecutar un programa porque el terminal no es capaz de hacerlo es <command>setenv TERM vt100</command>.

source: Other
es_es: Otros

source: As <systemitem class="username">root</systemitem>, you can unmount the CDROM with <command>/sbin/umount /cdrom</command>, take it out of the drive, insert another one, and mount it with <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command> assuming <hardware>cd0a</hardware> is the device name for your CDROM drive. The most recent versions of FreeBSD let you mount the CDROM with just <command>/sbin/mount /cdrom</command>.
es_es: Como usuario <systemitem class="username">root</systemitem>, puede desmontar el CDROM con el comando <command>/sbin/umount /cdrom</command>, sacarlo de la unidad, insertar otro y montarlo con el comando <command>/sbin/mount_cd9660 /dev/cd0a /cdrom</command>, asumiendo, claro, que <hardware>cd0a</hardware> es el nombre del dispositivo para su unidad de CDROM. Las versiones más recientes de FreeBSD le permiten montar el CDROM con el comando <command>/sbin/mount /cdrom</command>.

source: Using the live filesystem—the second of FreeBSD's CDROM disks—is useful if you have got limited space. What is on the live filesystem varies from release to release. You might try playing games from the CDROM. This involves using <command>lndir</command>, which gets installed with the X Window System, to tell the program(s) where to find the necessary files, because they are in <filename>/cdrom</filename> instead of in <filename>/usr</filename> and its subdirectories, which is where they are expected to be. Read <command>man lndir</command>.
es_es: Utilizar el sistema de archivos live, el segundo disco de los CDROM de FreeBSD, es útil si tiene un espacio limitado. El contenido del sistema de archivos live varía de una versión a otra. Puede probar a jugar a los juegos que hay en el CDROM. Esto implica usar el comando <command>lndir</command>, el cual se instala junto al sistema de ventanas X (X Window System), para informar al resto de programas dónde encontrar los archivos necesarios, dado que se encuentran en <filename>/cdrom</filename> en lugar de <filename>/usr</filename> y sus subdirectorios, que es donde se espear que estén. Lea el manual del comando lndir ejecutando <command>man lndir</command>.

source: Comments Welcome
es_es: Se aceptan sugerencias

source: If you use this guide I would be interested in knowing where it was unclear and what was left out that you think should be included, and if it was helpful. My thanks to Eugene W. Stark, professor of computer science at SUNY-Stony Brook, and John Fieber for helpful comments.
es_es: Si utiliza esta guía, me interesaría saber qué partes no han quedado del todo claras y qué echa en falta y piensa que debería incluirse, y si fue útil para usted. Gracias a Eugene W. Stark, profesor de ciencias de la computación en SUNY-Stony Brook y a John Fieber por sus útiles comentarios.
