Repository: doc-br/translate
Catalog: articles/*/new-users.po
Languages: es_es

# _
source: translator-credits
es_es: Sergio Carlavilla carlavilla@FreeBSD.org, 2019

source: For People New to Both FreeBSD and <trademark class="registered">UNIX</trademark>
es_es: A los principiantes en FreeBSD y <trademark class="registered">UNIX</trademark>

source: $FreeBSD: head/en_US.ISO8859-1/articles/new-users/article.xml 52136 2018-08-16 13:55:09Z bcr $
es_es: $FreeBSD$

source: Congratulations on installing FreeBSD! This introduction is for people new to both FreeBSD <emphasis>and</emphasis> <trademark class="registered">UNIX</trademark>—so it starts with basics.
es_es: ¡Felicidades por instalar FreeBSD! Esta introducción es para personas nuevas tanto en FreeBSD <emphasis>como en</emphasis> <trademark class="registered">UNIX</trademark>—entonces, empecemos desde lo básico.

source: Logging in and Getting Out
es_es: Iniciar y cerrar sesión

source: Log in (when you see <prompt>login:</prompt>) as a user you created during installation or as <systemitem class="username">root</systemitem>. (Your FreeBSD installation will already have an account for <systemitem class="username">root</systemitem>; who can go anywhere and do anything, including deleting essential files, so be careful!) The symbols <prompt>%</prompt> and <prompt>#</prompt> in the following stand for the prompt (yours may be different), with <prompt>%</prompt> indicating an ordinary user and <prompt>#</prompt> indicating <systemitem class="username">root</systemitem>.
es_es: Inicie sesión (cuando vea <prompt>login:</prompt>) con el usuario que creó durante la instalación o como usuario <systemitem class="username">root</systemitem>. (Su instalación de FreeBSD ya tendrá una cuenta para el usuario <systemitem class="username">root</systemitem>; este usuario puede acceder a cualquier lugar y hacer cualquier cosa, incluyendo borrar archivos esenciales del sistema, ¡tenga cuidado!) Los símbolos <prompt>%</prompt> y <prompt>#</prompt> en el prompt (el suyo puede ser diferente) indican el tipo de usuario, el símbolo <prompt>%</prompt> indica que es un usuario común y el símbolo <prompt>#</prompt> indica que el usuario es <systemitem class="username">root</systemitem>.

source: To log out (and get a new <prompt>login:</prompt> prompt) type
es_es: Para cerrar sesión (y obtener un nuevo prompt de <prompt>login:</prompt>), escriba:

source: as often as necessary. Yes, press <keysym>enter</keysym> after commands, and remember that <trademark class="registered">UNIX</trademark> is case-sensitive—<command>exit</command>, not <command>EXIT</command>.
es_es: tantas veces como sean necesarias. Presione <keysym>enter</keysym> después de escribir los comandos, y recuerde que <trademark class="registered">UNIX</trademark> es sensible a las mayúsculas y minúsculas (case-sensitive)—escriba <command>exit</command>, no <command>EXIT</command>.

source: To shut down the machine type
es_es: Para apagar el ordenador, escriba:

source: Or to reboot type
es_es: O para reiniciar, escriba

source: or
es_es: o

source: You can also reboot with <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo>. Give it a little time to do its work. This is equivalent to <command>/sbin/reboot</command> in recent releases of FreeBSD and is much, much better than hitting the reset button. You do not want to have to reinstall this thing, do you?
es_es: También puede reiniciar con <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Delete</keycap></keycombo>. Espere un poco a que termine el proceso. Esta secuencia de teclas es el equivalente a <command>/sbin/reboot</command> en las versiones recientes de FreeBSD, y por supuesto, este procedimiento es mucho, mucho mejor que pulsar el botón de reinicio. Usted no quiere tener que reinstalar el sistema, ¿no es así?

source: Adding a User with Root Privileges
es_es: Agregar un usuario con privilegios de root

source: If you did not create any users when you installed the system and are thus logged in as <systemitem class="username">root</systemitem>, you should probably create a user now with
es_es: Si no creó ningún usuario cuando instaló el sistema y, por lo tanto, inició sesión como <systemitem class="username">root</systemitem>, probablemente debería crear un usuario ahora con

source: The first time you use <command>adduser</command>, it might ask for some defaults to save. You might want to make the default shell <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> instead of <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, if it suggests <command>sh</command> as the default. Otherwise just press enter to accept each default. These defaults are saved in <filename>/etc/adduser.conf</filename>, an editable file.
es_es: La primera vez que use <command>adduser</command>, es posible que le solicite algunos valores por defecto para guardar. Es posible que desee hacer que <citerefentry><refentrytitle>csh</refentrytitle><manvolnum>1</manvolnum></citerefentry> sea la shell predeterminada en lugar de <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>, si le ha sugerido <command>sh</command> como predeterminado. De lo contrario, simplemente pulse enter para aceptar cada valor predeterminado. Estos valores predeterminados se guardan en <filename>/etc/adduser.conf</filename>, un archivo editable.

source: Suppose you create a user <systemitem class="username">jack</systemitem> with full name <emphasis>Jack Benimble</emphasis>. Give <systemitem class="username">jack</systemitem> a password if security (even kids around who might pound on the keyboard) is an issue. When it asks you if you want to invite <systemitem class="username">jack</systemitem> into other groups, type <systemitem class="groupname">wheel</systemitem>
es_es: Supongamos que crea el usuario <systemitem class="username">jack</systemitem>, con el nombre completo, <emphasis>Jack Benimble</emphasis>. Proporcione a <systemitem class="username">jack</systemitem> una contraseña si la seguridad (incluso si hay niños alrededor que pudieran golpear el teclado) es un problema. Cuando le pregunte si desea añadir a <systemitem class="username">jack</systemitem> a otros grupos, escriba <systemitem class="groupname">wheel</systemitem>

source: Login group is ``jack''. Invite jack into other groups: <userinput>wheel</userinput>
es_es: El grupo del login es "jack". Añadir a jack a otros grupos: <userinput>wheel</userinput>

source: This will make it possible to log in as <systemitem class="username">jack</systemitem> and use the <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> command to become <systemitem class="username">root</systemitem>. Then you will not get scolded any more for logging in as <systemitem class="username">root</systemitem>.
es_es: Esto permitirá iniciar sesión como <systemitem class="username">jack</systemitem> y usar el comando <citerefentry><refentrytitle>su</refentrytitle><manvolnum>1</manvolnum></citerefentry> para convertirse en el usuario <systemitem class="username">root</systemitem>. De esta forma, no volverá a ser reprochado por iniciar sesión como <systemitem class="username">root</systemitem>.

source: You can quit <command>adduser</command> any time by typing <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>, and at the end you will have a chance to approve your new user or simply type <keycap>n</keycap> for no. You might want to create a second new user so that when you edit <systemitem class="username">jack</systemitem>'s login files, you will have a hot spare in case something goes wrong.
es_es: Puede finalizar en cualquier momento el comando <command>adduser</command> pulsando la combinación de teclas <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo>. Al final del comando, también tendrá la oportunidad de aprobar su nuevo usuario, o, en caso contrario, no hacerlo pulsando la tecla <keycap>n</keycap>. Es posible que desee crear un segundo usuario, de esta forma, si al editar los archivos del inicio de sesión de <systemitem class="username">jack</systemitem> algo va mal, tenga un usuario de reserva.

source: Once you have done this, use <command>exit</command> to get back to a login prompt and log in as <systemitem class="username">jack</systemitem>. In general, it is a good idea to do as much work as possible as an ordinary user who does not have the power—and risk—of <systemitem class="username">root</systemitem>.
es_es: Una vez que haya hecho esto, utilice el comando <command>exit</command> para volver al prompt de inicio de sesión e iniciar sesión como <systemitem class="username">jack</systemitem>. En general, es una buena idea hacer la mayor cantidad posible de trabajo como usuario común que no tenga el poder —y el riesgo— del usuario <systemitem class="username">root</systemitem>.

source: If you already created a user and you want the user to be able to <command>su</command> to <systemitem class="username">root</systemitem>, you can log in as <systemitem class="username">root</systemitem> and edit the file <filename>/etc/group</filename>, adding <systemitem class="username">jack</systemitem> to the first line (the group <systemitem class="groupname">wheel</systemitem>). But first you need to practice <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, the text editor—or use the simpler text editor, <citerefentry><refentrytitle>ee</refentrytitle><manvolnum>1</manvolnum></citerefentry>, installed on recent versions of FreeBSD.
es_es: Si ya creó un usuario y desea que sea capaz de ejecutar el comando <command>su</command> para convertirse en <systemitem class="username">root</systemitem>, puede iniciar sesión como <systemitem class="username">root</systemitem> y editar el archivo <filename>/etc/group</filename>, añadiendo al usuario <systemitem class="username">jack</systemitem> a la primera línea (en el grupo <systemitem class="groupname">wheel</systemitem>). Pero primero debe practicar con <citerefentry><refentrytitle>vi</refentrytitle><manvolnum>1</manvolnum></citerefentry>, el editor de texto — o use un editor de texto más simple, <citerefentry><refentrytitle>ee</refentrytitle><manvolnum>1</manvolnum></citerefentry>, instalado en las versiones recientes de FreeBSD.

source: To delete a user, use <command>rmuser</command>.
es_es: Para eliminar un usuario, utilice el comando <command>rmuser</command>.

source: Looking Around
es_es: Echando un vistazo

source: Logged in as an ordinary user, look around and try out some commands that will access the sources of help and information within FreeBSD.
es_es: Inicie sesión como un usuario normal, eche un vistazo y pruebe algunos comandos que accederán a las fuentes de ayuda e información de FreeBSD.

source: Here are some commands and what they do:
es_es: Aquí se describen algunos comandos y lo que hacen:

source: Tells you who you are!
es_es: ¡Le dice quién es!

source: Shows you where you are—the current working directory.
es_es: Le muestra dónde está—el directorio de trabajo actual.

source: Lists the files in the current directory.
es_es: Lista los archivos en el directorio actual.

source: Lists the files in the current directory with a <literal>*</literal> after executables, a <literal>/</literal> after directories, and an <literal>@</literal> after symbolic links.
es_es: Lista los archivos del directorio actual con un <literal>*</literal> después de los ejecutables, un <literal>/</literal> después de los directorios y una <literal>@</literal> después de los enlaces simbolicos.

source: Lists the files in long format—size, date, permissions.
es_es: Lista los archivos en el formato extendido—tamaño, fecha y permisos.

source: Lists hidden <quote>dot</quote> files with the others. If you are <systemitem class="username">root</systemitem>, the <quote>dot</quote> files show up without the <option>-a</option> switch.
es_es: Lista los archivos ocultos <quote>dot</quote> junto con los demás. Si es <systemitem class="username">root</systemitem>, los archivos <quote>dot</quote> se mostrarán sin la opción <option>-a</option>.

source: Changes directories. <command>cd ..</command> backs up one level; note the space after <command>cd</command>. <command>cd /usr/local</command> goes there. <command>cd ~</command> goes to the home directory of the person logged in—e.g., <filename>/usr/home/jack</filename>. Try <command>cd /cdrom</command>, and then <command>ls</command>, to find out if your CDROM is mounted and working.
es_es: Cambia el directorio actual de trabajo. El comando <command>cd ..</command> sube un nivel; tenga en cuenta el espacio después del comando <command>cd</command>. El comando <command>cd /usr/local</command> le lleva a ese mismo directorio. El comando <command>cd ~</command> le lleva al directorio home de la persona que inició sesión, por ejemplo, <filename>/usr/home/jack</filename>. Pruebe el comando <command>cd /cdrom</command>, y después el comando <command>ls</command>, para comprobar si el CDROM está montado y funcionando.

source: Lets you look at a file (named <replaceable>filename</replaceable>) without changing it. Try <command>less /etc/fstab</command>. Type <command>q</command> to quit.
es_es: Le permite ver un archivo (llamado <replaceable>filename</replaceable>) sin tener que editarlo. Pruebe con el comando <command>less /etc/fstab</command>. Escriba <command>q</command> para salir.

source: Displays <replaceable>filename</replaceable> on screen. If it is too long and you can see only the end of it, press <keycap>ScrollLock</keycap> and use the <keycap>up-arrow</keycap> to move backward; you can use <keycap>ScrollLock</keycap> with manual pages too. Press <keycap>ScrollLock</keycap> again to quit scrolling. You might want to try <command>cat</command> on some of the dot files in your home directory—<command>cat .cshrc</command>, <command>cat .login</command>, <command>cat .profile</command>.
es_es: Muestra el contenido del archivo <replaceable>filename</replaceable> en pantalla. Si el contenido es demasiado largo y solo puede ver el final del archivo, presione <keycap>ScrollLock</keycap> y use la tecla <keycap>up-arrow</keycap> para retroceder; también puede usar <keycap>ScrollLock</keycap> en las páginas del manual. Vuelva a presionar de nuevo <keycap>ScrollLock</keycap> para dejar de desplazarse. Es posible que también desee probar el comando <command>cat</command> en algunos de los archivos dot de su directorio home — <command>cat .cshrc</command>, <command>cat .login</command>, <command>cat .profile</command>.

source: You will notice aliases in <filename>.cshrc</filename> for some of the <command>ls</command> commands (they are very convenient). You can create other aliases by editing <filename>.cshrc</filename>. You can make these aliases available to all users on the system by putting them in the system-wide <command>csh</command> configuration file, <filename>/etc/csh.cshrc</filename>.
es_es: Se dará cuenta de que el archivo <filename>.cshrc</filename> contiene algunos alias para el comando <command>ls</command> (son muy convenientes). Puede añadir otros alias editando el archivo <filename>.cshrc</filename>. Puede poner estos alias a disposición de todos los usuarios del sistema colocándolos en el archivo de configuración global de <command>csh</command>, ubicado en <filename>/etc/csh.cshrc</filename>.

source: Getting Help and Information
es_es: Obteniendo ayuda e información

source: Here are some useful sources of help. <replaceable>Text</replaceable> stands for something of your choice that you type in—usually a command or filename.
es_es: Aquí tiene algunas fuentes útiles de ayuda. La palabra <replaceable>Text</replaceable> debe ser reemplazada por un texto de su elección—generalmente, un comando o un nombre de archivo.

source: Everything containing string <replaceable>text</replaceable> in the <database>whatis database</database>.
es_es: Todo lo que contiene la cadena <replaceable>text</replaceable> en la <database>base de datos whatis</database>.

source: The manual page for <replaceable>text</replaceable>. The major source of documentation for <trademark class="registered">UNIX</trademark> systems. <command>man ls</command> will tell you all the ways to use <command>ls</command>. Press <keycap>Enter</keycap> to move through text, <keycombo><keycap>Ctrl</keycap><keycap>B</keycap></keycombo> to go back a page, <keycombo><keycap>Ctrl</keycap><keycap>F</keycap></keycombo> to go forward, <keycap>q</keycap> or <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> to quit.
es_es: La página del manual para <replaceable>text</replaceable>. La principal fuente de documentación en los sistemas <trademark class="registered">UNIX</trademark>. <command>man ls</command> le indicará todas las formas de usar el comando <command>ls</command>. Presione la tecla <keycap>Enter</keycap> para desplazarse por el texto, <keycombo><keycap>Ctrl</keycap><keycap>B</keycap></keycombo> para retroceder una página, <keycombo><keycap>Ctrl</keycap><keycap>F</keycap></keycombo> para avanzar, <keycap>q</keycap> o <keycombo><keycap>Ctrl</keycap><keycap>C</keycap></keycombo> para salir.

source: Tells you where in the user's path the command <replaceable>text</replaceable> is found.
es_es: Le indica dónde se encuentra la ruta del comando <replaceable>text</replaceable>.

source: All the paths where the string <replaceable>text</replaceable> is found.
es_es: Le indica todas las rutas donde se encuentre el texto <replaceable>text</replaceable>.

source: Tells you what the command <replaceable>text</replaceable> does and its manual page. Typing <command>whatis *</command> will tell you about all the binaries in the current directory.
es_es: Le indica qué hace el comando <replaceable>text</replaceable> y la página del manual. Escribiendo <command>whatis *</command> le indicará todos los binarios del directorio actual.

source: Finds the file <replaceable>text</replaceable>, giving its full path.
es_es: Encuentra el archivo <replaceable>text</replaceable>, informándole de su ruta completa.

source: You might want to try using <command>whatis</command> on some common useful commands like <command>cat</command>, <command>more</command>, <command>grep</command>, <command>mv</command>, <command>find</command>, <command>tar</command>, <command>chmod</command>, <command>chown</command>, <command>date</command>, and <command>script</command>. <command>more</command> lets you read a page at a time as it does in DOS, e.g., <command>ls -l | more</command> or <command>more <replaceable>filename</replaceable></command>. The <literal>*</literal> works as a wildcard—e.g., <command>ls w*</command> will show you files beginning with <literal>w</literal>.
es_es: Es posible que desee probar el comando <command>whatis</command> en algunos comandos útiles como <command>cat</command>, <command>more</command>, <command>grep</command>, <command>mv</command>, <command>find</command>, <command>tar</command>, <command>chmod</command>, <command>chown</command>, <command>date</command>, y <command>script</command>. El comando <command>more</command> le permite leer una página entera a la vez como en DOS, por ejemplo: <command>ls -l | more</command> o <command>more <replaceable>filename</replaceable></command>. El carácter <literal>*</literal> funciona como un carácter comodín, por ejemplo, el comando <command>ls w*</command> le mostrará los archivos que comienzan con <literal>w</literal>.

source: Are some of these not working very well? Both <citerefentry><refentrytitle>locate</refentrytitle><manvolnum>1</manvolnum></citerefentry> and <citerefentry><refentrytitle>whatis</refentrytitle><manvolnum>1</manvolnum></citerefentry> depend on a database that is rebuilt weekly. If your machine is not going to be left on over the weekend (and running FreeBSD), you might want to run the commands for daily, weekly, and monthly maintenance now and then. Run them as <systemitem class="username">root</systemitem> and, for now, give each one time to finish before you start the next one.
es_es: ¿Algunos de estos comandos no funcionan correctamente? Tanto el comando <citerefentry><refentrytitle>locate</refentrytitle><manvolnum>1</manvolnum></citerefentry> como <citerefentry><refentrytitle>whatis</refentrytitle><manvolnum>1</manvolnum></citerefentry> dependen de una base de adtos que se reconstruye semanalmente. Si su máquina no está encendida durante el fin de semana (y ejecuta FreeBSD), es posible que desee ejecutar los comandos para el mantenimiento diario, semanal y mensual de vez en cuando. Ejecútelos como <systemitem class="username">root</systemitem> y, por ahora, déle a cada uno el tiempo necesario para que termine antes de comenzar con el siguiente.

source: If you get tired of waiting, press <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> to get another <firstterm>virtual console</firstterm>, and log in again. After all, it is a multi-user, multi-tasking system. Nevertheless these commands will probably flash messages on your screen while they are running; you can type <command>clear</command> at the prompt to clear the screen. Once they have run, you might want to look at <filename>/var/mail/root</filename> and <filename>/var/log/messages</filename>.
es_es: Si está cansado de esperar, presione las teclas <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> para abrir otra <firstterm>consola virtual</firstterm> e inicie sesión nuevamente. Después de todo, es un sistema multiusuario y multitarea. Sin embargo, probablemente, estos comandos mostrarán mensajes en su pantalla mientras se ejecutan; puede escribir <command>clear</command> en el prompt para borrar la pantalla. Una vez se hayan ejecutado, es posible que desee ver el contenido de <filename>/var/mail/root</filename> y <filename>/var/log/messages</filename>.

source: Running such commands is part of system administration—and as a single user of a <trademark class="registered">UNIX</trademark> system, you are your own system administrator. Virtually everything you need to be <systemitem class="username">root</systemitem> to do is system administration. Such responsibilities are not covered very well even in those big fat books on <trademark class="registered">UNIX</trademark>, which seem to devote a lot of space to pulling down menus in windows managers. You might want to get one of the two leading books on systems administration, either Evi Nemeth et.al.'s <citetitle>UNIX System Administration Handbook</citetitle> (Prentice-Hall, 1995, ISBN 0-13-15051-7)—the second edition with the red cover; or Æleen Frisch's <citetitle>Essential System Administration</citetitle> (O'Reilly &amp; Associates, 2002, ISBN 0-596-00343-9). I used Nemeth.
es_es: La ejecución de estos comandos forma parte de la administración del sistema—y como principal usuario de su sistema <trademark class="registered">UNIX</trademark>, usted es su propio administrador. Prácticamente todo lo que necesitar hacer como <systemitem class="username">root</systemitem> es administrar el sistema. Tales responsabilidades no están cubiertas muy bien, ni siquiera en esos libros enormes sobre <trademark class="registered">UNIX</trademark>, los cuales parecen decir mucho espacio en bajar menús en los administradores de ventanas. Es posible que desee obtener uno de los dos principales libros sobre administración de sistemas, ya sea el <citetitle>UNIX System Administration Handbook</citetitle> (Prentice-Hall, 1995, ISBN 0-13-15051-7)—la segunda edición con la cubierta roja, de Evi Nemeth et.al.'s o el <citetitle>Essential System Administration</citetitle> (O'Reilly &amp; Associates, 2002, ISBN 0-596-00343-9) de Æleen Frisch. Yo utilicé el libro de Nemeth.

source: Editing Text
es_es: Editando texto
