Repository: doc-br/translate
Catalog: articles/*/new-users.po
Languages: es_es

source: To configure your system, you need to edit text files. Most of them will be in the <filename>/etc</filename> directory; and you will need to <command>su</command> to <systemitem class="username">root</systemitem> to be able to change them. You can use the easy <command>ee</command>, but in the long run the text editor <command>vi</command> is worth learning. There is an excellent tutorial on vi in <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, if you have the system sources installed.
es_es: Para configurar su sistema, necesita editar archivos de texto. La mayoría estarán en el directorio <filename>/etc</filename>; y necesitará utilizar el comando <command>su</command> para acceder como usuario <systemitem class="username">root</systemitem> y así poder editarlos. Puede utiliazr un editor de texto simple, como <command>ee</command>, pero a largo plazo, se recomienda aprender a utilizar el editor de texto <command>vi</command>. Hay un excelente tutorial de vi en el directorio <filename>/usr/src/contrib/nvi/docs/tutorial</filename>, si tiene el código fuente del sistema instalado.

source: Before you edit a file, you should probably back it up. Suppose you want to edit <filename>/etc/rc.conf</filename>. You could just use <command>cd /etc</command> to get to the <filename>/etc</filename> directory and do:
es_es: Antes de editar un archivo, se recomienda crear una copia de seguridad del mismo. Suponga que desea editar el archivo <filename>/etc/rc.conf</filename>. Podría usar únicamente el comando <command>cd /etc</command> para acceder al directorio <filename>/etc</filename> y utilizar el siguiente comando:

source: This would copy <filename>rc.conf</filename> to <filename>rc.conf.orig</filename>, and you could later copy <filename>rc.conf.orig</filename> to <filename>rc.conf</filename> to recover the original. But even better would be moving (renaming) and then copying back:
es_es: Esto copiaría <filename>rc.conf</filename> a <filename>rc.conf.orig</filename>, y después usted podría copiar <filename>rc.conf.orig</filename> a <filename>rc.conf</filename> para recuperar el original. Pero sería todavía mejor mover (renombrar) y luego copiar de nuevo:

source: because <command>mv</command> preserves the original date and owner of the file. You can now edit <filename>rc.conf</filename>. If you want the original back, you would then <userinput>mv rc.conf rc.conf.myedit</userinput> (assuming you want to preserve your edited version) and then
es_es: porque el comando <command>mv</command> conserva la fecha original y el propietario del archivo. Ahora puede editar <filename>rc.conf</filename>. Si desea recuperar el original, entonces utilice el comando <userinput>mv rc.conf rc.conf.myedit</userinput> (suponiendo que desea conservar la versión que ha editado) y luego:

source: to put things back the way they were.
es_es: para dejar las cosas como estaban.

source: To edit a file, type
es_es: Para editar un fichero, escriba

source: Move through the text with the arrow keys. <keycap>Esc</keycap> (the escape key) puts <command>vi</command> in command mode. Here are some commands:
es_es: Desplacese por el texto con las teclas de desplazamiento. <keycap>Esc</keycap> (la tecla escape) pone a <command>vi</command> en modo comando. Aquí algunos comandos:

source: delete letter the cursor is on
es_es: borra la letra que se encuentre en la posición del cursor

source: delete the entire line (even if it wraps on the screen)
es_es: elimina la línea entera (incluso si no aparece por completo en la pantalla)

source: insert text at the cursor
es_es: inserta texto en la posición del cursor

source: insert text after the cursor
es_es: inserta texto después del cursor

source: Once you type <command>i</command> or <command>a</command>, you can enter text. <command>Esc</command> puts you back in command mode where you can type
es_es: Cuando escriba <command>i</command> o <command>a</command>, entonces podrá insertar texto. Si presiona la tecla <command>Esc</command>, le pondrá en modo comando, donde podrá insertar más comandos

source: to write your changes to disk and continue editing
es_es: para guardar los cambios en el disco y continuar con la edición

source: to write and quit
es_es: para grabar y salir

source: to quit without saving changes
es_es: para salir sin grabar los cambios

source: to move the cursor to <replaceable>text</replaceable>; <command>/</command><keycap>Enter</keycap> (the enter key) to find the next instance of <replaceable>text</replaceable>.
es_es: para mover el cursor a la primera coincidencia de la palabra <replaceable>text</replaceable>; utilice la combinación <command>/</command><keycap>Enter</keycap> (la tecla enter) para encontrar la siguiente coincidencia de la palabra <replaceable>text</replaceable>.

source: to go to the end of the file
es_es: para ir al final del archivo

source: to go to line <replaceable>n</replaceable> in the file, where <replaceable>n</replaceable> is a number
es_es: para ir a la línea <replaceable>n</replaceable> en el archivo, donde <replaceable>n</replaceable> es un número

source: to redraw the screen
es_es: para recargar la pantalla

source: <keycombo> <keycap>Ctrl</keycap> <keycap>b</keycap> </keycombo> and <keycombo> <keycap>Ctrl</keycap> <keycap>f</keycap> </keycombo>
es_es: <keycombo> <keycap>Ctrl</keycap> <keycap>b</keycap> </keycombo> y <keycombo> <keycap>Ctrl</keycap> <keycap>f</keycap> </keycombo>

source: go back and forward a screen, as they do with <command>more</command> and <command>view</command>.
es_es: retrocede y avanza una pantalla, como los comandos <command>more</command> y <command>view</command>.

source: Practice with <command>vi</command> in your home directory by creating a new file with <command>vi <replaceable>filename</replaceable></command> and adding and deleting text, saving the file, and calling it up again. <command>vi</command> delivers some surprises because it is really quite complex, and sometimes you will inadvertently issue a command that will do something you do not expect. (Some people actually like <command>vi</command>—it is more powerful than DOS EDIT—find out about <command>:r</command>.) Use <keycap>Esc</keycap> one or more times to be sure you are in command mode and proceed from there when it gives you trouble, save often with <command>:w</command>, and use <command>:q!</command> to get out and start over (from your last <command>:w</command>) when you need to.
es_es: Practique con el comando <command>vi</command> en su directorio personal creando un nuevo archivo con el comando <command>vi <replaceable>filename</replaceable></command>, añadiendo y quitando texto, guardando el archivo y abriendolo de nuevo. El comando <command>vi</command> ofrece algunas sorpresas debido a su complejidad y, a veces, usted ejecutará inadvertidamente un comando que hará algo que no espera. (A algunas personas les gusta <command>vi</command>—es más poderoso que DOS EDIT—para saber más sobre el comando <command>:r</command>) Pulse la tecla <keycap>Esc</keycap> varias veces para asegurarse de estar en modo comando y proceda desde ese modo cuando tenga algun problema, guarde a menudo con <command>:w</command>, y utilice <command>:q!</command> para salir sin guardar y empezar de nuevo (desde su último<command>:w</command>) cuando lo necesite.

source: Now you can <command>cd</command> to <filename>/etc</filename>, <command>su</command> to <systemitem class="username">root</systemitem>, use <command>vi</command> to edit the file <filename>/etc/group</filename>, and add a user to <systemitem class="groupname">wheel</systemitem> so the user has root privileges. Just add a comma and the user's login name to the end of the first line in the file, press <keycap>Esc</keycap>, and use <command>:wq</command> to write the file to disk and quit. Instantly effective. (You did not put a space after the comma, did you?)
es_es: Ahora puede utilizar el comando <command>cd</command> para ir a <filename>/etc</filename>, utilizar el comando <command>su</command> para acceder como usuario <systemitem class="username">root</systemitem>, use el comando <command>vi</command> para editar el archivo <filename>/etc/group</filename>, y añada un usuario al grupo <systemitem class="groupname">wheel</systemitem> para que el usuario tenga privilegios de root. Simplemente añada una coma y el nombre de usuario con el que inicia sesión al final de la primera línea del archivo, presione la tecla <keycap>Esc</keycap>, y teclee <command>:wq</command> para guardar el archivo en disco y salir. Eficacia instantanea. (No puso un espacio después de la coma, ¿verdad?)

source: Other Useful Commands
es_es: Otros comandos útiles

source: shows file space and mounted systems.
es_es: muestra el espacio en disco y los sistemas de archivos montados

source: shows processes running. <command>ps ax</command> is a narrower form.
es_es: muestra los procesos que hay en ejecución. <command>ps ax</command> es la forma reducida.

source: removes a directory <replaceable>dir</replaceable> and all subdirectories—careful!
es_es: elimina el directorio <replaceable>dir</replaceable> y todos los subdirectorios—¡uselo con cuidado!

source: lists files in the current directory and all subdirectories; I used a variant, <command>ls -AFR &gt; where.txt</command>, to get a list of all the files in <filename>/</filename> and (separately) <filename>/usr</filename> before I found better ways to find files.
es_es: lista los archivos en el directorio actual; he utilizado una variante del comando, <command>ls -AFR &gt; where.txt</command>, para obtener una lista de todos los archivos en el directorio <filename>/</filename> y <filename>/usr</filename> (por separado), hasta que encuentre una forma mejor de encontrar archivos.

source: to change user's password (or <systemitem class="username">root</systemitem>'s password)
es_es: para cambiar la contraseña del usuario (o la contraseña del usuario <systemitem class="username">root</systemitem>)

source: manual page on the <trademark class="registered">UNIX</trademark> filesystem
es_es: muestra las páginas del manual para el sistema de archivos <trademark class="registered">UNIX</trademark> y su estructura jerárquica

source: Use <command>find</command> to locate <filename>filename</filename> in <filename>/usr</filename> or any of its subdirectories with
es_es: Utilice el comando <command>find</command> para buscar <filename>filename</filename> en el directorio <filename>/usr</filename> o en cualquier de sus subdirectorios con:

source: You can use <literal>*</literal> as a wildcard in <parameter>"<replaceable>filename</replaceable>"</parameter> (which should be in quotes). If you tell <command>find</command> to search in <filename>/</filename> instead of <filename>/usr</filename> it will look for the file(s) on all mounted filesystems, including the CDROM and the DOS partition.
es_es: Puede utilizar el carácter <literal>*</literal> como comodín en <parameter>"<replaceable>filename</replaceable>"</parameter> (debe estar entrecomillado). Si utiliza el comando <command>find</command> para buscar en el directorio <filename>/</filename> en lugar de <filename>/usr</filename>, buscará en todos los sistemas de archivos montados, incluido el CDROM y la partición DOS.

source: An excellent book that explains <trademark class="registered">UNIX</trademark> commands and utilities is Abrahams &amp; Larson, <citetitle>Unix for the Impatient</citetitle> (2nd ed., Addison-Wesley, 1996). There is also a lot of <trademark class="registered">UNIX</trademark> information on the Internet.
es_es: Un excelente libro que explica los comandos y utilidades de <trademark class="registered">UNIX</trademark> es <citetitle>Unix for the Impatient</citetitle> (2ª ed., Addison-Wesley, 1996) de Abrahams & Larson. También hay mucha información de <trademark class="registered">UNIX</trademark> en Internet.

source: Next Steps
es_es: Próximos pasos

source: You should now have the tools you need to get around and edit files, so you can get everything up and running. There is a great deal of information in the FreeBSD handbook (which is probably on your hard drive) and <link xlink:href="@@URL_RELPREFIX@@/index.html">FreeBSD's web site</link>. A wide variety of packages and ports are on the CDROM as well as the web site. The handbook tells you more about how to use them (get the package if it exists, with <command>pkg add <replaceable>packagename</replaceable></command>, where <replaceable>packagename</replaceable> is the filename of the package). The CDROM has lists of the packages and ports with brief descriptions in <filename>cdrom/packages/index</filename>, <filename>cdrom/packages/index.txt</filename>, and <filename>cdrom/ports/index</filename>, with fuller descriptions in <filename>/cdrom/ports/*/*/pkg/DESCR</filename>, where the <literal>*</literal>s represent subdirectories of kinds of programs and program names respectively.
es_es: Ahora debería de tener las herramientas necesarias para moverse y editar archivos, de esta forma, podrá poner todo en funcionamiento. Hay una gran cantidad de información en el Handbook de FreeBSD (es muy probable que esté en su disco duro) y en el <link xlink:href="@@URL_RELPREFIX@@/index.html">sitio web de FreeBSD</link>. También hay una gran variedad de paquetes y ports en el CDROM y en el sitio web. El Handbook le brinda información sobre cómo usarlos (obtenga el paquete, si existe, con el comando <command>pkg add <replaceable>nombre-del-paquete</replaceable></command>, donde <replaceable>nombre-del-paquete</replaceable> es el nombre del archivo del paquete). El CDROM dispone de un listado con los paquetes y ports con unas breves descripciones en la ruta <filename>cdrom/packages/index</filename>, <filename>cdrom/packages/index.txt</filename> y <filename>cdrom/ports/index</filename>, con descripciones más completas en <filename>/cdrom/ports/*/*/pkg/DESCR</filename> donde los caracteres <literal>*</literal> representan los subdirectorios de los tipos de programas y nombre de los programas respectivamente.

source: If you find the handbook too sophisticated (what with <command>lndir</command> and all) on installing ports from the CDROM, here is what usually works:
es_es: Si encuentra el manual demasiado sofisticado (con el comando <command>lndir</command> y el resto) al instalar los ports desde el CDROM, esto es lo que normalmente funciona:

source: Find the port you want, say <command>kermit</command>. There will be a directory for it on the CDROM. Copy the subdirectory to <filename>/usr/local</filename> (a good place for software you add that should be available to all users) with:
es_es: Localice el port que desea, por ejemplo, <command>kermit</command>. Habrá un directorio para él en el CDROM. Copie el subdirectorio a <filename>/usr/local</filename> (es un buen lugar para el software que instale y que deba estar disponible para todos los usuarios) con:

source: This should result in a <filename>/usr/local/kermit</filename> subdirectory that has all the files that the <command>kermit</command> subdirectory on the CDROM has.
es_es: Esto debería producir el subdirectorio <filename>/usr/local/kermit</filename> con todos los archivos que tenia el subdirectorio <command>kermit</command> en el CDROM.

source: Next, create the directory <filename>/usr/ports/distfiles</filename> if it does not already exist using <command>mkdir</command>. Now check <filename>/cdrom/ports/distfiles</filename> for a file with a name that indicates it is the port you want. Copy that file to <filename>/usr/ports/distfiles</filename>; in recent versions you can skip this step, as FreeBSD will do it for you. In the case of <command>kermit</command>, there is no distfile.
es_es: A continuación, cree el directorio <filename>/usr/ports/distfiles</filename> si aún no existe usando el comando <command>mkdir</command>. Ahora busque en el directorio <filename>/cdrom/ports/distfiles</filename> un archivo que tenga el nombre del port que desea. Copie ese archivo a <filename>/usr/ports/distfiles</filename>; en las versiones más recientes, puede omitir este paso, FreeBSD lo hará por usted. En el caso de <command>kermit</command>, no existe el distfile.

source: Then <command>cd</command> to the subdirectory of <filename>/usr/local/kermit</filename> that has the file <filename>Makefile</filename>. Type
es_es: A continuación, utilice el comando <command>cd</command> para acceder al subdirectorio <filename>/usr/local/kermit</filename>, el cual contieneel archivo <filename>Makefile</filename>. Escriba:

source: During this process the port will FTP to get any compressed files it needs that it did not find on the CDROM or in <filename>/usr/ports/distfiles</filename>. If you do not have your network running yet and there was no file for the port in <filename>/cdrom/ports/distfiles</filename>, you will have to get the distfile using another machine and copy it to <filename>/usr/ports/distfiles</filename>. Read <filename>Makefile</filename> (with <command>cat</command> or <command>more</command> or <command>view</command>) to find out where to go (the master distribution site) to get the file and what its name is. (Use binary file transfers!) Then go back to <filename>/usr/local/kermit</filename>, find the directory with <filename>Makefile</filename>, and type <command>make all install</command>.
es_es: Durante este proceso, el port utilizará el FTP para obtener los archivos comprimidos que necesita y que no encontró en el CDROM o en <filename>/usr/ports/distfiles</filename>. Si su red aún no está configurada y no hay ningún archivo para el port en <filename>/cdrom/ports/distfiles</filename>, tendrá que coger el distfile usando otro ordenador y copiarlo manualmente a <filename>/usr/ports/distfiles</filename>. Lea el <filename>Makefile</filename> (con <command>cat</command>, <command>more</command> o <command>view</command>) para averiguar dónde está el archivo y su nombre. (¡Utilice transferencias binarias de archivos!) A continuación, vuelva al directorio <filename>/usr/local/kermit</filename>, busque el directorio que contenga el archivo <filename>Makefile</filename> y ejecute el comando <command>make all install</command>.

source: Your Working Environment
es_es: Su entorno de trabajo

source: Your shell is the most important part of your working environment. The shell is what interprets the commands you type on the command line, and thus communicates with the rest of the operating system. You can also write shell scripts a series of commands to be run without intervention.
es_es: Su shell es la parte más importante de su entorno de trabajo. La shell interpreta los comandos que escribe en la línea de comandos y, por lo tanto, se comunica con el resto del sistema operativo. También puede escribir shell scripts, los cuales consisten en una serie de comandos que se ejecutarán sin intervención.

source: Two shells come installed with FreeBSD: <command>csh</command> and <command>sh</command>. <command>csh</command> is good for command-line work, but scripts should be written with <command>sh</command> (or <command>bash</command>). You can find out what shell you have by typing <command>echo $SHELL</command>.
es_es: Dos shells vienen instaladas con FreeBSD: <command>csh</command> y <command>sh</command>. La shell <command>csh</command> es buena para los trabajos que se realizan en la línea de comandos, pero los scripts deben escribirse con <command>sh</command> (o <command>bash</command>). Puede averiguar qué shell tiene ejecutando el comando <command>echo $SHELL</command>.

source: The <command>csh</command> shell is okay, but <command>tcsh</command> does everything <command>csh</command> does and more. It allows you to recall commands with the arrow keys and edit them. It has tab-key completion of filenames (<command>csh</command> uses <keycap>Esc</keycap>), and it lets you switch to the directory you were last in with <command>cd -</command>. It is also much easier to alter your prompt with <command>tcsh</command>. It makes life a lot easier.
es_es: La shell <command>csh</command> está bien, pero la shell <command>tcsh</command> hace lo mismo que <command>csh</command> y mucho más. Permite obtener comandos usandos anteriormente con las teclas de flecha y editarlos. Permite utiliza la tabulación para completar el nombre de los archivos (la shell <command>csh</command> utiliza la tecla <keycap>Esc</keycap>), y le permite cambiar al directorio en el que estuvo por última vez con el comando <command>cd -</command>. También es mucho más sencillo configurar su prompt con la shell <command>tcsh</command>. La shell tcsh le hará la vida mucho más fácil.

source: Here are the three steps for installing a new shell:
es_es: Aquí tiene los 3 pasos necesarios para instalar una nueva shell:

source: Install the shell as a port or a package, just as you would any other port or package.
es_es: Instale la shell como un port o paquete, tal como lo haría con cualquier otro port o paquete.

source: Use <command>chsh</command> to change your shell to <command>tcsh</command> permanently, or type <command>tcsh</command> at the prompt to change your shell without logging in again.
es_es: Use el comando <command>chsh</command> para cambiar su shell a <command>tcsh</command> de forma permanente, o escriba <command>tcsh</command> en el prompt para cambiar su shell sin tener que iniciar sesión de nuevo.

source: It can be dangerous to change <systemitem class="username">root</systemitem>'s shell to something other than <command>sh</command> or <command>csh</command> on early versions of FreeBSD and many other versions of <trademark class="registered">UNIX</trademark>; you may not have a working shell when the system puts you into single user mode. The solution is to use <command>su -m</command> to become <systemitem class="username">root</systemitem>, which will give you the <command>tcsh</command> as <systemitem class="username">root</systemitem>, because the shell is part of the environment. You can make this permanent by adding it to your <filename>.tcshrc</filename> as an alias with:
es_es: En las primeras versiones de FreeBSD, y también en muchas otras versiones de <trademark class="registered">UNIX</trademark>, puede ser peligroso cambiar la shell del usuario <systemitem class="username">root</systemitem> a otra que no sea <command>sh</command> o <command>csh</command>; es posible que no tenga una shell funcional cuando el sistema entre en modo single user. La solución es usar el comando <command>su -m</command> para convertirse en el usuario <systemitem class="username">root</systemitem>, que le dará acceso a la shell <command>tcsh</command> como <systemitem class="username">root</systemitem>, porque la shell es parte del entorno. Puede hacer esto permanente añadiendolo a su archivo <filename>.tcshrc</filename> como un alias, de la siguiente forma:

source: When <command>tcsh</command> starts up, it will read the <filename>/etc/csh.cshrc</filename> and <filename>/etc/csh.login</filename> files, as does <command>csh</command>. It will also read <filename>.login</filename> in your home directory and <filename>.cshrc</filename> as well, unless you provide a <filename>.tcshrc</filename>. This you can do by simply copying <filename>.cshrc</filename> to <filename>.tcshrc</filename>.
es_es: Cuando se inicie <command>tcsh</command>, leerá los archivos <filename>/etc/csh.cshrc</filename> y <filename>/etc/csh.login</filename>, igual que <command>csh</command>. También leerá el archivo <filename>.login</filename> de su directorio home, y también el archivo <filename>.cshrc</filename>, a menos que tenga el archivo <filename>.tcshrc</filename>. Puede hacerlo simplemente copiando el archivo <filename>.cshrc</filename> a <filename>.tcshrc</filename>.
