Repository: doc-br/translate
Catalog: articles/*/rc-scripting.po
Languages: es

source: Some programs are in fact executable scripts. The system runs such a script by starting its interpreter and passing the name of the script to it as a command-line argument. This is reflected in the list of processes, which can confuse <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. You should additionally set <envar>command_interpreter</envar> to let <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> know the actual name of the process if <envar>$command</envar> is a script.
es: Algunos programas son de hecho scripts ejecutables. El sistema ejecuta dicho script iniciando su intérprete y pasándole el nombre del script como un argumento de línea de comandos. Esto se refleja en la lista de procesos, que pueden confundir <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Además, debe configurar <envar>command_interpreter</envar> dejar<citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> conocer el nombre real del proceso si <envar>$command</envar> es un script.

source: For each <filename>rc.d</filename> script, there is an optional <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variable that takes precedence over <envar>command</envar>. Its name is constructed as follows: <envar>${name}_program</envar>, where <envar>name</envar> is the mandatory variable we discussed <link linkend="name-var">earlier</link>. E.g., in this case it will be <envar>mumbled_program</envar>. It is <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> that arranges <envar>${name}_program</envar> to override <envar>command</envar>.
es: Para cada <filename>rc.d</filename> Script, hay un opcional <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> Variable que tiene prioridad sobre <envar>command</envar>. Su nombre se construye de la siguiente manera: <envar>${name}_program</envar>, donde <envar>name</envar> es la variable obligatoria que discutimos <link linkend="name-var">earlier</link>. Por ejemplo, en este caso será<envar>mumbled_program</envar>. Es <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> que arregla<envar>${name}_program</envar> para anular <envar>command</envar>.

source: Of course, <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> will permit you to set <envar>${name}_program</envar> from <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> or the script itself even if <envar>command</envar> is unset. In that case, the special properties of <envar>${name}_program</envar> are lost, and it becomes an ordinary variable your script can use for its own purposes. However, the sole use of <envar>${name}_program</envar> is discouraged because using it together with <envar>command</envar> became an idiom of <filename>rc.d</filename> scripting.
es: Por supuesto, <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> te permitirá establecer <envar>${name}_program</envar> from <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> o el propio script incluso si<envar>command</envar> es desarmado. En ese caso, las propiedades especiales de<envar>${name}_program</envar> se pierden y se convierte en una variable ordinaria que su script puede utilizar para sus propios fines. Sin embargo, el uso exclusivo de <envar>${name}_program</envar> se desaconseja porque usarlo junto con <envar>command</envar> se convirtió en un modismo de <filename>rc.d</filename> scripting.

source: For more detailed information on default methods, refer to <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es: Para obtener información más detallada sobre los métodos predeterminados, consulte <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Startup and shutdown of an advanced daemon
es: Inicio y cierre de un demonio avanzado

source: Let us add some meat onto the bones of the previous script and make it more complex and featureful. The default methods can do a good job for us, but we may need some of their aspects tweaked. Now we will learn how to tune the default methods to our needs.
es: Agreguemos un poco de carne a los huesos del guión anterior y hagámoslo más complejo y característico. Los métodos predeterminados pueden hacer un buen trabajo para nosotros, pero es posible que necesitemos algunos de sus aspectos ajustados. Ahora aprenderemos cómo ajustar los métodos predeterminados a nuestras necesidades.

source: Additional arguments to <envar>$command</envar> can be passed in <envar>command_args</envar>. They will be added to the command line after <envar>$mumbled_flags</envar>. Since the final command line is passed to <command>eval</command> for its actual execution, input and output redirections can be specified in <envar>command_args</envar>.
es: Argumentos adicionales a <envar>$command</envar> se puede pasar en <envar>command_args</envar>. se agregarán a la línea de comando después <envar>$mumbled_flags</envar>.Dado que la línea de comando final se pasa a <command>eval</command> para su ejecución real, las redirecciones de entrada y salida se pueden especificar en <envar>command_args</envar>.

source: <emphasis>Never</emphasis> include dashed options, like <option>-X</option> or <option>--foo</option>, in <envar>command_args</envar>. The contents of <envar>command_args</envar> will appear at the end of the final command line, hence they are likely to follow arguments present in <envar>${name}_flags</envar>; but most commands will not recognize dashed options after ordinary arguments. A better way of passing additional options to <envar>$command</envar> is to add them to the beginning of <envar>${name}_flags</envar>. Another way is to modify <envar>rc_flags</envar> <link linkend="rc-flags">as shown later</link>.
es: <emphasis>Never</emphasis>incluir opciones discontinuas, como <option>-X</option> o <option>--foo</option>, en <envar>command_args</envar>. Los contenidos de <envar>command_args</envar> aparecerá al final de la línea de comando final, por lo que es probable que sigan los argumentos presentes en <envar>${name}_flags</envar>; pero la mayoría de los comandos no reconocerán las opciones discontinuas después de los argumentos ordinarios. Una mejor forma de pasar opciones adicionales a <envar>$command</envar> Es agregarlos al principio de <envar>${name}_flags</envar>. Otra forma es modificar<envar>rc_flags</envar> <link linkend="rc-flags">como se muestra más adelante</link>.

source: A good-mannered daemon should create a <emphasis>pidfile</emphasis> so that its process can be found more easily and reliably. The variable <envar>pidfile</envar>, if set, tells <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> where it can find the pidfile for its default methods to use.
es: Un demonio de buena educación debe crear un <emphasis>pidfile</emphasis> para que su proceso se pueda encontrar de manera más fácil y confiable. La variable <envar>pidfile</envar>,Si está configurado, dice <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> donde puede encontrar el archivo pid para utilizar sus métodos predeterminados.

source: In fact, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> will also use the pidfile to see if the daemon is already running before starting it. This check can be skipped by using the <option>faststart</option> argument.
es: De hecho, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> también usará el archivo pid para ver si el demonio ya se está ejecutando antes de iniciarlo. Esta verificación se puede omitir utilizando el <option>faststart</option> argumento.

source: If the daemon cannot run unless certain files exist, just list them in <envar>required_files</envar>, and <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> will check that those files do exist before starting the daemon. There also are <envar>required_dirs</envar> and <envar>required_vars</envar> for directories and environment variables, respectively. They all are described in detail in <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es: Si el demonio no se puede ejecutar a menos que existan ciertos archivos, simplemente enumerelos en <envar>required_files</envar>, y <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> comprobará que esos archivos existen antes de iniciar el demonio. Tambien hay <envar>required_dirs</envar> y <envar>required_vars</envar> para directorios y variables de entorno, respectivamente. Todos ellos se describen en detalle en <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: The default method from <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> can be forced to skip the prerequisite checks by using <option>forcestart</option> as the argument to the script.
es: El método predeterminado de <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> se puede obligar a omitir las comprobaciones de requisitos previos utilizando <option>forcestart</option> como argumento del script.

source: We can customize signals to send to the daemon in case they differ from the well-known ones. In particular, <envar>sig_reload</envar> specifies the signal that makes the daemon reload its configuration; it is <symbol>SIGHUP</symbol> by default. Another signal is sent to stop the daemon process; the default is <symbol>SIGTERM</symbol>, but this can be changed by setting <envar>sig_stop</envar> appropriately.
es: Podemos personalizar las señales para enviar al demonio en caso de que difieran de las conocidas. En particular,<envar>sig_reload</envar> especifica la señal que hace que el demonio recargue su configuración; es <symbol>SIGHUP</symbol> por defecto. Se envía otra señal para detener el proceso del demonio; el valor predeterminado es <symbol>SIGTERM</symbol>, pero esto se puede cambiar configurando <envar>sig_stop</envar> adecuadamente.

source: The signal names should be specified to <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> without the <literal>SIG</literal> prefix, as it is shown in the example. The FreeBSD version of <citerefentry><refentrytitle>kill</refentrytitle><manvolnum>1</manvolnum></citerefentry> can recognize the <literal>SIG</literal> prefix, but the versions from other OS types may not.
es: Los nombres de las señales deben especificarse para <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> sin el <literal>SIG</literal> prefijo, como se muestra en el ejemplo. La versión FreeBSD de <citerefentry><refentrytitle>kill</refentrytitle><manvolnum>1</manvolnum></citerefentry> puede reconocer el<literal>SIG</literal> prefijo, pero es posible que las versiones de otros tipos de sistemas operativos no.

source: Performing additional tasks before or after the default methods is easy. For each command-argument supported by our script, we can define <envar><replaceable>argument</replaceable>_precmd</envar> and <envar><replaceable>argument</replaceable>_postcmd</envar>. These <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> commands are invoked before and after the respective method, as it is evident from their names.
es: Es fácil realizar tareas adicionales antes o después de los métodos predeterminados. Para cada comando-argumento soportado por nuestro script, podemos definir<envar><replaceable>argumento</replaceable>_precmd</envar> and <envar><replaceable>argument</replaceable>_postcmd</envar>. Estos <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> los comandos se invocan antes y después del método respectivo, como se desprende de sus nombres.

source: Overriding a default method with a custom <envar><replaceable>argument</replaceable>_cmd</envar> still does not prevent us from making use of <envar><replaceable>argument</replaceable>_precmd</envar> or <envar><replaceable>argument</replaceable>_postcmd</envar> if we need to. In particular, the former is good for checking custom, sophisticated conditions that should be met before performing the command itself. Using <envar><replaceable>argument</replaceable>_precmd</envar> along with <envar><replaceable>argument</replaceable>_cmd</envar> lets us logically separate the checks from the action.
es: Anulando un método predeterminado con un personalizado <envar><replaceable>argument</replaceable>_cmd</envar> todavía no nos impide hacer uso de <envar><replaceable>argument</replaceable>_precmd</envar> or <envar><replaceable>argument</replaceable>_postcmd</envar> si es necesario. En particular, el primero es bueno para verificar las condiciones sofisticadas y personalizadas que deben cumplirse antes de ejecutar el comando en sí. Utilizando <envar><replaceable>argument</replaceable>_precmd</envar> junto con <envar><replaceable>argument</replaceable>_cmd</envar> nos permite separar lógicamente los controles de la acción.

source: Do not forget that you can cram any valid <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expressions into the methods, pre-, and post-commands you define. Just invoking a function that makes the real job is a good style in most cases, but never let style limit your understanding of what is going on behind the curtain.
es: No olvide que puede abarrotar cualquier <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expresiones en los métodos, pre y post comandos que defina. Invocar simplemente una función que hace el trabajo real es un buen estilo en la mayoría de los casos, pero nunca deje que el estilo limite su comprensión de lo que sucede detrás de la cortina.

source: If we would like to implement custom arguments, which can also be thought of as <emphasis>commands</emphasis> to our script, we need to list them in <envar>extra_commands</envar> and provide methods to handle them.
es: Si quisiéramos implementar argumentos personalizados, que también se pueden considerar como <emphasis>commands</emphasis> a nuestro script, debemos incluirlos en <envar>extra_commands</envar> Y proporcionar métodos para manejarlos.

source: The <option>reload</option> command is special. On the one hand, it has a preset method in <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. On the other hand, <option>reload</option> is not offered by default. The reason is that not all daemons use the same reload mechanism and some have nothing to reload at all. So we need to ask explicitly that the builtin functionality be provided. We can do so via <envar>extra_commands</envar>.
es: El <option>reload</option>comando es especial. Por un lado, tiene un método preestablecido en <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Por otra parte,<option>reload</option> no se ofrece de forma predeterminada. La razón es que no todos los demonios usan el mismo mecanismo de recarga y algunos no tienen nada que recargar. Por lo tanto, debemos pedir explícitamente que se proporcione la funcionalidad incorporada. Podemos hacerlo a través de <envar>extra_commands</envar>.

source: What do we get from the default method for <option>reload</option>? Quite often daemons reload their configuration upon reception of a signal — typically, <symbol>SIGHUP</symbol>. Therefore <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> attempts to reload the daemon by sending a signal to it. The signal is preset to <symbol>SIGHUP</symbol> but can be customized via <envar>sig_reload</envar> if necessary.
es: ¿Qué obtenemos del método predeterminado para <option>reload</option>? Muy a menudo, los demonios recargan su configuración al recibir una señal, por lo general, <symbol>SIGHUP</symbol>.Por lo tanto <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> intenta recargar el demonio enviándole una señal. La señal está preconfigurada para <symbol>SIGHUP</symbol> pero se puede personalizar a través de <envar>sig_reload</envar> si necesario.

source: Our script supports two non-standard commands, <option>plugh</option> and <option>xyzzy</option>. We saw them listed in <envar>extra_commands</envar>, and now it is time to provide methods for them. The method for <option>xyzzy</option> is just inlined while that for <option>plugh</option> is implemented as the <function>mumbled_plugh</function> function.
es: Nuestro script admite dos comandos no estándar, <option>plugh</option> y <option>xyzzy</option>. Los vimos enumerados en <envar>extra_commands</envar>, y ahora es el momento de proporcionarles métodos. El método para <option>xyzzy</option> está en línea mientras que para <option>plugh</option> se implementa como el <function>mumbled_plugh</function> función.

source: Non-standard commands are not invoked during startup or shutdown. Usually they are for the system admin's convenience. They can also be used from other subsystems, e.g., <citerefentry><refentrytitle>devd</refentrytitle><manvolnum>8</manvolnum></citerefentry> if specified in <citerefentry><refentrytitle>devd.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es: Los comandos no estándar no se invocan durante el inicio o el apagado. Por lo general, son para conveniencia del administrador del sistema. También se pueden utilizar desde otros subsistemas, por ejemplo, <citerefentry><refentrytitle>devd</refentrytitle><manvolnum>8</manvolnum></citerefentry> si se especifica en <citerefentry><refentrytitle>devd.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: The full list of available commands can be found in the usage line printed by <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> when the script is invoked without arguments. For example, here is the usage line from the script under study:
es: La lista completa de comandos disponibles se puede encontrar en la línea de uso impresa por <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> cuando se invoca el script sin argumentos. Por ejemplo, aquí está la línea de uso del script en estudio:

source: A script can invoke its own standard or non-standard commands if needed. This may look similar to calling functions, but we know that commands and shell functions are not always the same thing. For instance, <command>xyzzy</command> is not implemented as a function here. In addition, there can be a pre-command and post-command, which should be invoked orderly. So the proper way for a script to run its own command is by means of <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>, as shown in the example.
es: Un script puede invocar sus propios comandos estándar o no estándar si es necesario. Esto puede parecer similar a las funciones de llamada, pero sabemos que los comandos y las funciones del shell no siempre son lo mismo. Por ejemplo, <command>xyzzy</command> no se implementa como una función aquí. Además, puede haber un comando previo y posterior, que deben invocarse de manera ordenada. Entonces, la forma correcta para que un script ejecute su propio comando es mediante <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>, como se muestra en el ejemplo.

source: A handy function named <function>checkyesno</function> is provided by <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. It takes a variable name as its argument and returns a zero exit code if and only if the variable is set to <literal>YES</literal>, or <literal>TRUE</literal>, or <literal>ON</literal>, or <literal>1</literal>, case insensitive; a non-zero exit code is returned otherwise. In the latter case, the function tests the variable for being set to <literal>NO</literal>, <literal>FALSE</literal>, <literal>OFF</literal>, or <literal>0</literal>, case insensitive; it prints a warning message if the variable contains anything else, i.e., junk.
es: Una práctica función llamada <function>checkyesno</function> es proporcionado por <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>.Toma un nombre de variable como argumento y devuelve un código de salida cero si y solo si la variable se establece en <literal>SI</literal>, o <literal>VERDAD</literal>, o <literal>PRENDER</literal>, o <literal>1</literal>, no distingue entre mayúsculas y minúsculas; de lo contrario, se devuelve un código de salida distinto de cero. En el último caso, la función prueba que la variable esté configurada como <literal>NO</literal>, <literal>FALSO</literal>, <literal>APAGAR</literal>, o <literal>0</literal>, no distingue entre mayúsculas y minúsculas; imprime un mensaje de advertencia si la variable contiene algo más, es decir, basura.

source: Keep in mind that for <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> a zero exit code means true and a non-zero exit code means false.
es: Tenga en cuenta que para <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> un código de salida cero significa verdadero y un código de salida distinto de cero significa falso.

source: The <function>checkyesno</function> function takes a <emphasis>variable name</emphasis>. Do not pass the expanded <emphasis>value</emphasis> of a variable to it; it will not work as expected.
es: La <function>checkyesno</function> function takes a <emphasis>variable name</emphasis>. No pase el expandido <emphasis>value</emphasis> de una variable a él; no funcionará como se esperaba.

source: The following is the correct usage of <function>checkyesno</function>:
es: El siguiente es el uso correcto de <function>checkyesno</function>:

source: On the contrary, calling <function>checkyesno</function> as shown below will not work — at least not as expected:
es: Al contrario, llamando <function>checkyesno</function> como se muestra a continuación no funcionará, al menos no como se esperaba:

source: <anchor xml:id="rc-flags"/>We can affect the flags to be passed to <envar>$command</envar> by modifying <envar>rc_flags</envar> in <envar>$start_precmd</envar>.
es: <anchor xml:id="rc-flags"/>Podemos afectar las banderas que se pasarán a <envar>$command</envar> modificando<envar>rc_flags</envar> en <envar>$start_precmd</envar>.
