Repository: doc-br/translate
Catalog: articles/*/rc-scripting.po
Languages: es

source: <anchor xml:id="name-var"/>The mandatory variable <envar>name</envar> specifies the name of our script. It is required by <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. That is, each <filename>rc.d</filename> script <emphasis>must</emphasis> set <envar>name</envar> before it calls <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> functions.
es: <anchor xml:id="name-var"/>La variable obligatoria <envar>name</envar> especifica el nombre de nuestro script. Es requerido por <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Es decir, cada <filename>rc.d</filename> script <emphasis>must</emphasis> set <envar>name</envar> antes de que llame <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> funciones.

source: Now it is the right time to choose a unique name for our script once and for all. We will use it in a number of places while developing the script. For a start, let us give the same name to the script file, too.
es: Ahora es el momento adecuado para elegir un nombre único para nuestro script de una vez por todas. Lo usaremos en varios lugares mientras desarrollamos el guión. Para empezar, démosle también el mismo nombre al archivo de script.

source: The current style of <filename>rc.d</filename> scripting is to enclose values assigned to variables in double quotes. Keep in mind that it is just a style issue that may not always be applicable. You can safely omit quotes from around simple words without <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> metacharacters in them, while in certain cases you will need single quotes to prevent any interpretation of the value by <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. A programmer should be able to tell the language syntax from style conventions and use both of them wisely.
es: El estilo actual de <filename>rc.d</filename> la secuencia de comandos consiste en encerrar los valores asignados a las variables entre comillas dobles. Tenga en cuenta que es solo una cuestión de estilo que no siempre es aplicable. Puede omitir con seguridad las citas de las palabras simples sin<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> metacaracteres en ellos, mientras que en ciertos casos necesitará comillas simples para evitar cualquier interpretación del valor por <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Un programador debería poder distinguir la sintaxis del lenguaje de las convenciones de estilo y utilizar ambas con prudencia.

source: The main idea behind <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> is that an <filename>rc.d</filename> script provides handlers, or methods, for <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> to invoke. In particular, <option>start</option>, <option>stop</option>, and other arguments to an <filename>rc.d</filename> script are handled this way. A method is a <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expression stored in a variable named <envar><replaceable>argument</replaceable>_cmd</envar>, where <replaceable>argument</replaceable> corresponds to what can be specified on the script's command line. We will see later how <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> provides default methods for the standard arguments.
es: La idea principal detrás<citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> es eso un <filename>rc.d</filename>La secuencia de comandos proporciona controladores o métodos para <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> invocar. En particular, <option>start</option>, <option>stop</option>, y otros argumentos a un <filename>rc.d</filename>El script se maneja de esta manera. Un método es un <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expresión almacenada en una variable llamada <envar><replaceable>argument</replaceable>_cmd</envar>, dónde <replaceable>argument</replaceable>corresponde a lo que se puede especificar en la línea de comandos del script. Veremos luego como <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> proporciona métodos predeterminados para los argumentos estándar.

source: To make the code in <filename>rc.d</filename> more uniform, it is common to use <envar>${name}</envar> wherever appropriate. Thus a number of lines can be just copied from one script to another.
es: Para hacer el código en <filename>rc.d</filename> más uniforme, es común usar <envar>${name}</envar> donde sea apropiado. Por tanto, se pueden copiar varias líneas de un script a otro.

source: We should keep in mind that <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> provides default methods for the standard arguments. Consequently, we must override a standard method with a no-op <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expression if we want it to do nothing.
es: Debemos tener en cuenta que <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> proporciona métodos predeterminados para los argumentos estándar. En consecuencia, debemos anular un método estándar con un no-op <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> expresión si queremos que no haga nada.

source: The body of a sophisticated method can be implemented as a function. It is a good idea to make the function name meaningful.
es: El cuerpo de un método sofisticado se puede implementar como una función. Es una buena idea hacer que el nombre de la función sea significativo.

source: It is strongly recommended to add the prefix <envar>${name}</envar> to the names of all functions defined in our script so they never clash with the functions from <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> or another common include file.
es: Se recomienda encarecidamente agregar el prefijo <envar>${name}</envar> a los nombres de todas las funciones definidas en nuestro script para que nunca entren en conflicto con las funciones de <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> u otro archivo de inclusión común.

source: This call to <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> loads <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables. Our script makes no use of them yet, but it still is recommended to load <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> because there can be <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables controlling <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> itself.
es: Esta llamada a <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> cargas <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables. Nuestro script aún no los usa, pero aún se recomienda cargar <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>porque puede haber <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> control de variables <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> sí mismo.

source: Usually this is the last command in an <filename>rc.d</filename> script. It invokes the <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> machinery to perform the requested action using the variables and methods our script has provided.
es: Por lo general, este es el último comando de una <filename>rc.d</filename> script. Invoca el<citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> maquinaria para realizar la acción solicitada utilizando las variables y métodos que ha proporcionado nuestro script.

source: A configurable dummy script
es: Un script ficticio configurable

source: Now let us add some controls to our dummy script. As you may know, <filename>rc.d</filename> scripts are controlled with <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Fortunately, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> hides all the complications from us. The following script uses <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> via <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> to see whether it is enabled in the first place, and to fetch a message to show at boot time. These two tasks in fact are independent. On the one hand, an <filename>rc.d</filename> script can just support enabling and disabling its service. On the other hand, a mandatory <filename>rc.d</filename> script can have configuration variables. We will do both things in the same script though:
es: Ahora agreguemos algunos controles a nuestro script ficticio. Como podrias saber, <filename>rc.d</filename> slos scripts se controlan con <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.Por suerte, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> hides all the complications from nos. El siguiente script usa <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> via <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ver si está habilitado en primer lugar y obtener un mensaje para mostrar en el momento del arranque. De hecho, estas dos tareas son independientes. Por un lado, un<filename>rc.d</filename> El script solo puede admitir habilitar y deshabilitar su servicio. Por otro lado, una obligación<filename>rc.d</filename> El script puede tener variables de configuración. Sin embargo, haremos ambas cosas en el mismo script:

source: What changed in this example?
es: ¿Qué cambió en este ejemplo?

source: The variable <envar>rcvar</envar> specifies the name of the ON/OFF knob variable.
es: La variable <envar>rcvar</envar> especifica el nombre de la variable del mando ON/OFF.

source: Now <function>load_rc_config</function> is invoked earlier in the script, before any <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables are accessed.
es: Ahora <function>load_rc_config</function> se invoca anteriormente en el script, antes de cualquier <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> se accede a las variables.

source: While examining <filename>rc.d</filename> scripts, keep in mind that <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> defers the evaluation of expressions in a function until the latter is called. Therefore it is not an error to invoke <function>load_rc_config</function> as late as just before <function>run_rc_command</function> and still access <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables from the method functions exported to <function>run_rc_command</function>. This is because the method functions are to be called by <function>run_rc_command</function>, which is invoked <emphasis>after</emphasis> <function>load_rc_config</function>.
es: Mientras examina <filename>rc.d</filename> scripts, tenga en cuenta que<citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> difiere la evaluación de expresiones en una función hasta que se llama a esta última. Por tanto, no es un error invocar <function>load_rc_config</function> tan tarde como justo antes <function>run_rc_command</function> y todavía acceder <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables de las funciones de método exportadas a <function>un_rc_command</function>.esto se debe a que las funciones del método deben ser llamadas por <function>run_rc_command</function>, que se invoca<emphasis>despues</emphasis><function>load_rc_config</function>.

source: A warning will be emitted by <function>run_rc_command</function> if <envar>rcvar</envar> itself is set, but the indicated knob variable is unset. If your <filename>rc.d</filename> script is for the base system, you should add a default setting for the knob to <filename>/etc/defaults/rc.conf</filename> and document it in <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Otherwise it is your script that should provide a default setting for the knob. The canonical approach to the latter case is shown in the example.
es: Una advertencia será emitida por <function>run_rc_command</function> Si <envar>rcvar</envar> sí mismo está configurado, pero la variable de mando indicada no está configurada. Si tu <filename>rc.d</filename> El script es para el sistema base, debe agregar una configuración predeterminada para la perilla <filename>/etc/defaults/rc.conf</filename> y documentarlo en <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. De lo contrario, es su script el que debería proporcionar una configuración predeterminada para la perilla. El enfoque canónico del último caso se muestra en el ejemplo.

source: You can make <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> act as though the knob is set to <literal>ON</literal>, irrespective of its current setting, by prefixing the argument to the script with <literal>one</literal> or <literal>force</literal>, as in <option>onestart</option> or <option>forcestop</option>. Keep in mind though that <literal>force</literal> has other dangerous effects we will touch upon below, while <literal>one</literal> just overrides the ON/OFF knob. E.g., assume that <envar>dummy_enable</envar> is <literal>OFF</literal>. The following command will run the <option>start</option> method in spite of the setting:
es: Puedes hacer <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> actuar como si la perilla estuviera en <literal>ON</literal>,independientemente de su configuración actual, anteponiendo el argumento al script con <literal>one</literal> or <literal>force</literal>,como en <option>onestart</option> o <option>forcestop</option>. Tenga en cuenta que <literal>force</literal> tiene otros efectos peligrosos que veremos a continuación, mientras que <literal>uno</literal> simplemente anula la perilla ON / OFF. Por ejemplo, suponga que <envar>dummy_enable</envar> is <literal>OFF</literal>. El siguiente comando ejecutará el <option>start</option> método a pesar de la configuración:

source: Now the message to be shown at boot time is no longer hard-coded in the script. It is specified by an <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variable named <envar>dummy_msg</envar>. This is a trivial example of how <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables can control an <filename>rc.d</filename> script.
es: Ahora, el mensaje que se mostrará en el momento del arranque ya no está codificado en el script. Está especificado por un <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variable nombrada <envar>dummy_msg</envar>. Este es un ejemplo trivial de cómo <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>las variables pueden controlar un <filename>rc.d</filename> script.

source: The names of all <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables used exclusively by our script <emphasis>must</emphasis> have the same prefix: <envar>${name}_</envar>. For example: <envar>dummy_mode</envar>, <envar>dummy_state_file</envar>, and so on.
es: Los nombres de todos <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables utilizadas exclusivamente por nuestro script<emphasis>must</emphasis> tienen el mismo prefijo: <envar>${name}_</envar>. Por ejemplo: <envar>dummy_mode</envar>, <envar>dummy_state_file</envar>, y así.

source: While it is possible to use a shorter name internally, e.g., just <envar>msg</envar>, adding the unique prefix <envar>${name}_</envar> to all global names introduced by our script will save us from possible collisions with the <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> namespace.
es: Si bien es posible utilizar un nombre más corto internamente, por ejemplo, simplemente <envar>msg</envar>, agregando el prefijo único<envar>${name}_</envar> a todos los nombres globales introducidos por nuestro script nos salvará de posibles colisiones con el <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> espacio de nombres.

source: As a rule, <filename>rc.d</filename> scripts of the base system need not provide defaults for their <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry> variables because the defaults should be set in <filename>/etc/defaults/rc.conf</filename> instead. On the other hand, <filename>rc.d</filename> scripts for ports should provide the defaults as shown in the example.
es: Como una regla, <filename>rc.d</filename> Los scripts del sistema base no necesitan proporcionar valores predeterminados para su <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>variables porque los valores predeterminados deben establecerse en <filename>/etc/defaults/rc.conf</filename> en lugar. Por otra parte,<filename>rc.d</filename> Los scripts para los puertos deben proporcionar los valores predeterminados como se muestra en el ejemplo.

source: Here we use <envar>dummy_msg</envar> to actually control our script, i.e., to emit a variable message. Use of a shell function is overkill here, since it only runs a single command; an equally valid alternative is:
es: Aquí usamos <envar>dummy_msg</envar> para controlar realmente nuestro script, es decir, para emitir un mensaje variable. El uso de una función de shell es excesivo aquí, ya que solo ejecuta un comando; una alternativa igualmente válida es:

source: Startup and shutdown of a simple daemon
es: Inicio y cierre de un demonio simple

source: We said earlier that <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> could provide default methods. Obviously, such defaults cannot be too general. They are suited for the common case of starting and shutting down a simple daemon program. Let us assume now that we need to write an <filename>rc.d</filename> script for such a daemon called <command>mumbled</command>. Here it is:
es: Dijimos antes que <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> podría proporcionar métodos predeterminados. Obviamente, estos valores predeterminados no pueden ser demasiado generales. Son adecuados para el caso común de iniciar y cerrar un programa demonio simple. Supongamos ahora que necesitamos escribir un<filename>rc.d</filename> script para un demonio llamado <command>mumbled</command>. Aquí está:

source: Pleasingly simple, isn't it? Let us examine our little script. The only new thing to note is as follows:
es: Agradablemente simple, ¿no? Examinemos nuestro pequeño script. Lo único nuevo a tener en cuenta es lo siguiente:

source: The <envar>command</envar> variable is meaningful to <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. If it is set, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> will act according to the scenario of serving a conventional daemon. In particular, the default methods will be provided for such arguments: <option>start</option>, <option>stop</option>, <option>restart</option>, <option>poll</option>, and <option>status</option>.
es: El <envar>command</envar> variable es significativa para <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Si está configurado, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> actuará de acuerdo con el escenario de servir un demonio convencional. En particular, se proporcionarán los métodos predeterminados para tales argumentos: <option>start</option>, <option>stop</option>, <option>restart</option>, <option>poll</option>, and <option>status</option>.

source: The daemon will be started by running <envar>$command</envar> with command-line flags specified by <envar>$mumbled_flags</envar>. Thus all the input data for the default <option>start</option> method are available in the variables set by our script. Unlike <option>start</option>, other methods may require additional information about the process started. For instance, <option>stop</option> must know the PID of the process to terminate it. In the present case, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> will scan through the list of all processes, looking for a process with its name equal to <envar>$procname</envar>. The latter is another variable of meaning to <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>, and its value defaults to that of <envar>command</envar>. In other words, when we set <envar>command</envar>, <envar>procname</envar> is effectively set to the same value. This enables our script to kill the daemon and to check if it is running in the first place.
es: El demonio se iniciará ejecutando <envar>$command</envar> con banderas de línea de comandos especificadas por<envar>$mumbled_flags</envar>.Por tanto, todos los datos de entrada para el <option>start</option> están disponibles en las variables establecidas por nuestro script. diferente a <option>start</option>, otros métodos pueden requerir información adicional sobre el proceso iniciado. Por ejemplo, <option>parar</option> Debe conocer el PID del proceso para finalizarlo. En el caso presente, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>examinará la lista de todos los procesos, buscando un proceso con su nombre igual a<envar>$procname</envar>. Este último es otra variable de significado para <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry>, y su valor predeterminado es el de <envar>command</envar>. En otras palabras, cuando establecemos <envar>comando</envar>, <envar>procname</envar> se establece efectivamente en el mismo valor. Esto permite que nuestro script elimine el demonio y verifique si se está ejecutando en primer lugar.
