Repository: doc-br/translate
Catalog: articles/*/rc-scripting.po
Languages: es

source: In certain cases we may need to emit an important message that should go to <application>syslog</application> as well. This can be done easily with the following <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> functions: <function>debug</function>, <function>info</function>, <function>warn</function>, and <function>err</function>. The latter function then exits the script with the code specified.
es: En ciertos casos, es posible que necesitemos emitir un mensaje importante que debe ir a <application>syslog</application> también. Esto se puede hacer fácilmente con lo siguiente <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> funciones: <function>debug</function>, <function>info</function>, <function>warn</function>, y <function>err</function>. La última función sale del script con el código especificado.

source: The exit codes from methods and their pre-commands are not just ignored by default. If <envar><replaceable>argument</replaceable>_precmd</envar> returns a non-zero exit code, the main method will not be performed. In turn, <envar><replaceable>argument</replaceable>_postcmd</envar> will not be invoked unless the main method returns a zero exit code.
es: Los códigos de salida de los métodos y sus pre-comandos no solo se ignoran por defecto. Si <envar><replaceable>argument</replaceable>_precmd</envar> devuelve un código de salida distinto de cero, el método principal no se ejecutará. En turno, <envar><replaceable>argument</replaceable>_postcmd</envar> no se invocará a menos que el método principal devuelva un código de salida cero.

source: However, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> can be instructed from the command line to ignore those exit codes and invoke all commands anyway by prefixing an argument with <literal>force</literal>, as in <option>forcestart</option>.
es: sin embargo, <citerefentry><refentrytitle>rc.subr</refentrytitle><manvolnum>8</manvolnum></citerefentry> se le puede indicar desde la línea de comando que ignore esos códigos de salida e invoque todos los comandos de todos modos al anteponer un argumento con <literal>force</literal>, como en <option>forcestart</option>.

source: Connecting a script to the rc.d framework
es: Conectando un script al framework rc.d

source: After a script has been written, it needs to be integrated into <filename>rc.d</filename>. The crucial step is to install the script in <filename>/etc/rc.d</filename> (for the base system) or <filename>/usr/local/etc/rc.d</filename> (for ports). Both &lt;<filename>bsd.prog.mk</filename>&gt; and &lt;<filename>bsd.port.mk</filename>&gt; provide convenient hooks for that, and usually you do not have to worry about the proper ownership and mode. System scripts should be installed from <filename>src/etc/rc.d</filename> through the <filename>Makefile</filename> found there. Port scripts can be installed using <varname>USE_RC_SUBR</varname> as described <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/rc-scripts.html">in the Porter's Handbook</link>.
es: Una vez que se ha escrito un script, debe integrarse en <filename>rc.d</filename>. El paso crucial es instalar el script en <filename>/etc/rc.d</filename> (para el sistema base) o <filename>/usr/local/etc/rc.d</filename> (para puertos). Ambos &lt;<filename>bsd.prog.mk</filename>&gt; and &lt;<filename>bsd.port.mk</filename>&gt; proporcione ganchos convenientes para eso, y por lo general no tiene que preocuparse por la propiedad y el modo adecuados. Los scripts del sistema deben instalarse desde <filename>src/etc/rc.d</filename> a través de <filename>Makefile</filename>encontrado allí. Los scripts de puerto se pueden instalar usando <varname>USE_RC_SUBR</varname>como se describe <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/porters-handbook/rc-scripts.html">en el manual del portero</link>.

source: However, we should consider beforehand the place of our script in the system startup sequence. The service handled by our script is likely to depend on other services. For instance, a network daemon cannot function without the network interfaces and routing up and running. Even if a service seems to demand nothing, it can hardly start before the basic filesystems have been checked and mounted.
es: Sin embargo, debemos considerar de antemano el lugar de nuestro script en la secuencia de inicio del sistema. Es probable que el servicio manejado por nuestro script dependa de otros servicios. Por ejemplo, un demonio de red no puede funcionar sin las interfaces de red y el enrutamiento en funcionamiento. Incluso si un servicio parece no exigir nada, difícilmente puede iniciarse antes de que se hayan verificado y montado los sistemas de archivos básicos.

source: We mentioned <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> already. Now it is time to have a close look at it. In a nutshell, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> takes a set of files, examines their contents, and prints a dependency-ordered list of files from the set to <varname>stdout</varname>. The point is to keep dependency information <emphasis>inside</emphasis> the files so that each file can speak for itself only. A file can specify the following information:
es: Nosotros mencionamos <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> ya. Ahora es el momento de examinarlo de cerca. En una palabra, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> toma un conjunto de archivos, examina su contenido e imprime una lista ordenada por dependencia de archivos del conjunto a <varname>stdout</varname>. El punto es mantener la información de dependencia <emphasis>inside</emphasis> los archivos para que cada archivo pueda hablar por sí solo. Un archivo puede especificar la siguiente información:

source: the names of the <quote>conditions</quote> (which means services to us) it <emphasis>provides</emphasis>;
es: los nombres de la <quote>conditions</quote> (Lo que significa servicios para nosotros) <emphasis>provides</emphasis>;

source: the names of the <quote>conditions</quote> it <emphasis>requires</emphasis>;
es: los nombres de la <quote>conditions</quote> it <emphasis>requiere</emphasis>;

source: the names of the <quote>conditions</quote> this file should run <emphasis>before</emphasis>;
es: los nombres de la <quote>conditions</quote> este archivo debería ejecutarse <emphasis>ante</emphasis>;

source: additional <emphasis>keywords</emphasis> that can be used to select a subset from the whole set of files (<citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> can be instructed via options to include or omit the files having particular keywords listed.)
es: adicional <emphasis>keywords</emphasis> que se puede utilizar para seleccionar un subconjunto de todo el conjunto de archivos (<citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> puede recibir instrucciones a través de opciones para incluir u omitir los archivos que tienen palabras clave específicas enumeradas).

source: It is no surprise that <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> can handle only text files with a syntax close to that of <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. That is, special lines understood by <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> look like <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> comments. The syntax of such special lines is rather rigid to simplify their processing. See <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> for details.
es: No es de extrañar que <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> solo puede manejar archivos de texto con una sintaxis cercana a la de <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Es decir, líneas especiales entendidas por <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry>parece <citerefentry><refentrytitle>sh</refentrytitle><manvolnum>1</manvolnum></citerefentry> comentarios. La sintaxis de estas líneas especiales es bastante rígida para simplificar su procesamiento. Ver <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> para detalles.

source: Besides using <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> special lines, a script can insist on its dependency upon another service by just starting it forcibly. This can be needed when the other service is optional and will not start by itself because the system admin has disabled it mistakenly in <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es: Además de usar<citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> líneas especiales, un script puede insistir en su dependencia de otro servicio simplemente iniciándolo a la fuerza. Esto puede ser necesario cuando el otro servicio es opcional y no se inicia por sí solo porque el administrador del sistema lo ha desactivado por error en <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: With this general knowledge in mind, let us consider the simple daemon script enhanced with dependency stuff:
es: Con este conocimiento general en mente, consideremos el script demonio simple mejorado con cosas de dependencia:

source: As before, detailed analysis follows:
es: Como antes, sigue un análisis detallado:

source: That line declares the names of <quote>conditions</quote> our script provides. Now other scripts can record a dependency on our script by those names.
es: Esa línea declara los nombres de <quote>conditions</quote> nuestro script proporciona. Ahora, otros scripts pueden registrar una dependencia de nuestro script con esos nombres.

source: Usually a script specifies a single condition provided. However, nothing prevents us from listing several conditions there, e.g., for compatibility reasons.
es: Por lo general, un script especifica una sola condición proporcionada. Sin embargo, nada nos impide enumerar varias condiciones allí, por ejemplo, por razones de compatibilidad.

source: In any case, the name of the main, or the only, <literal>PROVIDE:</literal> condition should be the same as <envar>${name}</envar>.
es: En cualquier caso, el nombre del principal, o el único, <literal>PROVIDE:</literal> la condición debe ser la misma que <envar>${name}</envar>.

source: So our script indicates which <quote>conditions</quote> provided by other scripts it depends on. According to the lines, our script asks <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> to put it after the script(s) providing <filename>DAEMON</filename> and <filename>cleanvar</filename>, but before that providing <filename>LOGIN</filename>.
es: Entonces nuestro script indica qué <quote>conditions</quote> proporcionado por otros scripts de los que depende. Según las líneas, nuestro script pregunta <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> para ponerlo después del script(s) que proporcionan <filename>DAEMON</filename> y <filename>cleanvar</filename>, pero antes de eso proporcionando <filename>LOGIN</filename>.

source: The <literal>BEFORE:</literal> line should not be abused to work around an incomplete dependency list in the other script. The appropriate case for using <literal>BEFORE:</literal> is when the other script does not care about ours, but our script can do its task better if run before the other one. A typical real-life example is the network interfaces vs. the firewall: While the interfaces do not depend on the firewall in doing their job, the system security will benefit from the firewall being ready before there is any network traffic.
es: La <literal>BEFORE:</literal> No se debe abusar de la línea para evitar una lista de dependencias incompleta en el otro script. El caso apropiado para usar <literal>ANTES:</literal> es cuando el otro script no se preocupa por el nuestro, pero nuestro script puede hacer mejor su tarea si se ejecuta antes que el otro. Un ejemplo típico de la vida real son las interfaces de red frente al firewall: si bien las interfaces no dependen del firewall para hacer su trabajo, la seguridad del sistema se beneficiará de que el firewall esté listo antes de que haya tráfico de red.

source: Besides conditions corresponding to a single service each, there are meta-conditions and their <quote>placeholder</quote> scripts used to ensure that certain groups of operations are performed before others. These are denoted by <filename><replaceable>UPPERCASE</replaceable></filename> names. Their list and purposes can be found in <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>.
es: Además de las condiciones correspondientes a un solo servicio cada una, existen metacondiciones y sus <quote>placeholder</quote> scripts se utiliza para garantizar que ciertos grupos de operaciones se realicen antes que otros. Estos se denotan por <filename><replaceable>UPPERCASE</replaceable></filename> nombres. Su lista y propósitos se pueden encontrar en <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry>.

source: Keep in mind that putting a service name in the <literal>REQUIRE:</literal> line does not guarantee that the service will actually be running by the time our script starts. The required service may fail to start or just be disabled in <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Obviously, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> cannot track such details, and <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> will not do that either. Consequently, the application started by our script should be able to cope with any required services being unavailable. In certain cases, we can help it as discussed <link linkend="forcedep">below.</link>
es: Tenga en cuenta que poner un nombre de servicio en el<literal>REQUIERE:</literal> line no garantiza que el servicio se esté ejecutando realmente para cuando se inicie nuestro script. El servicio requerido puede fallar al iniciarse o simplemente estar deshabilitado en <citerefentry><refentrytitle>rc.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Obviamente, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry>no puede rastrear tales detalles, y <citerefentry><refentrytitle>rc</refentrytitle><manvolnum>8</manvolnum></citerefentry> tampoco haré eso. En consecuencia, la aplicación iniciada por nuestro script debería poder hacer frente a cualquier servicio requerido que no esté disponible. En ciertos casos, podemos ayudarlo como se discutió <link linkend="forcedep">abajo.</link>

source: <anchor xml:id="keywords"/>As we remember from the above text, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> keywords can be used to select or leave out some scripts. Namely any <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> consumer can specify through <option>-k</option> and <option>-s</option> options which keywords are on the <quote>keep list</quote> and <quote>skip list</quote>, respectively. From all the files to be dependency sorted, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> will pick only those having a keyword from the keep list (unless empty) and not having a keyword from the skip list.
es: <anchor xml:id="keywords"/>Como recordamos del texto anterior, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> Las palabras clave se pueden utilizar para seleccionar u omitir algunos guiones. A saber, cualquiera <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> El consumidor puede especificar a través de <option>-k</option> y <option>-s</option> opciones qué palabras clave están en el <quote>keep list</quote> and <quote>omitir lista</quote>, respectivamente. De todos los archivos que se ordenarán por dependencia, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> seleccionará solo aquellos que tengan una palabra clave de la lista de conservación (a menos que estén vacíos) y que no tengan una palabra clave de la lista de omisión.

source: In FreeBSD, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> is used by <filename>/etc/rc</filename> and <filename>/etc/rc.shutdown</filename>. These two scripts define the standard list of FreeBSD <filename>rc.d</filename> keywords and their meanings as follows:
es: En FreeBSD, <citerefentry><refentrytitle>rcorder</refentrytitle><manvolnum>8</manvolnum></citerefentry> es usado por <filename>/etc/rc</filename> y <filename>/etc/rc.shutdown</filename>. Estos dos scripts definen la lista estándar de FreeBSD <filename>rc.d</filename> palabras clave y sus significados de la siguiente manera:

source: The service is not for <citerefentry><refentrytitle>jail</refentrytitle><manvolnum>8</manvolnum></citerefentry> environment. The automatic startup and shutdown procedures will ignore the script if inside a jail.
es: El servicio no es para <citerefentry><refentrytitle>jail</refentrytitle><manvolnum>8</manvolnum></citerefentry> medio ambiente. Los procedimientos automáticos de inicio y apagado ignorarán el script si se encuentra dentro de una cárcel.

source: The service is to be started manually or not started at all. The automatic startup procedure will ignore the script. In conjunction with the <literal>shutdown</literal> keyword, this can be used to write scripts that do something only at system shutdown.
es: El servicio debe iniciarse manualmente o no iniciarse en absoluto. El procedimiento de inicio automático ignorará el script. En conjunción con el <literal>shutdown</literal> palabra clave, esto se puede utilizar para escribir scripts que hacen algo solo cuando se apaga el sistema.

source: This keyword is to be listed <emphasis>explicitly</emphasis> if the service needs to be stopped before system shutdown.
es: Esta palabra clave debe aparecer en la lista <emphasis>explicitly</emphasis> si es necesario detener el servicio antes de apagar el sistema.

source: When the system is going to shut down, <filename>/etc/rc.shutdown</filename> runs. It assumes that most <filename>rc.d</filename> scripts have nothing to do at that time. Therefore <filename>/etc/rc.shutdown</filename> selectively invokes <filename>rc.d</filename> scripts with the <literal>shutdown</literal> keyword, effectively ignoring the rest of the scripts. For even faster shutdown, <filename>/etc/rc.shutdown</filename> passes the <option>faststop</option> command to the scripts it runs so that they skip preliminary checks, e.g., the pidfile check. As dependent services should be stopped before their prerequisites, <filename>/etc/rc.shutdown</filename> runs the scripts in reverse dependency order.
es: Cuando el sistema se va a apagar, <filename>/etc/rc.shutdown</filename>carreras. Asume que la mayoría <filename>rc.d</filename> Los scripts no tienen nada que ver en ese momento. Por lo tanto <filename>/etc/rc.shutdown</filename>invoca selectivamente <filename>rc.d</filename> scripts con el <literal>shutdown</literal> palabra clave, ignorando efectivamente el resto de los guiones. Para un apagado aún más rápido, <filename>/etc/rc.shutdown</filename> pasa el <option>faststop</option> comando a los scripts que ejecuta para que omitan las comprobaciones preliminares, por ejemplo, la comprobación del archivo pid. Dado que los servicios dependientes deben detenerse antes de cumplir con sus requisitos previos, <filename>/etc/rc.shutdown</filename> ejecuta los scripts en orden inverso de dependencia.

source: If writing a real <filename>rc.d</filename> script, you should consider whether it is relevant at system shutdown time. E.g., if your script does its work in response to the <option>start</option> command only, then you need not include this keyword. However, if your script manages a service, it is probably a good idea to stop it before the system proceeds to the final stage of its shutdown sequence described in <citerefentry><refentrytitle>halt</refentrytitle><manvolnum>8</manvolnum></citerefentry>. In particular, a service should be stopped explicitly if it needs considerable time or special actions to shut down cleanly. A typical example of such a service is a database engine.
es: Si escribes un verdadero <filename>rc.d</filename> script, debe considerar si es relevante al momento de apagar el sistema. Por ejemplo, si su script hace su trabajo en respuesta a la <option>start</option>comando solamente, entonces no necesita incluir esta palabra clave. Sin embargo, si su secuencia de comandos administra un servicio, probablemente sea una buena idea detenerlo antes de que el sistema pase a la etapa final de la secuencia de apagado descrita en <citerefentry><refentrytitle>halt</refentrytitle><manvolnum>8</manvolnum></citerefentry>. En particular, un servicio debe detenerse explícitamente si necesita un tiempo considerable o acciones especiales para cerrarse limpiamente. Un ejemplo típico de tal servicio es un motor de base de datos.

source: <anchor xml:id="forcedep"/>To begin with, <function>force_depend</function> should be used with much care. It is generally better to revise the hierarchy of configuration variables for your <filename>rc.d</filename> scripts if they are interdependent.
es: <anchor xml:id="forcedep"/>Para empezar,<function>force_depend</function> debe usarse con mucho cuidado. Generalmente es mejor revisar la jerarquía de variables de configuración para su <filename>rc.d</filename> scripts Si ellos son interdependientes.
