Repository: doc-br/translate
Catalog: articles/*/vinum.po
Languages: es

# _
source: translator-credits
es: Fernando Apesteguía fernape@FreeBSD.org

source: The <filename>vinum</filename> Volume Manager
es: El Gestor de Volúmenes <filename>vinum</filename>

source: <personname> <firstname>Greg</firstname> <surname>Lehey</surname> </personname> <contrib>Originally written by </contrib>
es: <personname> <firstname>Greg</firstname> <surname>Lehey</surname> </personname><contrib>Escrito originalmente por </contrib>

source: Synopsis
es: Sinopsis

source: No matter the type of disks, there are always potential problems. The disks can be too small, too slow, or too unreliable to meet the system's requirements. While disks are getting bigger, so are data storage requirements. Often a file system is needed that is bigger than a disk's capacity. Various solutions to these problems have been proposed and implemented.
es: Independientemente del tipo de disco, siempre hay problemas potenciales. Los discos pueden ser muy pequeños, muy lentos, o muy poco fiables para cumplir con los requisitos del sistema. Aunque los discos crecen, también lo hacen los requisitos de almacenamiento. A menudo se necesita un sistema de ficheros que es mayor que la capacidad del disco. Se han propuesto e implementado varias soluciones a estos problemas.

source: One method is through the use of multiple, and sometimes redundant, disks. In addition to supporting various cards and controllers for hardware Redundant Array of Independent Disks <acronym>RAID</acronym> systems, the base FreeBSD system includes the <filename>vinum</filename> volume manager, a block device driver that implements virtual disk drives and addresses these three problems. <filename>vinum</filename> provides more flexibility, performance, and reliability than traditional disk storage and implements <acronym>RAID</acronym>-0, <acronym>RAID</acronym>-1, and <acronym>RAID</acronym>-5 models, both individually and in combination.
es: Un método es mediante el uso de múltiples, y a veces redundantes, discos. Además de soportar varias tarjetas y controladores hardware de sistemas de Arrays Redundantes de Discos Independientes <acronym>RAID</acronym> , el sistema base de FreeBSD incluye el gestor de volúmenes <filename>vinum</filename> , un controlador de dispositivos de bloques que implementa unidades virtuales de disco y que aborda estos tres problemas. <filename>vinum</filename> proporciona más flexibilidad, rendimiento, y fiabilidad que el almacenamiento de disco tradicional e implementa los modelos <acronym>RAID</acronym>-0, <acronym>RAID</acronym>-1, y <acronym>RAID</acronym>-5 , tanto individualmente como combinados.

source: This chapter provides an overview of potential problems with traditional disk storage, and an introduction to the <filename>vinum</filename> volume manager.
es: Este capítulo proporciona una visión general de los problemas potenciales del almacenamiento tradicional en disco, y una introducción al gestor de volúmenes <filename>vinum</filename>.

source: Starting with FreeBSD 5, <filename>vinum</filename> has been rewritten in order to fit into the <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom.html">GEOM architecture</link>, while retaining the original ideas, terminology, and on-disk metadata. This rewrite is called <emphasis>gvinum</emphasis> (for <emphasis> GEOM vinum</emphasis>). While this chapter uses the term <filename>vinum</filename>, any command invocations should be performed with <command>gvinum</command>. The name of the kernel module has changed from the original <filename>vinum.ko</filename> to <filename>geom_vinum.ko</filename>, and all device nodes reside under <filename class="directory">/dev/gvinum</filename> instead of <filename class="directory">/dev/vinum</filename>. As of FreeBSD 6, the original <filename>vinum</filename> implementation is no longer available in the code base.
es: Comenzando con FreeBSD 5, <filename>vinum</filename> ha sido reescrito para adaptarlo a la <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/geom.html">arquitectura de GEOM</link>, a la vez que se mantienen las ideas originales, terminología, y metadata en disco. Esta reescritura se llama <command>gvinum</command>. El nombre del módulo del kernel ha cambiado del original <filename>vinum.ko</filename> a <filename>geom_vinum.ko</filename>, y todos los nodos de dispositivo residen bajo <filename class="directory">/dev/gvinum</filename> en lugar de <filename class="directory">/dev/vinum</filename>. A partir de FreeBSD 6, la implementación original de <filename>vinum</filename> no está disponible en el código base.

source: Access Bottlenecks
es: Cuellos de botella de acceso

source: Modern systems frequently need to access data in a highly concurrent manner. For example, large FTP or HTTP servers can maintain thousands of concurrent sessions and have multiple 100 Mbit/s connections to the outside world, well beyond the sustained transfer rate of most disks.
es: Los sistemas modernos necesitan frecuentemente acceder a los datos de una forma altamente concurrente. Por ejemplo, grandes servidores de FTP o HTTP pueden mantener miles de sesiones concurrents y tener conexiones de 100 Mbit/s al mundo exterior, mucho más que la tasa de transferencia mantenida de la mayoría de los discos.

source: Current disk drives can transfer data sequentially at up to 70 MB/s, but this value is of little importance in an environment where many independent processes access a drive, and where they may achieve only a fraction of these values. In such cases, it is more interesting to view the problem from the viewpoint of the disk subsystem. The important parameter is the load that a transfer places on the subsystem, or the time for which a transfer occupies the drives involved in the transfer.
es: Las unidades de disco actuales pueden transferir datos secuencialmente hasta unos 70 MB/s, pero este valor tiene poca importancia en un entorno en el que muchos procesos independientes acceden a un dispositivo, y donde solo pueden conseguir una fracción de esos valores. En tales casos, es más interesante ver el problema desde el punto de vista del subsistema de disco. El parámetro importante es la carga que una transferencia supone en el subsistema, o el tiempo para el cual la transferencia ocupa los dispositivos involucrados en la misma.

source: In any disk transfer, the drive must first position the heads, wait for the first sector to pass under the read head, and then perform the transfer. These actions can be considered to be atomic as it does not make any sense to interrupt them.
es: En cualquier transferencia de disco, la unidad debe primero posicionar el cabezal, esperar a que el primer sector pase bajo la cabeza de lectura, y después realizar la transferencia. Estas acciones pueden considerarse atómicas y que no tiene sentido interrumpirlas.

source: <anchor xml:id="vinum-latency"/> Consider a typical transfer of about 10 kB: the current generation of high-performance disks can position the heads in an average of 3.5 ms. The fastest drives spin at 15,000 rpm, so the average rotational latency (half a revolution) is 2 ms. At 70 MB/s, the transfer itself takes about 150 μs, almost nothing compared to the positioning time. In such a case, the effective transfer rate drops to a little over 1 MB/s and is clearly highly dependent on the transfer size.
es: <anchor xml:id="vinum-latency"/>Considera una transferencia típica de unos 10 kB: la generación actual de discos de alto rendimiento pueden situar los cabezales en unos 3.5 ms de media. Los discos más rápidos giran a 15,000 rpm, así que la latencia rotacional media (media revolución) es 2 ms. A 70 MB/s, la propia transferencia tarda unos 150 μs, casi nada comparado con el tiempo de posicionamiento. En ese caso, la tasa efectiva de transferencia cae hasta un poco más de 1 MB/s y depende claramente del tamaño de la transferencia.

source: The traditional and obvious solution to this bottleneck is <quote>more spindles</quote>: rather than using one large disk, use several smaller disks with the same aggregate storage space. Each disk is capable of positioning and transferring independently, so the effective throughput increases by a factor close to the number of disks used.
es: La solución obvia y tradicional a este cuello de botella es <quote>más agujas</quote>: en lugar de usar un gran disco, usar varios discos pequeños con el mismo espacio de almacenamiento agregado. Cada disco es capaz de posicionar y transferir de forma independiente, así que el rendimiento efectivo aumenta en un factor próximo al número de discos utilizados.

source: The actual throughput improvement is smaller than the number of disks involved. Although each drive is capable of transferring in parallel, there is no way to ensure that the requests are evenly distributed across the drives. Inevitably the load on one drive will be higher than on another.
es: La mejora de rendimiento real es menor que el número de discos involucrados. Aunque cada dispositivo es capaz de transferir en paralelo, no hay forma de asegurar que las peticiones se distribuyen de forma equilibrada entre los dispositivos. Inevitablemente la carga en un dispositivo será mayor que en otro.

source: <primary>disk concatenation</primary>
es: <primary>concatenación de discos</primary>

source: <primary>Vinum</primary> <secondary>concatenation</secondary>
es: <primary>Vinum</primary><secondary>concatenación</secondary>

source: The evenness of the load on the disks is strongly dependent on the way the data is shared across the drives. In the following discussion, it is convenient to think of the disk storage as a large number of data sectors which are addressable by number, rather like the pages in a book. The most obvious method is to divide the virtual disk into groups of consecutive sectors the size of the individual physical disks and store them in this manner, rather like taking a large book and tearing it into smaller sections. This method is called <emphasis>concatenation</emphasis> and has the advantage that the disks are not required to have any specific size relationships. It works well when the access to the virtual disk is spread evenly about its address space. When access is concentrated on a smaller area, the improvement is less marked. <xref linkend="vinum-concat"/> illustrates the sequence in which storage units are allocated in a concatenated organization.
es: El reparto equitativo de la carga en los discos depende fuertemente de la forma en la que los datos se comparten entre los dispositivos. En la siguiente discusión, es conveniente pensar en el almacenamiento de disco como un número grande de sectores que son direccionables mediante un número, parecido a las páginas de un libro. El método más obvio es dividir el disco virtual en grupos de sectores consecutivos del tamaño de los discos físicos individuales y almacenarlos de este modo, como coger un libro grande y romperlo en secciones pequeñas. Este método se llama <emphasis>concatenación</emphasis> y tiene la ventaja de que los discos no requieren tener ninguna relación específica de tamaño entre ellos. Funciona bien cuando los accesos al disco virtual se reparten equitativamente en su espacio de direcciones. Cuando el acceso se concentra en un área más pequeña, la mejora es menos acentuada. <xref linkend="vinum-concat"/> ilustra una secuencia en la que las unidades de almacenamiento están asignadas en una organización concatenada.

source: Concatenated Organization
es: Organización Concatenada

source: <primary>disk striping</primary>
es: <primary>segmentado de disco</primary>

source: <primary>Vinum</primary> <secondary>striping</secondary>
es: <primary>Vinum</primary> <secondary>segmentado</secondary>

source: An alternative mapping is to divide the address space into smaller, equal-sized components and store them sequentially on different devices. For example, the first 256 sectors may be stored on the first disk, the next 256 sectors on the next disk and so on. After filling the last disk, the process repeats until the disks are full. This mapping is called <emphasis>striping</emphasis> or <acronym>RAID-0</acronym>.
es: Un mapeo alternativo es dividir el espacio de direcciones en componentes más pequeños del mismos tamaño y almacenarlos secuencialmente en distintos dispositivos. Por ejemplo, los primeros 256 sectores podrían ser almacenados en el primer disco, los 256 sectores siguientes en el siguiente disco, etc. Después de rellenar el último disco, el proceso se repite hasta que los discos están llenos. Este mapeo se llama <emphasis>segmentado</emphasis> o <acronym>RAID-0</acronym>.

source: <acronym>RAID</acronym> offers various forms of fault tolerance, though <acronym>RAID-0</acronym> is somewhat misleading as it provides no redundancy. Striping requires somewhat more effort to locate the data, and it can cause additional I/O load where a transfer is spread over multiple disks, but it can also provide a more constant load across the disks. <xref linkend="vinum-striped"/> illustrates the sequence in which storage units are allocated in a striped organization.
es: <acronym>RAID</acronym> ofrece varias formas de tolerancia a fallos, aunque <acronym>RAID-0</acronym> es algo engañoso ya que no provee redundancia. El segmentado requiere algo más de esfuerzo para localizar el dato, y puede ocasionar carga de E/S adicional cuando una transferencia está repartida por múltiples discos, pero también puede proporcionar una carga más constante entre los discos. <xref linkend="vinum-striped"/> ilustra la secuencia en la que las unidades de discos están asignadas en una organización segmentada.

source: Striped Organization
es: Organización Segmentada

source: Data Integrity
es: Integridad de los Datos

source: The final problem with disks is that they are unreliable. Although reliability has increased tremendously over the last few years, disk drives are still the most likely core component of a server to fail. When they do, the results can be catastrophic and replacing a failed disk drive and restoring data can result in server downtime.
es: El último problema con los discos es que no son fiables. Aunque la fiabilidad se ha incrementado tremendamente en los últimos años, las unidades de disco todavía son el componente central de un servidor más propensos a fallar. Cuando lo hacen, los resultados pueden ser catastróficas y reemplazar una unidad de disco que ha fallado y restaurar los datos puede resultar en tiempo de parada del servidor.

source: <primary>disk mirroring</primary>
es: <primary>disco en espejo</primary>

source: <primary>vinum</primary> <secondary>mirroring</secondary>
es: <primary>vinum</primary> <secondary>configuración en espejo</secondary>

source: One approach to this problem is <emphasis>mirroring</emphasis>, or <acronym>RAID-1</acronym>, which keeps two copies of the data on different physical hardware. Any write to the volume writes to both disks; a read can be satisfied from either, so if one drive fails, the data is still available on the other drive.
es: Una aproximación a este problema es el <emphasis>mirroring</emphasis>, o <acronym>RAID-1</acronym>, que mantiene dos copias de los datos en distinto hardware físico. Cualquier escritura en el volumen escribe en ambos discos; una lectura puede ser resuelta por cualquiera, así que si un disco falla, los datos todavía están disponibles en la otra unidad.

source: Mirroring has two problems:
es: La configuración en espejo tiene dos problemas:

source: It requires twice as much disk storage as a non-redundant solution.
es: Requiere el doble de espacio de almacenamiento que una solución sin redundancia.

source: Writes must be performed to both drives, so they take up twice the bandwidth of a non-mirrored volume. Reads do not suffer from a performance penalty and can even be faster.
es: Las escrituras deben realizarse en las dos unidades, de forma que utilizan el doble de ancho de banda que un volumen sin espejo. Las lecturas no sufren penalización en lectura e incluso pueden ser más rápidas.

source: An alternative solution is <emphasis>parity</emphasis>, implemented in <acronym>RAID</acronym> levels 2, 3, 4 and 5. Of these, <acronym>RAID-5</acronym> is the most interesting. As implemented in <filename>vinum</filename>, it is a variant on a striped organization which dedicates one block of each stripe to parity one of the other blocks. As implemented by <filename>vinum</filename>, a <acronym>RAID-5</acronym> plex is similar to a striped plex, except that it implements <acronym>RAID-5</acronym> by including a parity block in each stripe. As required by <acronym>RAID-5</acronym>, the location of this parity block changes from one stripe to the next. The numbers in the data blocks indicate the relative block numbers.
es: Una solución alternativa es la<emphasis>paridad</emphasis>, implementada en los niveles <acronym>RAID</acronym> 2, 3, 4 y 5. De estos, <acronym>RAID-5</acronym> es el más interesante. Como está implementado en <filename>vinum</filename>, es una variante en una organización segmentada que dedica un bloque en cada segmento para guardar la paridad de los otros bloques. Tal como está implementado en <filename>vinum</filename>, un <acronym>RAID-5</acronym> plex es similar a un plex segmentado, excepto que implementa <acronym>RAID-5</acronym> al incluir un bloque de paridad en cada segmento. Según lo requerido por <acronym>RAID-5</acronym>, la localización de este bloque de paridad cambia de un segmento al siguiente. Los números en los bloques de datos indican los números de bloque relativos.

source: <acronym>RAID</acronym>-5 Organization
es: Organización <acronym>RAID</acronym>-5

source: Compared to mirroring, <acronym>RAID-5</acronym> has the advantage of requiring significantly less storage space. Read access is similar to that of striped organizations, but write access is significantly slower, approximately 25% of the read performance. If one drive fails, the array can continue to operate in degraded mode where a read from one of the remaining accessible drives continues normally, but a read from the failed drive is recalculated from the corresponding block from all the remaining drives.
es: Comparado con la configuración en espejo, <acronym>RAID-5</acronym> tiene la ventaja de que requiere mucho menos espacio de almacenamiento. El acceso de lectura es similar a una organización segmentada, pero el acceso de escritura es significativamente más lento, aproximadamente el 25% del rendimiento de lectura. Si una unidad falla, el array puede seguir operando en un modo degradado donde una lectura de una de las unidades que quedan accesibles continua normalmente, pero una lectura de una unidad que ha fallado es recalculada a partir de los bloques correspondientes del resto de unidades.

source: <filename>vinum</filename> Objects
es: Objetos <filename>vinum</filename>

source: In order to address these problems, <filename>vinum</filename> implements a four-level hierarchy of objects:
es: Para abordar estos problemas, <filename>vinum</filename> implementa una jerarquía de objetos en cuatro niveles:

source: The most visible object is the virtual disk, called a <emphasis>volume</emphasis>. Volumes have essentially the same properties as a <trademark class="registered">UNIX</trademark> disk drive, though there are some minor differences. For one, they have no size limitations.
es: El objeto más visible es el disco virtual, llamado <emphasis>volumen</emphasis>. Volúmenes tienen esencialmente las mismas propiedades que una unidad de disco <trademark class="registered">UNIX</trademark> aunque hay algunas pequeñas diferencias. Una de ellas, que no tienen limitación de tamaño.

source: Volumes are composed of <emphasis>plexes</emphasis>, each of which represent the total address space of a volume. This level in the hierarchy provides redundancy. Think of plexes as individual disks in a mirrored array, each containing the same data.
es: Los volúmenes se componen de <emphasis>plexes</emphasis>, cada uno de los cuales representa el espacio de direcciones total de un volumen. Este nivel en la jerarquía proporciona redundancia. Piensa en los plexes como en discos individuales en un array replicado en espejo, cada uno conteniendo los mismos datos.

source: Since <filename>vinum</filename> exists within the <trademark class="registered">UNIX</trademark> disk storage framework, it would be possible to use <trademark class="registered">UNIX</trademark> partitions as the building block for multi-disk plexes. In fact, this turns out to be too inflexible as <trademark class="registered">UNIX</trademark> disks can have only a limited number of partitions. Instead, <filename>vinum</filename> subdivides a single <trademark class="registered">UNIX</trademark> partition, the <emphasis>drive</emphasis>, into contiguous areas called <emphasis>subdisks</emphasis>, which are used as building blocks for plexes.
es: Puesto que <filename>vinum</filename> dentro del framework de almacenamiento de disco de <trademark class="registered">UNIX</trademark>, sería posible utilizar particiones <trademark class="registered">UNIX</trademark> como bloques de construcción para plexes multi-disco. En realidad, esto resulta demasiado poco flexible ya que los discos <trademark class="registered">UNIX</trademark> sólo pueden tener un número limitado de particiones. En su lugar, <filename>vinum</filename> subdivide una única partición <trademark class="registered">UNIX</trademark>, la <emphasis>drive</emphasis>, en areas contiguas llamadas <emphasis>subdiscos</emphasis>, los cuales se utilizan como bloques de construcción de plexes.

source: Subdisks reside on <filename>vinum</filename> <emphasis>drives</emphasis>, currently <trademark class="registered">UNIX</trademark> partitions. <filename>vinum</filename> drives can contain any number of subdisks. With the exception of a small area at the beginning of the drive, which is used for storing configuration and state information, the entire drive is available for data storage.
es: Los subdiscos residen en <emphasis>unidades</emphasis> <filename>vinum</filename>, actualmente particiones <trademark class="registered">UNIX</trademark>. Las unidades <filename>vinum</filename> pueden tener cualquier número de subdiscos. Con la excepción de una pequeña área al comienzo de la unidad, que es utilizada para almacenar información de estado y configuración, la unidad entera está disponible para almacenamiento de datos.

source: The following sections describe the way these objects provide the functionality required of <filename>vinum</filename>.
es: Las secciones siguientes describen el modo en el que estos objetos proporcionan la funcionalidad requerida por <filename>vinum</filename>.

source: Volume Size Considerations
es: Consideraciones sobre el Tamaño del Volumen

source: Plexes can include multiple subdisks spread over all drives in the <filename>vinum</filename> configuration. As a result, the size of an individual drive does not limit the size of a plex or a volume.
es: Plexes pueden incluir múltiples subdiscos repartidos por todas las unidades en la configuración de <filename>vinum</filename>. Como resultado, el tamaño de una unidad individual no limita el tamaño de un plex o un volumen.

source: Redundant Data Storage
es: Almacenamiento de Datos Redundante

source: <filename>vinum</filename> implements mirroring by attaching multiple plexes to a volume. Each plex is a representation of the data in a volume. A volume may contain between one and eight plexes.
es: <filename>vinum</filename> implementa configuraciones en espejo adjuntando varios plexes a un volumen. Cada plex es una representación de los datos en un volumen. Un volumen puede contener entre uno y ocho plexes.
