Repository: doc-br/translate
Catalog: articles/*/vinum.po
Languages: es

source: The <filename>GENERIC</filename> kernel does not contain <filename>vinum</filename>. It is possible to build a custom kernel which includes <filename>vinum</filename>, but this is not recommended. The standard way to start <filename>vinum</filename> is as a kernel module. <citerefentry><refentrytitle>kldload</refentrytitle><manvolnum>8</manvolnum></citerefentry> is not needed because when <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> starts, it checks whether the module has been loaded, and if it is not, it loads it automatically.
es: El kernel <filename>GENERIC</filename> no contiene <filename>vinum</filename>. Es posible construir un kernel a medida que incluya <filename>vinum</filename>, pero no se recomienda. La forma estándar de arrancar<filename>vinum</filename> es como un módulo del kernel. <citerefentry><refentrytitle>kldload</refentrytitle><manvolnum>8</manvolnum></citerefentry> no es necesario porque cuando <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> arranca, comprueba si el módulo ha sido cargado, y si no es así, lo carga automáticamente.

source: Startup
es: Arranque

source: <filename>vinum</filename> stores configuration information on the disk slices in essentially the same form as in the configuration files. When reading from the configuration database, <filename>vinum</filename> recognizes a number of keywords which are not allowed in the configuration files. For example, a disk configuration might contain the following text:
es: <filename>vinum</filename> almacena información de configuración en las porciones de disco de forma esencialmente igual a como guarda los ficheros de configuración. Cuando lee de la base de datos de configuración, <filename>vinum</filename> reconoce un número de palabras clave que no están permitidas en los ficheros de configuración. Por ejemplo, una configuración de disco podría contener el siguiente texto:

source: The obvious differences here are the presence of explicit location information and naming, both of which are allowed but discouraged, and the information on the states. <filename>vinum</filename> does not store information about drives in the configuration information. It finds the drives by scanning the configured disk drives for partitions with a <filename>vinum</filename> label. This enables <filename>vinum</filename> to identify drives correctly even if they have been assigned different <trademark class="registered">UNIX</trademark> drive IDs.
es: Aquí las diferencias obvias son la presencia de información explícita de localización y nombrado, ambas permitidas pero no recomendadas, y la información de los estados. <filename>vinum</filename> no almacena información sobre las unidades en la información de configuración. Encuentra las unidades escaneando las unidades de disco configuradas en busca de particiones con una etiqueta <filename>vinum</filename>. Esto posibilita que <filename>vinum</filename> identifique las unidades correctamente incluso si se les han asignado identificadores de unidad <trademark class="registered">UNIX</trademark> diferentes.

source: Automatic Startup
es: Arranque Automático

source: <emphasis>Gvinum</emphasis> always features an automatic startup once the kernel module is loaded, via <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. To load the <emphasis>Gvinum</emphasis> module at boot time, add <literal>geom_vinum_load="YES"</literal> to <filename>/boot/loader.conf</filename>.
es: <emphasis>Gvinum</emphasis> siempre realiza un arranque automático una vez que el módulo del kernel ha sido cargado, via <citerefentry><refentrytitle>loader.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>. Para cargar el módulo de <emphasis>Gvinum</emphasis> en el arranque, añade <literal>geom_vinum_load="YES"</literal> a <filename>/boot/loader.conf</filename>.

source: When <filename>vinum</filename> is started with <command>gvinum start</command>, <filename>vinum</filename> reads the configuration database from one of the <filename>vinum</filename> drives. Under normal circumstances, each drive contains an identical copy of the configuration database, so it does not matter which drive is read. After a crash, however, <filename>vinum</filename> must determine which drive was updated most recently and read the configuration from this drive. It then updates the configuration, if necessary, from progressively older drives.
es: Cuando <filename>vinum</filename> es arrancado con <command>gvinum start</command>, <filename>vinum</filename> lee la base de datos de configuración de una de las unidades <filename>vinum</filename>. En condiciones normales, cada unidad contiene una copia idéntica de la base de datos de configuración, de forma que no importa de qué unidad se lea. Después de una caída, sin embargo, <filename>vinum</filename> debe determinar qué unidad fue actualizada más recientemente y leer la configuración de esta unidad. Después actualiza la configuración progresivamente, si es necesario, de unidades más antiguas.

source: Using <filename>vinum</filename> for the Root File System
es: Usando <filename>vinum</filename> para el Sistema de Ficheros Raíz

source: For a machine that has fully-mirrored file systems using <filename>vinum</filename>, it is desirable to also mirror the root file system. Setting up such a configuration is less trivial than mirroring an arbitrary file system because:
es: Para una máquina que tiene sistemas de ficheros completamente en espejo usando <filename>vinum</filename>, es deseable también configurar en espejo el sistema de ficheros raíz. Establecer dicha configuración es menos trivial que configurar en espejo un sistema de ficheros arbitrario porque:

source: The root file system must be available very early during the boot process, so the <filename>vinum</filename> infrastructure must already be available at this time.
es: El sistema de ficheros raíz debe estar disponible muy temprano durante el proceso de arranque, por lo que la infraestructura <filename>vinum</filename> debe estar disponible en ese momento.

source: The volume containing the root file system also contains the system bootstrap and the kernel. These must be read using the host system's native utilities, such as the BIOS, which often cannot be taught about the details of <filename>vinum</filename>.
es: El volumen que contiene el sistema de ficheros raíz, también contiene el sistema de arranque y el kernel. Estos deben ser leídos usando las utilidades nativas del sistema hospedador, como la BIOS, que frecuentemente no puede ser informada de los detalles de <filename>vinum</filename>.

source: In the following sections, the term <quote>root volume</quote> is generally used to describe the <filename>vinum</filename> volume that contains the root file system.
es: En las secciones siguientes, el término <quote>volumen raíz</quote> se utiliza para describir el volumen <filename>vinum</filename> que contiene el sistema de ficheros raíz.

source: Starting up <filename>vinum</filename> Early Enough for the Root File System
es: Arrancando <filename>vinum</filename> Suficientemente Pronto para el Sistema de Ficheros Raíz

source: <filename>vinum</filename> must be available early in the system boot as <citerefentry><refentrytitle>loader</refentrytitle><manvolnum>8</manvolnum></citerefentry> must be able to load the vinum kernel module before starting the kernel. This can be accomplished by putting this line in <filename>/boot/loader.conf</filename>:
es: <filename>vinum</filename> debe estar disponible pronto en el arranque del sistema puesto que <citerefentry><refentrytitle>loader</refentrytitle><manvolnum>8</manvolnum></citerefentry> debe ser capaz de cargar el módulo del kernel de vinum antes de arrancar el kernel. Esto se puede conseguir poniendo la siguiente línea en <filename>/boot/loader.conf</filename>:

source: Making a <filename>vinum</filename>-based Root Volume Accessible to the Bootstrap
es: Haciendo Accesible un Volumen Raíz basado en <filename>vinum</filename> en el Código de Arranque

source: The current FreeBSD bootstrap is only 7.5 KB of code and does not understand the internal <filename>vinum</filename> structures. This means that it cannot parse the <filename>vinum</filename> configuration data or figure out the elements of a boot volume. Thus, some workarounds are necessary to provide the bootstrap code with the illusion of a standard <literal>a</literal> partition that contains the root file system.
es: El código de arranque de FreeBSD ocupa sólo 7.5 KB y no entiende las estructuras internas de <filename>vinum</filename>. Esto significa que no puede parsear los datos de configuración de <filename>vinum</filename> o resolver los elementos de un volumen de arranque. Por lo tanto, se necesitan algunas soluciones alternativas para proporcionar al código de arranque con el espejismo de una partición estándar <literal>a</literal> que contiene el sistema de ficheros raíz.

source: For this to be possible, the following requirements must be met for the root volume:
es: Para que esto sea posible, el volumen raíz debe cumplir los siguientes requisitos:

source: The root volume must not be a stripe or <acronym>RAID</acronym>-5.
es: El volumen raíz no debe ser un segmento o <acronym>RAID</acronym>-5.

source: The root volume must not contain more than one concatenated subdisk per plex.
es: El volumen raíz no debe contener más de un subdisco concatenado por plex.

source: Note that it is desirable and possible to use multiple plexes, each containing one replica of the root file system. The bootstrap process will only use one replica for finding the bootstrap and all boot files, until the kernel mounts the root file system. Each single subdisk within these plexes needs its own <literal>a</literal> partition illusion, for the respective device to be bootable. It is not strictly needed that each of these faked <literal>a</literal> partitions is located at the same offset within its device, compared with other devices containing plexes of the root volume. However, it is probably a good idea to create the <filename>vinum</filename> volumes that way so the resulting mirrored devices are symmetric, to avoid confusion.
es: Ten en cuenta que es deseable y posible utilizar múltiples plexes, cada uno conteniendo una réplica del sistema de ficheros raíz. El proceso de arranque sólo utilizará una réplica para encontrar el sistema de arranca y todos los ficheros de arranque, hasta que el kernel monta el sistema de ficheros raíz. Cada subdisco en estos plexes necesita su propio espejismo de partición<literal>a</literal>, para que el dispositivo respectivo sea arrancable. No es estrictamente necesario que cada una de estas particiones <literal>a</literal> simuladas estén localizadas en el mismo desplazamiento en el dispositivo, comparado con otros dispositivos que contienen plexes del volumen raíz. Sin embargo, probablemente sea buena idea crear volúmenes <filename>vinum</filename> de ese modo de forma que los dispositivos en espejo sean simétricos, para evitar confusión.

source: In order to set up these <literal>a</literal> partitions for each device containing part of the root volume, the following is required:
es: Para establecer estas particiones <literal>a</literal> para cada dispositivo que contiene una parte del volumen raíz, se necesite lo siguiente:

source: The location, offset from the beginning of the device, and size of this device's subdisk that is part of the root volume needs to be examined, using the command:
es: La localización, desplazamiento desde el principio del dispositivo, y el tamaño del subdisco del dispositivo que forma parte del volumen raíz necesita ser examinado, usando el siguiente comando:

source: <filename>vinum</filename> offsets and sizes are measured in bytes. They must be divided by 512 in order to obtain the block numbers that are to be used by <command>bsdlabel</command>.
es: Los desplazamientos y tamaños en <filename>vinum</filename> se miden en bytes. Estos deben ser divididos entre 512 para obtener los números de bloque que van a ser usados por <command>bsdlabel</command>.

source: Run this command for each device that participates in the root volume:
es: Ejecuta este comando para cada dispositivo que participa en el volumen raíz:

source: <replaceable>devname</replaceable> must be either the name of the disk, like <filename>da0</filename> for disks without a slice table, or the name of the slice, like <filename>ad0s1</filename>.
es: <replaceable>devname</replaceable> debe ser o el nombre del disco, como <filename>da0</filename> para discos sin una tabla de rebanadas, or el nombre de la rebanada, como <filename>ad0s1</filename>.

source: If there is already an <literal>a</literal> partition on the device from a pre-<filename>vinum</filename> root file system, it should be renamed to something else so that it remains accessible (just in case), but will no longer be used by default to bootstrap the system. A currently mounted root file system cannot be renamed, so this must be executed either when being booted from a <quote>Fixit</quote> media, or in a two-step process where, in a mirror, the disk that is not been currently booted is manipulated first.
es: Si ya hay en el dispositivo una partición <literal>a</literal> de un sistema raíz pre-<filename>vinum</filename>, se debería renombrar a algo diferente de forma que se mantenga accesible (por si acaso), pero ya no será utilizado como arranque por defecto del sistema. Un sistema de ficheros raíz que está actualmente montado no puede ser renombrado, así que esto se debe ejecutar arrancando desde un medio <quote>Fixit</quote>, o en un proceso de dos pasos donde, en una configuración en espejo, el disco que no está siendo arrancando es manipulado primero.

source: The offset of the <filename>vinum</filename> partition on this device (if any) must be added to the offset of the respective root volume subdisk on this device. The resulting value will become the <literal>offset</literal> value for the new <literal>a</literal> partition. The <literal>size</literal> value for this partition can be taken verbatim from the calculation above. The <literal>fstype</literal> should be <literal>4.2BSD</literal>. The <literal>fsize</literal>, <literal>bsize</literal>, and <literal>cpg</literal> values should be chosen to match the actual file system, though they are fairly unimportant within this context.
es: El desplazamiento de la partición <filename>vinum</filename> en este dispositivo (si lo hay) se debe añadir al desplazamiento del subdisco del volumen raíz respectivo en este dispositivo.El valor resultante será el valor del <literal>offset</literal> para la nueva partición <literal>a</literal>. El valor de <literal>size</literal> para esta partición se tomará de forma literal del cálculo anterior. El <literal>fstype</literal> debería ser <literal>4.2BSD</literal>. Los valores <literal>fsize</literal>, <literal>bsize</literal>, y <literal>cpg</literal> deberían ser escogidos para que coincidan con el sistema de ficheros real, aunque no son realmente importantes en este contexto.

source: That way, a new <literal>a</literal> partition will be established that overlaps the <filename>vinum</filename> partition on this device. <command>bsdlabel</command> will only allow for this overlap if the <filename>vinum</filename> partition has properly been marked using the <literal>vinum</literal> fstype.
es: De ese modo, se establecerá una nueva partición <literal>a</literal> que solapa la partición <filename>vinum</filename> en este dispositivo.<command>bsdlabel</command> solo permitirá este solapamiento si la partición <filename>vinum</filename> ha sido adecuadamente marcada utilizando el fstype <literal>vinum</literal>.

source: A faked <literal>a</literal> partition now exists on each device that has one replica of the root volume. It is highly recommendable to verify the result using a command like:
es: Ahora existe una falsa partición <literal>a</literal> en cada dispositivo que tiene una réplica del volumen raíz. Es altamente recomendable verificar el resultado usando un comando como:

source: It should be remembered that all files containing control information must be relative to the root file system in the <filename>vinum</filename> volume which, when setting up a new <filename>vinum</filename> root volume, might not match the root file system that is currently active. So in particular, <filename>/etc/fstab</filename> and <filename>/boot/loader.conf</filename> need to be taken care of.
es: Debería recordarse que todos los ficheros que contienen información de control deben ser relativos al sistema de ficheros raíz en el volumen <filename>vinum</filename> que, cuando se establece un nuevo volumen raíz <filename>vinum</filename>, podría no coincidir con el sistema de ficheros raíz que está actualmente activo. Así que en concreto, hay que tener cuidado con <filename>/etc/fstab</filename> y <filename>/boot/loader.conf</filename>.

source: At next reboot, the bootstrap should figure out the appropriate control information from the new <filename>vinum</filename>-based root file system, and act accordingly. At the end of the kernel initialization process, after all devices have been announced, the prominent notice that shows the success of this setup is a message like:
es: En el siguiente reinicio, el código de arranque debería averiguar la información de control apropiada en el nuevo sistema de ficheros raíz <filename>vinum</filename>, y actuar en consecuencia. Al final del proceso de inicialización del kernel, después de que todos los dispositivos han sido anunciados, el aviso destacado que muestra el éxito de esta configuración es un mensaje como este:

source: Example of a <filename>vinum</filename>-based Root Setup
es: Ejemplo de una Configuración Raíz basada en <filename>vinum</filename>

source: After the <filename>vinum</filename> root volume has been set up, the output of <command>gvinum l -rv root</command> could look like:
es: Después de que el volumen raíz <filename>vinum</filename> ha sido configurado, la salida de <command>gvinum l -rv root</command> podría ser como:

source: The values to note are <literal>135680</literal> for the offset, relative to partition <filename class="devicefile">/dev/da0h</filename>. This translates to 265 512-byte disk blocks in <command>bsdlabel</command>'s terms. Likewise, the size of this root volume is 245760 512-byte blocks. <filename class="devicefile">/dev/da1h</filename>, containing the second replica of this root volume, has a symmetric setup.
es: Los valores en los que fijarse son <literal>135680</literal> para el offset, en relación a la partición <filename class="devicefile">/dev/da0h</filename>. Esto se traduce en 256 bloques de disco de 512 bytes en términos de <command>bsdlabel</command>. De igual modo, el tamaño de este volumen raíz es 245760 bloques de 512 bytes. <filename class="devicefile">/dev/da1h</filename>, al contener la segunda réplica de este volumen raíz, tiene una configuración asimétrica.

source: The bsdlabel for these devices might look like:
es: El bsdlabel para estos dispositivos podría parecerse a:

source: It can be observed that the <literal>size</literal> parameter for the faked <literal>a</literal> partition matches the value outlined above, while the <literal>offset</literal> parameter is the sum of the offset within the <filename>vinum</filename> partition <literal>h</literal>, and the offset of this partition within the device or slice. This is a typical setup that is necessary to avoid the problem described in <xref linkend="vinum-root-panic"/>. The entire <literal>a</literal> partition is completely within the <literal>h</literal> partition containing all the <filename>vinum</filename> data for this device.
es: Se puede observar que el parámetro<literal>size</literal> para la partición falsa <literal>a</literal> coincide con el valor esbozado arriba, mientras que el parámetro <literal>offset</literal> es la suma del ofset dentro de la partición <filename>vinum</filename> <literal>h</literal>, y el offset de esta partición dentro del dispositivo o rebanada. Esta es una configuración típica que es necesaria para evitar el problema descrito en <xref linkend="vinum-root-panic"/>. La partición <literal>a</literal> entera está completamente dentro de la partición <literal>h</literal> que contiene todos los datos <filename>vinum</filename> para este dispositivo.

source: In the above example, the entire device is dedicated to <filename>vinum</filename> and there is no leftover pre-<filename>vinum</filename> root partition.
es: En el ejemplo de arriba, el dispositivo entero está dedicado a <filename>vinum</filename> y no hay una partición raíz pre-<filename>vinum</filename> restante.

source: Troubleshooting
es: Solución de problemas

source: The following list contains a few known pitfalls and solutions.
es: La siguiente lista contiene unos pocos problemas conocidos y sus soluciones.

source: System Bootstrap Loads, but System Does Not Boot
es: El Sistema de Arranque Carga, pero el Sistema No Arranca

source: If for any reason the system does not continue to boot, the bootstrap can be interrupted by pressing <keycap>space</keycap> at the 10-seconds warning. The loader variable <literal>vinum.autostart</literal> can be examined by typing <command>show</command> and manipulated using <command>set</command> or <command>unset</command>.
es: Si por algún motivo el sistema con continúa con el arranque, el proceso de arranque se puede interrumpir presionando<keycap>espacio</keycap> durante el aviso de 10 segundos. La variable del cargador <literal>vinum.autostart</literal> puede examinarse tecleando <command>show</command> y manipularse usando <command>set</command> o <command>unset</command>.

source: If the <filename>vinum</filename> kernel module was not yet in the list of modules to load automatically, type <command>load geom_vinum</command>.
es: Si el módulo del kernel de <filename>vinum</filename> no estaba en la lista de módulos que son cargados automáticamente, teclea <command>load geom_vinum</command>.

source: When ready, the boot process can be continued by typing <command>boot -as</command> which <option>-as</option> requests the kernel to ask for the root file system to mount (<option>-a</option>) and make the boot process stop in single-user mode (<option>-s</option>), where the root file system is mounted read-only. That way, even if only one plex of a multi-plex volume has been mounted, no data inconsistency between plexes is being risked.
es: Cuando está listo, el proceso de arranque puede continuar tecleando <command>boot -as</command> <option>-as</option> solicita al kernel que pregunte por el sistema de ficheros raíz a montar (<option>-a</option>) y hacer que el proceso de arranque pare en modo de usuario único (<option>-s</option>), donde el sistema de ficheros raíz está montado como solo lectura. De ese modo, incluso si sólo ha sido montado un plex de un volumen multi-plex, no hay riesgo de inconsistencia de datos entre plexes.
