Repository: doc-br/translate
Catalog: articles/*/vinum.po
Languages: es

source: Although a plex represents the complete data of a volume, it is possible for parts of the representation to be physically missing, either by design (by not defining a subdisk for parts of the plex) or by accident (as a result of the failure of a drive). As long as at least one plex can provide the data for the complete address range of the volume, the volume is fully functional.
es: Aunque un plex representa los datos completos de un volumen, es posible que algunas partes de esta representación falten físicamente, bien por diseño (no definiendo un subdisco para algunas partes del plex) o por accidente (como resultado del fallo de una unidad). Mientras un plex pueda proveer los datos para el rango completo de direcciones del volumen, este es plenamente funcional.

source: Which Plex Organization?
es: ¿Qué Organización Plex?

source: <filename>vinum</filename> implements both concatenation and striping at the plex level:
es: <filename>vinum</filename> implementa tanto concatenación como segmentado a nivel de plex:

source: A <emphasis>concatenated plex</emphasis> uses the address space of each subdisk in turn. Concatenated plexes are the most flexible as they can contain any number of subdisks, and the subdisks may be of different length. The plex may be extended by adding additional subdisks. They require less <acronym>CPU</acronym> time than striped plexes, though the difference in <acronym>CPU</acronym> overhead is not measurable. On the other hand, they are most susceptible to hot spots, where one disk is very active and others are idle.
es: Un <emphasis>plex concatenado</emphasis> usa el espacio de direcciones de cada subdisco por turnos. Los plexes concatenados son los más flexibles ya que pueden contener cualquier número de subdiscos, y los subidscos pueden ser de distintas longitudes. El plex se puede extender añadiendo subdiscos adicionales. Requieren menos tiempo de <acronym>CPU</acronym> que los plexes segmentados, aunque la diferencia en sobrecarga de <acronym>CPU</acronym> casi no se nota. Por otro lado, son más susceptibles a los puntos calientes, en donde un disco está muy activo y los otros ociosos.

source: A <emphasis>striped plex</emphasis> stripes the data across each subdisk. The subdisks must all be the same size and there must be at least two subdisks in order to distinguish it from a concatenated plex. The greatest advantage of striped plexes is that they reduce hot spots. By choosing an optimum sized stripe, about 256 kB, the load can be evened out on the component drives. Extending a plex by adding new subdisks is so complicated that <filename>vinum</filename> does not implement it.
es: Un <emphasis>plex segmentado</emphasis> reparte los datos entre los distintos subdiscos. Los subdiscos deben tener todos el mismo tamaño y debe haber al menos dos subdiscos para poder distinguirlo de un plex concatenado. La mayor ventaja de los plexes segmentados es que reducen los puntos calientes. Escogiendo un tamaño óptimo de segmento, alrededor de 256 kB, la carga se puede repartir equitativamente entre las unidades. Extender un plex añadiendo nuevos subdiscos es tan complicado que <filename>vinum</filename> no lo implementa.

source: <xref linkend="vinum-comparison"/> summarizes the advantages and disadvantages of each plex organization.
es: <xref linkend="vinum-comparison"/> resume las ventajas y desventajas de cada organización plex.

source: <filename>vinum</filename> Plex Organizations
es: Organizaciones Plex en <filename>vinum</filename>

source: Plex type
es: Tipo de plex

source: Minimum subdisks
es: Subdiscos mínimos

source: Can add subdisks
es: Puede añadir subdiscos

source: Must be equal size
es: Deben tener el mismo tamaño

source: Application
es: Aplicación

source: concatenated
es: concatenado

source: yes
es: si

source: Large data storage with maximum placement flexibility and moderate performance
es: Almacenamiento de grandes cantidades de datos con máxima flexibilidad de colocación y rendimiento moderado

source: striped
es: segmentado

source: High performance in combination with highly concurrent access
es: Alto rendimiento combinado con acceso altamente concurrente

source: Some Examples
es: Algunos Ejemplos

source: <filename>vinum</filename> maintains a <emphasis>configuration database</emphasis> which describes the objects known to an individual system. Initially, the user creates the configuration database from one or more configuration files using <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. <filename>vinum</filename> stores a copy of its configuration database on each disk <emphasis>device</emphasis> under its control. This database is updated on each state change, so that a restart accurately restores the state of each <filename>vinum</filename> object.
es: <filename>vinum</filename> mantiene una <emphasis>base de datos de configuración</emphasis> la cual describe los objetos que son conocidos a un sistema individual. Inicialmente, el usuario crea la base de datos de configuración a partir de uno o más ficheros de configuración utilizando <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. <filename>vinum</filename> almacena una copia de su base de datos de configuración en cada <emphasis>dispositivo</emphasis> de disco bajo su control. Esta base de datos se actualiza con cada cambio de estado, de forma que un reinicio restablece de forma precisa el estado de cada objeto de <filename>vinum</filename>.

source: The Configuration File
es: El Fichero de Configuración

source: The configuration file describes individual <filename>vinum</filename> objects. The definition of a simple volume might be:
es: El fichero de configuración describe objetos de <filename>vinum</filename> individuales. La definición de un volumen sencillo podría ser:

source: This file describes four <filename>vinum</filename> objects:
es: Este fichero describe cuatro objetos <filename>vinum</filename>:

source: The <emphasis>drive</emphasis> line describes a disk partition (<emphasis>drive</emphasis>) and its location relative to the underlying hardware. It is given the symbolic name <emphasis>a</emphasis>. This separation of symbolic names from device names allows disks to be moved from one location to another without confusion.
es: La línea <emphasis>unidad</emphasis> describe una partición de disco (<emphasis>unidad</emphasis>) y su localización relativa al hardware que hay debajo. Se le da el nombre simbólico <emphasis>a</emphasis>. La separación entre los nombres simbólicos y los nombres de dispositivo permite mover discos de un lugar a otro sin confusión.

source: The <emphasis>volume</emphasis> line describes a volume. The only required attribute is the name, in this case <emphasis>myvol</emphasis>.
es: La línea <emphasis>volumen</emphasis> describe un volumen. El único atributo requerido es el nombre, en este caso <emphasis>myvol</emphasis>.

source: The <emphasis>plex</emphasis> line defines a plex. The only required parameter is the organization, in this case <emphasis>concat</emphasis>. No name is necessary as the system automatically generates a name from the volume name by adding the suffix <emphasis>.p</emphasis><emphasis>x</emphasis>, where <emphasis>x</emphasis> is the number of the plex in the volume. Thus this plex will be called <emphasis>myvol.p0</emphasis>.
es: La línea <emphasis>plex</emphasis> define un lex. El único parámetro requerido es la organización, en este caso <emphasis>concat</emphasis>. El nombre no es necesario ya que el sistema genera uno automáticamente a partir del nombre del volumen añadiendo el sufijo <emphasis>.p</emphasis><emphasis>x</emphasis>, donde <emphasis>x</emphasis> es el número del plex en el volumen. Por lo tanto este plex se llamará <emphasis>myvol.p0</emphasis>.

source: The <emphasis>sd</emphasis> line describes a subdisk. The minimum specifications are the name of a drive on which to store it, and the length of the subdisk. No name is necessary as the system automatically assigns names derived from the plex name by adding the suffix <emphasis>.s</emphasis><emphasis>x</emphasis>, where <emphasis>x</emphasis> is the number of the subdisk in the plex. Thus <filename>vinum</filename> gives this subdisk the name <emphasis>myvol.p0.s0</emphasis>.
es: La línea <emphasis>sd</emphasis> describe un subdisco. La especificación mínima incluye el nombre de la unidad en la que almacenarlo, y la longitud del subdisco. El bombre no es necesario ya que el sistema asigna un nombre automáticamente derivado del nombre del plex añadiendo el sufijo <emphasis>.s</emphasis><emphasis>x</emphasis>, donde <emphasis>x</emphasis> es el número del subdisco en el plex. Por lo tanto <filename>vinum</filename> asigna a este subdisco el nombre <emphasis>myvol.p0.s0</emphasis>.

source: After processing this file, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> produces the following output:
es: Después de procesar este fichero, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> produce la siguiente salida:

source: This output shows the brief listing format of <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. It is represented graphically in <xref linkend="vinum-simple-vol"/>.
es: Esta salida muestra el formato de lista abreviada de <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry>. Está representado gráficamente en <xref linkend="vinum-simple-vol"/>.

source: A Simple <filename>vinum</filename> Volume
es: Un Volumen <filename>vinum</filename> Sencillo

source: This figure, and the ones which follow, represent a volume, which contains the plexes, which in turn contains the subdisks. In this example, the volume contains one plex, and the plex contains one subdisk.
es: Esta imagen, y las que siguen, representa un volumen, el cual contiene plexes, que a su vez contienen subdiscos. En este ejemplo, el volumen contiene u nplex, y el plex contiene un subdisco.

source: This particular volume has no specific advantage over a conventional disk partition. It contains a single plex, so it is not redundant. The plex contains a single subdisk, so there is no difference in storage allocation from a conventional disk partition. The following sections illustrate various more interesting configuration methods.
es: Este volumen en particular no tiene ninguna ventaja sobre una partición de disco convencional. Contiene un solo plex, así que no es redundante. El plex contiene un solo subdisco, así que no hay diferencia en la asignación de almacenamiento respecto a una partición de disco convencional. Las siguientes secciones ilustran varios métodos de configuración más interesantes.

source: Increased Resilience: Mirroring
es: Resiliencia Incrementada: Configuración en Espejo

source: The resilience of a volume can be increased by mirroring. When laying out a mirrored volume, it is important to ensure that the subdisks of each plex are on different drives, so that a drive failure will not take down both plexes. The following configuration mirrors a volume:
es: La resiliencia de un volumen puede ser incrementada mediante una configuración en espejo. Cuando se diseña un volumen en espejo, es importante asegurar que los subdiscos de cada plex están en diferentes unidades, de forma que el fallo de una unidad no arrastre ambos plexes. La siguiente configuración crea un espejo de un volumen:

source: In this example, it was not necessary to specify a definition of drive <emphasis>a</emphasis> again, since <filename>vinum</filename> keeps track of all objects in its configuration database. After processing this definition, the configuration looks like:
es: En este ejemplo, no ha sido necesario especificar la definición de la unidad <emphasis>a</emphasis> de nuevo, ya que <filename>vinum</filename> hace un seguimiento de todos los objetos en su base de datos de configuración. Después de procesar esta definición, la configuración tiene este aspecto:

source: <xref linkend="vinum-mirrored-vol"/> shows the structure graphically.
es: <xref linkend="vinum-mirrored-vol"/> muestra la estructura gráficamente.

source: A Mirrored <filename>vinum</filename> Volume
es: Un Volumen <filename>vinum</filename> en Espejo

source: In this example, each plex contains the full 512 MB of address space. As in the previous example, each plex contains only a single subdisk.
es: En este ejemplo, cada plex contiene los 512 MB del espacio de direcciones completo. Como en el ejemplo anterior, cada plex contiene solo un subdisco.

source: Optimizing Performance
es: Optimizando el Rendimiento

source: The mirrored volume in the previous example is more resistant to failure than an unmirrored volume, but its performance is less as each write to the volume requires a write to both drives, using up a greater proportion of the total disk bandwidth. Performance considerations demand a different approach: instead of mirroring, the data is striped across as many disk drives as possible. The following configuration shows a volume with a plex striped across four disk drives:
es: El volumen en espejo del ejemplo anterior es más resistente a fallos que un volumen que no esté en espejo, pero su rendimiento es menor ya que cada escritura en el volumen requiere una escritura en ambas unidades, usando una mayor porción del ancho de banda total del disco. Las consideraciones de rendimiento requieren una aproximación diferente: en lugar de replicar en espejo, los datos son segmentados en tantas unidades de disco como sea posible. La siguiente configuración muestra un volumen con un plex segmentado en cuatro discos:

source: As before, it is not necessary to define the drives which are already known to <filename>vinum</filename>. After processing this definition, the configuration looks like:
es: Como antes, no es necesario definir las unidades que ya son conocidas por <filename>vinum</filename>. Después de procesar esta definición, la configuración tiene este aspecto:

source: A Striped <filename>vinum</filename> Volume
es: Un Volumen <filename>vinum</filename> Segmentado

source: This volume is represented in <xref linkend="vinum-striped-vol"/>. The darkness of the stripes indicates the position within the plex address space, where the lightest stripes come first and the darkest last.
es: Este volumen está representado en <xref linkend="vinum-striped-vol"/>. El color oscuro de los segmentos indican la posición dentro del espacio de direcciones del plex, donde los segmentos más claros aparecen primero y los más oscuros últimos.

source: Resilience and Performance
es: Resiliencia y Rendimiento

source: <anchor xml:id="vinum-resilience"/>With sufficient hardware, it is possible to build volumes which show both increased resilience and increased performance compared to standard <trademark class="registered">UNIX</trademark> partitions. A typical configuration file might be:
es: <anchor xml:id="vinum-resilience"/>Con suficiente hardware, es posible construir volúmenes que muestren resiliencia aumentada y rendimiento aumentado comparado con particiones <trademark class="registered">UNIX</trademark> estándar. Una configuración típica podría ser:

source: The subdisks of the second plex are offset by two drives from those of the first plex. This helps to ensure that writes do not go to the same subdisks even if a transfer goes over two drives.
es: Los subdiscos del segundo plex están desplazados en dos unidades respecto a aquellos en el primer flex. Esto ayuda a garantizar que las escrituras no van al mismo subdisco incluso si la transferencia se realiza sobre dos unidades.

source: <xref linkend="vinum-raid10-vol"/> represents the structure of this volume.
es: <xref linkend="vinum-raid10-vol"/> representa la estructura de este volumen.

source: A Mirrored, Striped <filename>vinum</filename> Volume
es: Un Volumen <filename>vinum</filename> Segmentado en Espejo

source: Object Naming
es: Nombrado de Objetos

source: <filename>vinum</filename> assigns default names to plexes and subdisks, although they may be overridden. Overriding the default names is not recommended as it does not bring a significant advantage and it can cause confusion.
es: <filename>vinum</filename> asigna nombres por defecto a los plexes y los subdiscos, aunque pueden ser modificados. Modificar los nombres por defecto no está recomendado ya que no proprorciona una ventaja significativa y puede provocar confusión.

source: Names may contain any non-blank character, but it is recommended to restrict them to letters, digits and the underscore characters. The names of volumes, plexes, and subdisks may be up to 64 characters long, and the names of drives may be up to 32 characters long.
es: Los nombres pueden contener cualquier carácter que no sea blanco, pero se recomienda restringirlos a letras, dígitos y al carácter subrayado. Los nombres de los volúmenes, plexes y subdiscos pueden tener hasta 64 caracteres de longitud, y los nombres de unidades pueden ser de hasta 32 caracteres de longitud.

source: <filename>vinum</filename> objects are assigned device nodes in the hierarchy <filename class="directory">/dev/gvinum</filename>. The configuration shown above would cause <filename>vinum</filename> to create the following device nodes:
es: A los objetos<filename>vinum</filename> se les asignan nodos de dispositivo en la jerarquía <filename class="directory">/dev/gvinum</filename>. La configuración que se muestra arriba haría que <filename>vinum</filename> creara los siguientes nodos de dispositivo:

source: Device entries for each volume. These are the main devices used by <filename>vinum</filename>. The configuration above would include the devices <filename class="devicefile">/dev/gvinum/myvol</filename>, <filename class="devicefile">/dev/gvinum/mirror</filename>, <filename class="devicefile">/dev/gvinum/striped</filename>, <filename class="devicefile">/dev/gvinum/raid5</filename> and <filename class="devicefile">/dev/gvinum/raid10</filename>.
es: Entradas de dispositivo para cada volumen. Estos son los dispositivos principales utilizados por <filename>vinum</filename>. La configuración anterior incluiría los dispositivos <filename class="devicefile">/dev/gvinum/myvol</filename>, <filename class="devicefile">/dev/gvinum/mirror</filename>, <filename class="devicefile">/dev/gvinum/striped</filename>, <filename class="devicefile">/dev/gvinum/raid5</filename> y <filename class="devicefile">/dev/gvinum/raid10</filename>.

source: All volumes get direct entries under <filename class="directory">/dev/gvinum/</filename>.
es: Todos los volúmenes tienen entradas directas bajo <filename class="directory">/dev/gvinum/</filename>.

source: The directories <filename class="directory">/dev/gvinum/plex</filename>, and <filename class="directory">/dev/gvinum/sd</filename>, which contain device nodes for each plex and for each subdisk, respectively.
es: Los directorios <filename class="directory">/dev/gvinum/plex</filename>, y <filename class="directory">/dev/gvinum/sd</filename>, los cuales contienen nodos de dispositivo para cada plex y para cada subdisco, respectivamente.

source: For example, consider the following configuration file:
es: Por ejemplo, considera el siguiente fichero de configuración:

source: After processing this file, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> creates the following structure in <filename class="directory">/dev/gvinum</filename>:
es: Después de procesar este fichero, <citerefentry><refentrytitle>gvinum</refentrytitle><manvolnum>8</manvolnum></citerefentry> crea la siguiente estructura en <filename class="directory">/dev/gvinum</filename>:

source: Although it is recommended that plexes and subdisks should not be allocated specific names, <filename>vinum</filename> drives must be named. This makes it possible to move a drive to a different location and still recognize it automatically. Drive names may be up to 32 characters long.
es: Aunque se recomienda que los plexes y subdiscos no tengan asignados nombres específicos, las unidades de <filename>vinum</filename> deben tener nombre. Esto hace posible mover una unidad a una localización diferente y que sea reconocida automáticamente. Los nombres de unidad pueden tener una longitud de hasta 32 caracteres.

source: Creating File Systems
es: Creando Sistemas de Ficheros

source: Volumes appear to the system to be identical to disks, with one exception. Unlike <trademark class="registered">UNIX</trademark> drives, <filename>vinum</filename> does not partition volumes, which thus do not contain a partition table. This has required modification to some disk utilities, notably <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>, so that it does not try to interpret the last letter of a <filename>vinum</filename> volume name as a partition identifier. For example, a disk drive may have a name like <filename class="devicefile">/dev/ad0a</filename> or <filename class="devicefile">/dev/da2h</filename>. These names represent the first partition (<filename>a</filename>) on the first (0) IDE disk (<filename>ad</filename>) and the eighth partition (<filename>h</filename>) on the third (2) SCSI disk (<filename>da</filename>) respectively. By contrast, a <filename>vinum</filename> volume might be called <filename class="devicefile">/dev/gvinum/concat</filename>, which has no relationship with a partition name.
es: En el sistema los volúmenes parecen idénticos a los discos, con una excepción. A diferencia de las unidades <trademark class="registered">UNIX</trademark>, <filename>vinum</filename> no particiona los volúmenes, por lo que estos no tienen tabla de particiones. Esto ha requerido modificaciones en algunas utilidades de disco, notablemente de <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>, de forma que no intente interpretar la última letra de un nombre de volumen <filename>vinum</filename>. Por ejemplo, una unidad de disco podría tener un nombre como <filename class="devicefile">/dev/ad0a</filename> o <filename class="devicefile">/dev/da2h</filename>. Estos nombres representan la primera partición (<filename>a</filename>) en el primer (0) disco IDE (<filename>ad</filename>) y la octava partición (<filename>h</filename>) en el tercer (2) disco SCSI (<filename>da</filename>) respectivamente. Por el contrario, un volumen <filename>vinum</filename> podría llamarse <filename class="devicefile">/dev/gvinum/concat</filename>, que no guarda relación con un nombre de partición.

source: In order to create a file system on this volume, use <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>:
es: Para crear un sistema de ficheros en este volumen, usa <citerefentry><refentrytitle>newfs</refentrytitle><manvolnum>8</manvolnum></citerefentry>:

source: Configuring <filename>vinum</filename>
es: Configurando <filename>vinum</filename>
