Repository: doc-br/translate
Catalog: articles/*/vinum.po
Languages: es

source: At the prompt asking for a root file system to mount, any device that contains a valid root file system can be entered. If <filename>/etc/fstab</filename> is set up correctly, the default should be something like <literal>ufs:/dev/gvinum/root</literal>. A typical alternate choice would be something like <literal>ufs:da0d</literal> which could be a hypothetical partition containing the pre-<filename>vinum</filename> root file system. Care should be taken if one of the alias <literal>a</literal> partitions is entered here, that it actually references the subdisks of the <filename>vinum</filename> root device, because in a mirrored setup, this would only mount one piece of a mirrored root device. If this file system is to be mounted read-write later on, it is necessary to remove the other plex(es) of the <filename>vinum</filename> root volume since these plexes would otherwise carry inconsistent data.
es: En el prompt en el que se pregunta por el sistema de ficheros raíz a montar, se puede introducir cualquier dispositivo que contiene un sistema de ficheros raíz válido. Si <filename>/etc/fstab</filename> está configurado correctamente, el valor por defecto debería ser algo como <literal>ufs:/dev/gvinum/root</literal>. Una opción alternativa típica sería algo como <literal>ufs:da0d</literal> que podría contener una hipotética partición de un sistema de ficheros raíz pre-<filename>vinum</filename>. Ha que tener cuidado si se introduce uno de los alias de las particiones <literal>a</literal>, que en realidad referencia los subdiscos del dispositivo raíz <filename>vinum</filename>, porque en una configuración en espejo, esto sólo montaría un trozo del dispositivo raíz en espejo. Si este sistema de ficheros se va a montar como lectura-escritura posteriormente, es necesario eliminar el otro plex(es) del volumen raíz <filename>vinum</filename> puesto que de otro modo los plexes tendrían datos inconsistentes.

source: Only Primary Bootstrap Loads
es: Sólo Carga la Configuración de Arranque Primaria

source: If <filename>/boot/loader</filename> fails to load, but the primary bootstrap still loads (visible by a single dash in the left column of the screen right after the boot process starts), an attempt can be made to interrupt the primary bootstrap by pressing <keycap>space</keycap>. This will make the bootstrap stop in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1">stage two</link>. An attempt can be made here to boot off an alternate partition, like the partition containing the previous root file system that has been moved away from <literal>a</literal>.
es: Si <filename>/boot/loader</filename> falla al cargar, pero la configuración de arranque primaria todavía carga (visible mediante un sólo guión en la columna de la izquierda de la pantalla justo después de que comience el proceso de arranque), se puede intentar interrumpir el arranque primario presionando <keycap>space</keycap>. Esto hará que el proceso de arranque se pare en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1">stage two</link>. Aquí se puede intentar arrancar desde una partición alternativa, como la partición que contiene sl sistema de ficheros raíz anterior que ha sido movido desde <literal>a</literal>.

source: Nothing Boots, the Bootstrap Panics
es: Nada Arranca, el Proceso de Arranque entra en Pánico

source: This situation will happen if the bootstrap had been destroyed by the <filename>vinum</filename> installation. Unfortunately, <filename>vinum</filename> accidentally leaves only 4 KB at the beginning of its partition free before starting to write its <filename>vinum</filename> header information. However, the stage one and two bootstraps plus the bsdlabel require 8 KB. So if a <filename>vinum</filename> partition was started at offset 0 within a slice or disk that was meant to be bootable, the <filename>vinum</filename> setup will trash the bootstrap.
es: Esta situación ocurrirá si el código de arranque ha sido destruido por la instalación de <filename>vinum</filename>. Desafortunadamente, <filename>vinum</filename> deja por accidente sólo 4KB libres al comienzo de su partición antes de empezar a escribir la información de cabecera de <filename>vinum</filename>. Sin embargo, los códigos de arranque de las fases uno y dos más bsdlabel requieren 8 KB. Así que si una partición <filename>vinum</filename> empezó en un offset 0 dentro de una rebanada o disco que se pretendía que fuera arrancable, la configuración de <filename>vinum</filename> se llevará por delante el código de arranque.

source: Similarly, if the above situation has been recovered, by booting from a <quote>Fixit</quote> media, and the bootstrap has been re-installed using <command>bsdlabel -B</command> as described in <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1"/>, the bootstrap will trash the <filename>vinum</filename> header, and <filename>vinum</filename> will no longer find its disk(s). Though no actual <filename>vinum</filename> configuration data or data in <filename>vinum</filename> volumes will be trashed, and it would be possible to recover all the data by entering exactly the same <filename>vinum</filename> configuration data again, the situation is hard to fix. It is necessary to move the entire <filename>vinum</filename> partition by at least 4 KB, in order to have the <filename>vinum</filename> header and the system bootstrap no longer collide.
es: De forma similar, si se ha recuperado de la situación anterior, arrancando desde un medio <quote>Fixit</quote>, y el código de arranque ha sido reinstalado utilizando <command>bsdlabel -B</command> como se describe en <link xlink:href="@@URL_RELPREFIX@@/doc/en_US.ISO8859-1/books/handbook/boot.html#boot-boot1"/>, el código de arranque destruirá la cabecera <filename>vinum</filename>, y <filename>vinum</filename> ya no podrá encontrar su(s) disco(s). Aunque ningún volumen <filename>vinum</filename> o datos de configuración de <filename>vinum</filename> serán destruidos, y sería posible recuperar todos los datos introduciendo de nuevo exactamente los mismos datos de configuración de <filename>vinum</filename> la situación es difícil de arreglar. Es necesario mover la partición <filename>vinum</filename> entera al menos 4 KB, para que la cabecera <filename>vinum</filename> y el código de arranque del sistema ya no colisionen.
